[Killed] EqualityOperator
src/lib/store/checkout.store.ts:78:9
     const isShippingAddressValid = () => {
       const addr = store.shippingAddress();
       return (
-        addr.street.trim().length > 0 &&
+        addr.street.trim().length <= 0 &&
         addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
killedBy: CheckoutStore should validate shipping address fields
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:88:11
 
     const isPaymentInfoValid = () => {
       const pay = store.paymentInfo();
-      if (pay.method === 'PAYPAL') {
+      if (true) {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:91:11
       if (pay.method === 'PAYPAL') {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
-      if (pay.method === 'INVOICE') {
+      if (pay.method !== 'INVOICE') {
         return true;
       }
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:91:11
       if (pay.method === 'PAYPAL') {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
-      if (pay.method === 'INVOICE') {
+      if (true) {
         return true;
       }
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:161:43
     },
 
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
-      if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
+      if (!store.isCustomerInfoValid() || store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
         patchState(store, { orderStatus: 'FAILED' });
         return { success: false, message: 'Invalid checkout information' };
killedBy: CheckoutStore should submit order successfully and produce order confirmation
statusReason: expected false to be true // Object.is equality
