[NoCoverage] ConditionalExpression
apps/api/src/main.js:15:54
   }
   return to;
 };
-var __toESM = (mod, isNodeMode, target) => (target = mod != null ? __create(__getProtoOf(mod)) : {}, __copyProps(
+var __toESM = (mod, isNodeMode, target) => (target = true ? __create(__getProtoOf(mod)) : {}, __copyProps(
   // If the importer is in node compatibility mode or this is not an ESM
   // file that has been converted to a CommonJS file using a Babel-

[NoCoverage] EqualityOperator
apps/api/src/main.js:15:54
   }
   return to;
 };
-var __toESM = (mod, isNodeMode, target) => (target = mod != null ? __create(__getProtoOf(mod)) : {}, __copyProps(
+var __toESM = (mod, isNodeMode, target) => (target = mod == null ? __create(__getProtoOf(mod)) : {}, __copyProps(
   // If the importer is in node compatibility mode or this is not an ESM
   // file that has been converted to a CommonJS file using a Babel-

[NoCoverage] BooleanLiteral
apps/api/src/main.js:20:25
   // file that has been converted to a CommonJS file using a Babel-
   // compatible transform (i.e. "__esModule" has not been set), then set
   // "default" to the CommonJS "module.exports" for node compatibility.
-  isNodeMode || !mod || !mod.__esModule ? __defProp(target, "default", { value: mod, enumerable: true }) : target,
+  isNodeMode || !mod || mod.__esModule ? __defProp(target, "default", { value: mod, enumerable: true }) : target,
   mod
 ));

[NoCoverage] BooleanLiteral
apps/api/src/main.js:20:98
   // file that has been converted to a CommonJS file using a Babel-
   // compatible transform (i.e. "__esModule" has not been set), then set
   // "default" to the CommonJS "module.exports" for node compatibility.
-  isNodeMode || !mod || !mod.__esModule ? __defProp(target, "default", { value: mod, enumerable: true }) : target,
+  isNodeMode || !mod || !mod.__esModule ? __defProp(target, "default", { value: mod, enumerable: false }) : target,
   mod
 ));

[NoCoverage] LogicalOperator
apps/api/src/main.js:25:14
 ));
 var import_express = __toESM(require("express"));
 var import_products = require("@org/api/products");
-const host = process.env.HOST ?? "localhost";
+const host = process.env.HOST && "localhost";
 const port = process.env.PORT ? Number(process.env.PORT) : 3333;
 const app = (0, import_express.default)();

[NoCoverage] StringLiteral
apps/api/src/main.js:25:34
 ));
 var import_express = __toESM(require("express"));
 var import_products = require("@org/api/products");
-const host = process.env.HOST ?? "localhost";
+const host = process.env.HOST ?? "";
 const port = process.env.PORT ? Number(process.env.PORT) : 3333;
 const app = (0, import_express.default)();

[NoCoverage] BlockStatement
apps/api/src/main.js:30:29
 const app = (0, import_express.default)();
 const productsService = new import_products.ProductsService();
 app.use(import_express.default.json());
-app.use((req, res, next) => {
-  res.header("Access-Control-Allow-Origin", "*");
-  res.header("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
-  res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
-  if (req.method === "OPTIONS") {
-    res.sendStatus(200);
-  } else {
-    next();
-  }
-});
+app.use((req, res, next) => {});
 app.get("/", (req, res) => {
   res.send({ message: "Hello API" });

[NoCoverage] StringLiteral
apps/api/src/main.js:31:14
 const productsService = new import_products.ProductsService();
 app.use(import_express.default.json());
 app.use((req, res, next) => {
-  res.header("Access-Control-Allow-Origin", "*");
+  res.header("", "*");
   res.header("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
   res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");

[NoCoverage] StringLiteral
apps/api/src/main.js:33:14
 app.use((req, res, next) => {
   res.header("Access-Control-Allow-Origin", "*");
   res.header("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
-  res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
+  res.header("", "Origin, X-Requested-With, Content-Type, Accept");
   if (req.method === "OPTIONS") {
     res.sendStatus(200);

[NoCoverage] BlockStatement
apps/api/src/main.js:34:33
   res.header("Access-Control-Allow-Origin", "*");
   res.header("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
   res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
-  if (req.method === "OPTIONS") {
-    res.sendStatus(200);
-  } else {
+  if (req.method === "OPTIONS") {} else {
     next();
   }

[NoCoverage] ConditionalExpression
apps/api/src/main.js:34:7
   res.header("Access-Control-Allow-Origin", "*");
   res.header("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
   res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
-  if (req.method === "OPTIONS") {
+  if (false) {
     res.sendStatus(200);
   } else {

[NoCoverage] BlockStatement
apps/api/src/main.js:36:10
   res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
   if (req.method === "OPTIONS") {
     res.sendStatus(200);
-  } else {
-    next();
-  }
+  } else {}
 });
 app.get("/", (req, res) => {

[NoCoverage] BlockStatement
apps/api/src/main.js:40:28
     next();
   }
 });
-app.get("/", (req, res) => {
-  res.send({ message: "Hello API" });
-});
+app.get("/", (req, res) => {});
 app.get("/api/products", (req, res) => {
   try {

[NoCoverage] StringLiteral
apps/api/src/main.js:41:23
   }
 });
 app.get("/", (req, res) => {
-  res.send({ message: "Hello API" });
+  res.send({ message: "" });
 });
 app.get("/api/products", (req, res) => {

[NoCoverage] ConditionalExpression
apps/api/src/main.js:46:9
 app.get("/api/products", (req, res) => {
   try {
     const filter = {};
-    if (req.query.category) {
+    if (false) {
       filter.category = req.query.category;
     }

[NoCoverage] BlockStatement
apps/api/src/main.js:46:29
 app.get("/api/products", (req, res) => {
   try {
     const filter = {};
-    if (req.query.category) {
-      filter.category = req.query.category;
-    }
+    if (req.query.category) {}
     if (req.query.minPrice) {
       filter.minPrice = Number(req.query.minPrice);

[NoCoverage] ConditionalExpression
apps/api/src/main.js:49:9
     if (req.query.category) {
       filter.category = req.query.category;
     }
-    if (req.query.minPrice) {
+    if (false) {
       filter.minPrice = Number(req.query.minPrice);
     }

[NoCoverage] ConditionalExpression
apps/api/src/main.js:49:9
     if (req.query.category) {
       filter.category = req.query.category;
     }
-    if (req.query.minPrice) {
+    if (true) {
       filter.minPrice = Number(req.query.minPrice);
     }

[NoCoverage] BlockStatement
apps/api/src/main.js:52:29
     if (req.query.minPrice) {
       filter.minPrice = Number(req.query.minPrice);
     }
-    if (req.query.maxPrice) {
-      filter.maxPrice = Number(req.query.maxPrice);
-    }
+    if (req.query.maxPrice) {}
     if (req.query.inStock !== void 0) {
       filter.inStock = req.query.inStock === "true";

[NoCoverage] ConditionalExpression
apps/api/src/main.js:52:9
     if (req.query.minPrice) {
       filter.minPrice = Number(req.query.minPrice);
     }
-    if (req.query.maxPrice) {
+    if (true) {
       filter.maxPrice = Number(req.query.maxPrice);
     }

[NoCoverage] BlockStatement
apps/api/src/main.js:55:39
     if (req.query.maxPrice) {
       filter.maxPrice = Number(req.query.maxPrice);
     }
-    if (req.query.inStock !== void 0) {
-      filter.inStock = req.query.inStock === "true";
-    }
+    if (req.query.inStock !== void 0) {}
     if (req.query.searchTerm) {
       filter.searchTerm = req.query.searchTerm;

[NoCoverage] ConditionalExpression
apps/api/src/main.js:55:9
     if (req.query.maxPrice) {
       filter.maxPrice = Number(req.query.maxPrice);
     }
-    if (req.query.inStock !== void 0) {
+    if (false) {
       filter.inStock = req.query.inStock === "true";
     }

[NoCoverage] ConditionalExpression
apps/api/src/main.js:56:24
       filter.maxPrice = Number(req.query.maxPrice);
     }
     if (req.query.inStock !== void 0) {
-      filter.inStock = req.query.inStock === "true";
+      filter.inStock = false;
     }
     if (req.query.searchTerm) {

[NoCoverage] EqualityOperator
apps/api/src/main.js:56:24
       filter.maxPrice = Number(req.query.maxPrice);
     }
     if (req.query.inStock !== void 0) {
-      filter.inStock = req.query.inStock === "true";
+      filter.inStock = req.query.inStock !== "true";
     }
     if (req.query.searchTerm) {

[NoCoverage] BlockStatement
apps/api/src/main.js:58:31
     if (req.query.inStock !== void 0) {
       filter.inStock = req.query.inStock === "true";
     }
-    if (req.query.searchTerm) {
-      filter.searchTerm = req.query.searchTerm;
-    }
+    if (req.query.searchTerm) {}
     const page = req.query.page ? Number(req.query.page) : 1;
     const pageSize = req.query.pageSize ? Number(req.query.pageSize) : 12;

[NoCoverage] ConditionalExpression
apps/api/src/main.js:58:9
     if (req.query.inStock !== void 0) {
       filter.inStock = req.query.inStock === "true";
     }
-    if (req.query.searchTerm) {
+    if (true) {
       filter.searchTerm = req.query.searchTerm;
     }

[NoCoverage] BooleanLiteral
apps/api/src/main.js:66:16
     const result = productsService.getAllProducts(filter, page, pageSize);
     const response = {
       data: result,
-      success: true
+      success: false
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.js:69:19
       success: true
     };
     res.json(response);
-  } catch (error) {
-    const response = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : "Unknown error"
-    };
-    res.status(500).json(response);
-  }
+  } catch (error) {}
 });
 app.get("/api/products/:id", (req, res) => {

[NoCoverage] StringLiteral
apps/api/src/main.js:73:55
     const response = {
       data: null,
       success: false,
-      error: error instanceof Error ? error.message : "Unknown error"
+      error: error instanceof Error ? error.message : ""
     };
     res.status(500).json(response);

[NoCoverage] BlockStatement
apps/api/src/main.js:78:44
     res.status(500).json(response);
   }
 });
-app.get("/api/products/:id", (req, res) => {
-  try {
-    const product = productsService.getProductById(req.params.id);
-    if (!product) {
-      const response2 = {
-        data: null,
-        success: false,
-        error: "Product not found"
-      };
-      return res.status(404).json(response2);
-    }
-    const response = {
-      data: product,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
-    const response = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : "Unknown error"
-    };
-    res.status(500).json(response);
-  }
-});
+app.get("/api/products/:id", (req, res) => {});
 app.get("/api/products-metadata/categories", (req, res) => {
   try {

[NoCoverage] StringLiteral
apps/api/src/main.js:78:9
     res.status(500).json(response);
   }
 });
-app.get("/api/products/:id", (req, res) => {
+app.get("", (req, res) => {
   try {
     const product = productsService.getProductById(req.params.id);

[NoCoverage] BlockStatement
apps/api/src/main.js:79:7
   }
 });
 app.get("/api/products/:id", (req, res) => {
-  try {
-    const product = productsService.getProductById(req.params.id);
-    if (!product) {
-      const response2 = {
-        data: null,
-        success: false,
-        error: "Product not found"
-      };
-      return res.status(404).json(response2);
-    }
-    const response = {
-      data: product,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response = {
       data: null,

[NoCoverage] BlockStatement
apps/api/src/main.js:81:19
 app.get("/api/products/:id", (req, res) => {
   try {
     const product = productsService.getProductById(req.params.id);
-    if (!product) {
-      const response2 = {
-        data: null,
-        success: false,
-        error: "Product not found"
-      };
-      return res.status(404).json(response2);
-    }
+    if (!product) {}
     const response = {
       data: product,

[NoCoverage] BooleanLiteral
apps/api/src/main.js:81:9
 app.get("/api/products/:id", (req, res) => {
   try {
     const product = productsService.getProductById(req.params.id);
-    if (!product) {
+    if (product) {
       const response2 = {
         data: null,

[NoCoverage] ObjectLiteral
apps/api/src/main.js:82:25
   try {
     const product = productsService.getProductById(req.params.id);
     if (!product) {
-      const response2 = {
-        data: null,
-        success: false,
-        error: "Product not found"
-      };
+      const response2 = {};
       return res.status(404).json(response2);
     }

[NoCoverage] ObjectLiteral
apps/api/src/main.js:89:22
       };
       return res.status(404).json(response2);
     }
-    const response = {
-      data: product,
-      success: true
-    };
+    const response = {};
     res.json(response);
   } catch (error) {

[NoCoverage] BooleanLiteral
apps/api/src/main.js:91:16
     }
     const response = {
       data: product,
-      success: true
+      success: false
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.js:103:60
     res.status(500).json(response);
   }
 });
-app.get("/api/products-metadata/categories", (req, res) => {
-  try {
-    const categories = productsService.getCategories();
-    const response = {
-      data: categories,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
-    const response = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : "Unknown error"
-    };
-    res.status(500).json(response);
-  }
-});
+app.get("/api/products-metadata/categories", (req, res) => {});
 app.get("/api/products-metadata/price-range", (req, res) => {
   try {

[NoCoverage] BlockStatement
apps/api/src/main.js:104:7
   }
 });
 app.get("/api/products-metadata/categories", (req, res) => {
-  try {
-    const categories = productsService.getCategories();
-    const response = {
-      data: categories,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response = {
       data: null,

[NoCoverage] ObjectLiteral
apps/api/src/main.js:106:22
 app.get("/api/products-metadata/categories", (req, res) => {
   try {
     const categories = productsService.getCategories();
-    const response = {
-      data: categories,
-      success: true
-    };
+    const response = {};
     res.json(response);
   } catch (error) {

[NoCoverage] BooleanLiteral
apps/api/src/main.js:108:16
     const categories = productsService.getCategories();
     const response = {
       data: categories,
-      success: true
+      success: false
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.js:120:61
     res.status(500).json(response);
   }
 });
-app.get("/api/products-metadata/price-range", (req, res) => {
-  try {
-    const priceRange = productsService.getPriceRange();
-    const response = {
-      data: priceRange,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
-    const response = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : "Unknown error"
-    };
-    res.status(500).json(response);
-  }
-});
+app.get("/api/products-metadata/price-range", (req, res) => {});
 app.listen(port, host, () => {
   console.log(`[ ready ] http://${host}:${port}`);

[NoCoverage] BlockStatement
apps/api/src/main.js:121:7
   }
 });
 app.get("/api/products-metadata/price-range", (req, res) => {
-  try {
-    const priceRange = productsService.getPriceRange();
-    const response = {
-      data: priceRange,
-      success: true
-    };
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response = {
       data: null,

[NoCoverage] ObjectLiteral
apps/api/src/main.js:123:22
 app.get("/api/products-metadata/price-range", (req, res) => {
   try {
     const priceRange = productsService.getPriceRange();
-    const response = {
-      data: priceRange,
-      success: true
-    };
+    const response = {};
     res.json(response);
   } catch (error) {

[NoCoverage] BooleanLiteral
apps/api/src/main.js:125:16
     const priceRange = productsService.getPriceRange();
     const response = {
       data: priceRange,
-      success: true
+      success: false
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.js:137:30
     res.status(500).json(response);
   }
 });
-app.listen(port, host, () => {
-  console.log(`[ ready ] http://${host}:${port}`);
-});
+app.listen(port, host, () => {});
 

[NoCoverage] StringLiteral
apps/api/src/main.js:138:15
   }
 });
 app.listen(port, host, () => {
-  console.log(`[ ready ] http://${host}:${port}`);
+  console.log(``);
 });
 
