[NoCoverage] LogicalOperator
apps/api/src/main.ts:5:14
 import { ProductsService } from '@org/api/products';
 import { ApiResponse, Product, ProductFilter, PaginatedResponse } from '@org/models';
 
-const host = process.env.HOST ?? 'localhost';
+const host = process.env.HOST && 'localhost';
 const port = process.env.PORT ? Number(process.env.PORT) : 3333;
 

[NoCoverage] BlockStatement
apps/api/src/main.ts:15:29
 app.use(express.json());
 
 // CORS configuration for Angular app
-app.use((req, res, next) => {
-  res.header('Access-Control-Allow-Origin', '*');
-  res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
-  res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
-  if (req.method === 'OPTIONS') {
-    res.sendStatus(200);
-  } else {
-    next();
-  }
-});
+app.use((req, res, next) => {});
 
 app.get('/', (req, res) => {

[NoCoverage] StringLiteral
apps/api/src/main.ts:17:46
 // CORS configuration for Angular app
 app.use((req, res, next) => {
   res.header('Access-Control-Allow-Origin', '*');
-  res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
+  res.header('Access-Control-Allow-Methods', "");
   res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
   if (req.method === 'OPTIONS') {

[NoCoverage] StringLiteral
apps/api/src/main.ts:17:14
 // CORS configuration for Angular app
 app.use((req, res, next) => {
   res.header('Access-Control-Allow-Origin', '*');
-  res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
+  res.header("", 'GET, POST, PUT, DELETE, OPTIONS');
   res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
   if (req.method === 'OPTIONS') {

[NoCoverage] StringLiteral
apps/api/src/main.ts:18:46
 app.use((req, res, next) => {
   res.header('Access-Control-Allow-Origin', '*');
   res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
-  res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
+  res.header('Access-Control-Allow-Headers', "");
   if (req.method === 'OPTIONS') {
     res.sendStatus(200);

[NoCoverage] EqualityOperator
apps/api/src/main.ts:19:7
   res.header('Access-Control-Allow-Origin', '*');
   res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
   res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
-  if (req.method === 'OPTIONS') {
+  if (req.method !== 'OPTIONS') {
     res.sendStatus(200);
   } else {

[NoCoverage] BlockStatement
apps/api/src/main.ts:19:33
   res.header('Access-Control-Allow-Origin', '*');
   res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
   res.header('Access-Control-Allow-Headers', 'Origin, X-Requested-With, Content-Type, Accept');
-  if (req.method === 'OPTIONS') {
-    res.sendStatus(200);
-  } else {
+  if (req.method === 'OPTIONS') {} else {
     next();
   }

[NoCoverage] BlockStatement
apps/api/src/main.ts:26:28
   }
 });
 
-app.get('/', (req, res) => {
-  res.send({ message: 'Hello API' });
-});
+app.get('/', (req, res) => {});
 
 // Products endpoints

[NoCoverage] StringLiteral
apps/api/src/main.ts:27:23
 });
 
 app.get('/', (req, res) => {
-  res.send({ message: 'Hello API' });
+  res.send({ message: "" });
 });
 

[NoCoverage] ObjectLiteral
apps/api/src/main.ts:27:12
 });
 
 app.get('/', (req, res) => {
-  res.send({ message: 'Hello API' });
+  res.send({});
 });
 

[NoCoverage] BlockStatement
apps/api/src/main.ts:35:29
   try {
     const filter: ProductFilter = {};
 
-    if (req.query.category) {
-      filter.category = req.query.category as string;
-    }
+    if (req.query.category) {}
     if (req.query.minPrice) {
       filter.minPrice = Number(req.query.minPrice);

[NoCoverage] ConditionalExpression
apps/api/src/main.ts:35:9
   try {
     const filter: ProductFilter = {};
 
-    if (req.query.category) {
+    if (true) {
       filter.category = req.query.category as string;
     }

[NoCoverage] ConditionalExpression
apps/api/src/main.ts:41:9
     if (req.query.minPrice) {
       filter.minPrice = Number(req.query.minPrice);
     }
-    if (req.query.maxPrice) {
+    if (false) {
       filter.maxPrice = Number(req.query.maxPrice);
     }

[NoCoverage] ConditionalExpression
apps/api/src/main.ts:44:9
     if (req.query.maxPrice) {
       filter.maxPrice = Number(req.query.maxPrice);
     }
-    if (req.query.inStock !== undefined) {
+    if (false) {
       filter.inStock = req.query.inStock === 'true';
     }

[NoCoverage] BlockStatement
apps/api/src/main.ts:44:42
     if (req.query.maxPrice) {
       filter.maxPrice = Number(req.query.maxPrice);
     }
-    if (req.query.inStock !== undefined) {
-      filter.inStock = req.query.inStock === 'true';
-    }
+    if (req.query.inStock !== undefined) {}
     if (req.query.searchTerm) {
       filter.searchTerm = req.query.searchTerm as string;

[NoCoverage] EqualityOperator
apps/api/src/main.ts:45:24
       filter.maxPrice = Number(req.query.maxPrice);
     }
     if (req.query.inStock !== undefined) {
-      filter.inStock = req.query.inStock === 'true';
+      filter.inStock = req.query.inStock !== 'true';
     }
     if (req.query.searchTerm) {

[NoCoverage] ConditionalExpression
apps/api/src/main.ts:45:24
       filter.maxPrice = Number(req.query.maxPrice);
     }
     if (req.query.inStock !== undefined) {
-      filter.inStock = req.query.inStock === 'true';
+      filter.inStock = true;
     }
     if (req.query.searchTerm) {

[NoCoverage] BlockStatement
apps/api/src/main.ts:47:31
     if (req.query.inStock !== undefined) {
       filter.inStock = req.query.inStock === 'true';
     }
-    if (req.query.searchTerm) {
-      filter.searchTerm = req.query.searchTerm as string;
-    }
+    if (req.query.searchTerm) {}
 
     const page = req.query.page ? Number(req.query.page) : 1;

[NoCoverage] BooleanLiteral
apps/api/src/main.ts:58:16
 
     const response: ApiResponse<PaginatedResponse<Product>> = {
       data: result,
-      success: true,
+      success: false,
     };
 

[NoCoverage] BlockStatement
apps/api/src/main.ts:62:19
     };
 
     res.json(response);
-  } catch (error) {
-    const response: ApiResponse<null> = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : 'Unknown error',
-    };
-    res.status(500).json(response);
-  }
+  } catch (error) {}
 });
 

[NoCoverage] StringLiteral
apps/api/src/main.ts:72:9
   }
 });
 
-app.get('/api/products/:id', (req, res) => {
+app.get("", (req, res) => {
   try {
     const product = productsService.getProductById(req.params.id);

[NoCoverage] BlockStatement
apps/api/src/main.ts:73:7
 });
 
 app.get('/api/products/:id', (req, res) => {
-  try {
-    const product = productsService.getProductById(req.params.id);
-
-    if (!product) {
-      const response: ApiResponse<null> = {
-        data: null,
-        success: false,
-        error: 'Product not found',
-      };
-      return res.status(404).json(response);
-    }
-
-    const response: ApiResponse<Product> = {
-      data: product,
-      success: true,
-    };
-
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response: ApiResponse<null> = {
       data: null,

[NoCoverage] StringLiteral
apps/api/src/main.ts:80:16
       const response: ApiResponse<null> = {
         data: null,
         success: false,
-        error: 'Product not found',
+        error: "",
       };
       return res.status(404).json(response);

[NoCoverage] ObjectLiteral
apps/api/src/main.ts:85:44
       return res.status(404).json(response);
     }
 
-    const response: ApiResponse<Product> = {
-      data: product,
-      success: true,
-    };
+    const response: ApiResponse<Product> = {};
 
     res.json(response);

[NoCoverage] BooleanLiteral
apps/api/src/main.ts:87:16
 
     const response: ApiResponse<Product> = {
       data: product,
-      success: true,
+      success: false,
     };
 

[NoCoverage] BlockStatement
apps/api/src/main.ts:101:60
   }
 });
 
-app.get('/api/products-metadata/categories', (req, res) => {
-  try {
-    const categories = productsService.getCategories();
-    const response: ApiResponse<string[]> = {
-      data: categories,
-      success: true,
-    };
-    res.json(response);
-  } catch (error) {
-    const response: ApiResponse<null> = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : 'Unknown error',
-    };
-    res.status(500).json(response);
-  }
-});
+app.get('/api/products-metadata/categories', (req, res) => {});
 
 app.get('/api/products-metadata/price-range', (req, res) => {

[NoCoverage] StringLiteral
apps/api/src/main.ts:101:9
   }
 });
 
-app.get('/api/products-metadata/categories', (req, res) => {
+app.get("", (req, res) => {
   try {
     const categories = productsService.getCategories();

[NoCoverage] BlockStatement
apps/api/src/main.ts:102:7
 });
 
 app.get('/api/products-metadata/categories', (req, res) => {
-  try {
-    const categories = productsService.getCategories();
-    const response: ApiResponse<string[]> = {
-      data: categories,
-      success: true,
-    };
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response: ApiResponse<null> = {
       data: null,

[NoCoverage] BooleanLiteral
apps/api/src/main.ts:106:16
     const categories = productsService.getCategories();
     const response: ApiResponse<string[]> = {
       data: categories,
-      success: true,
+      success: false,
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.ts:119:61
   }
 });
 
-app.get('/api/products-metadata/price-range', (req, res) => {
-  try {
-    const priceRange = productsService.getPriceRange();
-    const response: ApiResponse<{ min: number; max: number }> = {
-      data: priceRange,
-      success: true,
-    };
-    res.json(response);
-  } catch (error) {
-    const response: ApiResponse<null> = {
-      data: null,
-      success: false,
-      error: error instanceof Error ? error.message : 'Unknown error',
-    };
-    res.status(500).json(response);
-  }
-});
+app.get('/api/products-metadata/price-range', (req, res) => {});
 
 app.listen(port, host, () => {

[NoCoverage] BlockStatement
apps/api/src/main.ts:120:7
 });
 
 app.get('/api/products-metadata/price-range', (req, res) => {
-  try {
-    const priceRange = productsService.getPriceRange();
-    const response: ApiResponse<{ min: number; max: number }> = {
-      data: priceRange,
-      success: true,
-    };
-    res.json(response);
-  } catch (error) {
+  try {} catch (error) {
     const response: ApiResponse<null> = {
       data: null,

[NoCoverage] BooleanLiteral
apps/api/src/main.ts:124:16
     const priceRange = productsService.getPriceRange();
     const response: ApiResponse<{ min: number; max: number }> = {
       data: priceRange,
-      success: true,
+      success: false,
     };
     res.json(response);

[NoCoverage] BlockStatement
apps/api/src/main.ts:137:30
   }
 });
 
-app.listen(port, host, () => {
-  console.log(`[ ready ] http://${host}:${port}`);
-});
+app.listen(port, host, () => {});
 
