[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:63:11
   withComputed((store) => {
     const currentTier = (): LoyaltyTier => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 'PLATINUM';
+      if (pts < 7000) return 'PLATINUM';
       if (pts >= 3000) return 'GOLD';
       if (pts >= 1000) return 'SILVER';
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 'PLATINUM' to be 'BRONZE' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:86:11
 
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 0;
+      if (false) return 0;
       if (pts >= 3000) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers
statusReason: expected -500 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:87:11
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 0;
-      if (pts >= 3000) return 7000 - pts;
+      if (true) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
       return 1000 - pts;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 7000 to be 1000 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:158:11
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
       const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
-      if (!voucher) {
+      if (true) {
         return { success: false, message: 'Voucher not found' };
       }
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/loyalty.store.ts:158:11
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
       const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
-      if (!voucher) {
+      if (voucher) {
         return { success: false, message: 'Voucher not found' };
       }
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected false to be true // Object.is equality
