[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:50:35
           return false;
         }
 
-        if (p.price < minPrice || p.price > maxPrice) {
+        if (p.price < minPrice || p.price <= maxPrice) {
           return false;
         }
killedBy: SearchFilterStore should initialize with all products
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:116:28
 
       return {
         categoryCounts,
-        priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
+        priceRange: { min: min !== Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
         stockCount: { inStock, outOfStock },
         ratingCounts,
killedBy: SearchFilterStore should compute product facets
statusReason: expected +0 to be 49.99 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:116:61
 
       return {
         categoryCounts,
-        priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
+        priceRange: { min: min === Infinity ? 0 : min, max: max !== -Infinity ? 0 : max },
         stockCount: { inStock, outOfStock },
         ratingCounts,
killedBy: SearchFilterStore should compute product facets
statusReason: expected +0 to be 499.99 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:126:11
       const f = store.filterState();
       let count = 0;
       if (f.searchTerm.trim().length > 0) count++;
-      if (f.categories.length > 0) count++;
+      if (true) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
       if (f.minRating > 0) count++;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality
