[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:31:11
 
     const comparisonMatrix = () => {
       const list = store.compareList();
-      if (list.length === 0) {
+      if (list.length !== 0) {
         return {
           cheapestProduct: null,
killedBy: WishlistCompareStore should calculate comparison matrix statistics
statusReason: expected undefined to be 'p3' // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:41:9
       }
 
       const cheapestProduct = list.reduce((prev, curr) =>
-        curr.price < prev.price ? curr : prev
+        curr.price >= prev.price ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
killedBy: WishlistCompareStore should calculate comparison matrix statistics
statusReason: expected 'p1' to be 'p3' // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:44:9
         curr.price < prev.price ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
-        curr.rating > prev.rating ? curr : prev
+        curr.rating <= prev.rating ? curr : prev
       );
       const inStockCount = list.filter((p) => p.inStock).length;
killedBy: WishlistCompareStore should calculate comparison matrix statistics
statusReason: expected 'p3' to be 'p1' // Object.is equality
