[NoCoverage] BlockStatement
apps/api/dist/main.js:9:33
 Module._resolveFilename = function(request, parent) {
   let found;
-  for (const entry of manifest) {
-    if (request === entry.module && entry.exactMatch) {
-      const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
-      const candidate = path.join(distPath, entry2.exactMatch);
-      if (isFile(candidate)) {
-        found = candidate;
-        break;
-      }
-    } else {
-      const re = new RegExp(entry.module.replace(/\*$/, "(?<rest>.*)"));
-      const match = request.match(re);
-      if (match?.groups) {
-        const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
-        if (isFile(candidate)) {
-          found = candidate;
-        }
-      }
-    }
-  }
+  for (const entry of manifest) {}
   if (found) {
     const modifiedArguments = [found, ...[].slice.call(arguments, 1)];

[NoCoverage] LogicalOperator
apps/api/dist/main.js:10:9
 Module._resolveFilename = function(request, parent) {
   let found;
   for (const entry of manifest) {
-    if (request === entry.module && entry.exactMatch) {
+    if (request === entry.module || entry.exactMatch) {
       const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
       const candidate = path.join(distPath, entry2.exactMatch);

[NoCoverage] EqualityOperator
apps/api/dist/main.js:10:9
 Module._resolveFilename = function(request, parent) {
   let found;
   for (const entry of manifest) {
-    if (request === entry.module && entry.exactMatch) {
+    if (request !== entry.module && entry.exactMatch) {
       const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
       const candidate = path.join(distPath, entry2.exactMatch);

[NoCoverage] ArrowFunction
apps/api/dist/main.js:11:36
   let found;
   for (const entry of manifest) {
     if (request === entry.module && entry.exactMatch) {
-      const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
+      const entry2 = manifest.find(() => undefined);
       const candidate = path.join(distPath, entry2.exactMatch);
       if (isFile(candidate)) {

[NoCoverage] LogicalOperator
apps/api/dist/main.js:11:43
   let found;
   for (const entry of manifest) {
     if (request === entry.module && entry.exactMatch) {
-      const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
+      const entry2 = manifest.find((x) => request === x.module && request.startsWith(x.module + "/"));
       const candidate = path.join(distPath, entry2.exactMatch);
       if (isFile(candidate)) {

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:13:11
     if (request === entry.module && entry.exactMatch) {
       const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
       const candidate = path.join(distPath, entry2.exactMatch);
-      if (isFile(candidate)) {
+      if (true) {
         found = candidate;
         break;

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:13:11
     if (request === entry.module && entry.exactMatch) {
       const entry2 = manifest.find((x) => request === x.module || request.startsWith(x.module + "/"));
       const candidate = path.join(distPath, entry2.exactMatch);
-      if (isFile(candidate)) {
+      if (false) {
         found = candidate;
         break;

[NoCoverage] BlockStatement
apps/api/dist/main.js:17:12
         found = candidate;
         break;
       }
-    } else {
-      const re = new RegExp(entry.module.replace(/\*$/, "(?<rest>.*)"));
-      const match = request.match(re);
-      if (match?.groups) {
-        const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
-        if (isFile(candidate)) {
-          found = candidate;
-        }
-      }
-    }
+    } else {}
   }
   if (found) {

[NoCoverage] OptionalChaining
apps/api/dist/main.js:20:11
     } else {
       const re = new RegExp(entry.module.replace(/\*$/, "(?<rest>.*)"));
       const match = request.match(re);
-      if (match?.groups) {
+      if (match.groups) {
         const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
         if (isFile(candidate)) {

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:20:11
     } else {
       const re = new RegExp(entry.module.replace(/\*$/, "(?<rest>.*)"));
       const match = request.match(re);
-      if (match?.groups) {
+      if (false) {
         const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
         if (isFile(candidate)) {

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:22:13
       const match = request.match(re);
       if (match?.groups) {
         const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
-        if (isFile(candidate)) {
+        if (false) {
           found = candidate;
         }

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:22:13
       const match = request.match(re);
       if (match?.groups) {
         const candidate = path.join(distPath, entry.pattern.replace("*", ""), match.groups.rest);
-        if (isFile(candidate)) {
+        if (true) {
           found = candidate;
         }

[NoCoverage] ConditionalExpression
apps/api/dist/main.js:28:7
       }
     }
   }
-  if (found) {
+  if (false) {
     const modifiedArguments = [found, ...[].slice.call(arguments, 1)];
     return originalResolveFilename.apply(this, modifiedArguments);

[NoCoverage] BlockStatement
apps/api/dist/main.js:28:14
       }
     }
   }
-  if (found) {
-    const modifiedArguments = [found, ...[].slice.call(arguments, 1)];
-    return originalResolveFilename.apply(this, modifiedArguments);
-  } else {
+  if (found) {} else {
     return originalResolveFilename.apply(this, arguments);
   }

[NoCoverage] BlockStatement
apps/api/dist/main.js:31:10
   if (found) {
     const modifiedArguments = [found, ...[].slice.call(arguments, 1)];
     return originalResolveFilename.apply(this, modifiedArguments);
-  } else {
-    return originalResolveFilename.apply(this, arguments);
-  }
+  } else {}
 };
 function isFile(s) {

[NoCoverage] BlockStatement
apps/api/dist/main.js:35:20
     return originalResolveFilename.apply(this, arguments);
   }
 };
-function isFile(s) {
-  try {
-    require.resolve(s);
-    return true;
-  } catch (_e) {
-    return false;
-  }
-}
+function isFile(s) {}
 module.exports = require("./apps/api/src/main.js");
 

[NoCoverage] BlockStatement
apps/api/dist/main.js:36:7
   }
 };
 function isFile(s) {
-  try {
-    require.resolve(s);
-    return true;
-  } catch (_e) {
+  try {} catch (_e) {
     return false;
   }

[NoCoverage] BooleanLiteral
apps/api/dist/main.js:38:12
 function isFile(s) {
   try {
     require.resolve(s);
-    return true;
+    return false;
   } catch (_e) {
     return false;

[NoCoverage] BlockStatement
apps/api/dist/main.js:39:16
   try {
     require.resolve(s);
     return true;
-  } catch (_e) {
-    return false;
-  }
+  } catch (_e) {}
 }
 module.exports = require("./apps/api/src/main.js");

[NoCoverage] BooleanLiteral
apps/api/dist/main.js:40:12
     require.resolve(s);
     return true;
   } catch (_e) {
-    return false;
+    return true;
   }
 }
