[NoCoverage] BlockStatement
products/src/lib/products.service.js:5:33
 var __getOwnPropDesc = Object.getOwnPropertyDescriptor;
 var __getOwnPropNames = Object.getOwnPropertyNames;
 var __hasOwnProp = Object.prototype.hasOwnProperty;
-var __export = (target, all) => {
-  for (var name in all)
-    __defProp(target, name, { get: all[name], enumerable: true });
-};
+var __export = (target, all) => {};
 var __copyProps = (to, from, except, desc) => {
   if (from && typeof from === "object" || typeof from === "function") {

[NoCoverage] BooleanLiteral
products/src/lib/products.service.js:7:59
 var __hasOwnProp = Object.prototype.hasOwnProperty;
 var __export = (target, all) => {
   for (var name in all)
-    __defProp(target, name, { get: all[name], enumerable: true });
+    __defProp(target, name, { get: all[name], enumerable: false });
 };
 var __copyProps = (to, from, except, desc) => {

[NoCoverage] BlockStatement
products/src/lib/products.service.js:9:47
   for (var name in all)
     __defProp(target, name, { get: all[name], enumerable: true });
 };
-var __copyProps = (to, from, except, desc) => {
-  if (from && typeof from === "object" || typeof from === "function") {
-    for (let key of __getOwnPropNames(from))
-      if (!__hasOwnProp.call(to, key) && key !== except)
-        __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
-  }
-  return to;
-};
+var __copyProps = (to, from, except, desc) => {};
 var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: true }), mod);
 var products_service_exports = {};

[NoCoverage] BlockStatement
products/src/lib/products.service.js:10:71
     __defProp(target, name, { get: all[name], enumerable: true });
 };
 var __copyProps = (to, from, except, desc) => {
-  if (from && typeof from === "object" || typeof from === "function") {
-    for (let key of __getOwnPropNames(from))
-      if (!__hasOwnProp.call(to, key) && key !== except)
-        __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
-  }
+  if (from && typeof from === "object" || typeof from === "function") {}
   return to;
 };

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:12:42
 var __copyProps = (to, from, except, desc) => {
   if (from && typeof from === "object" || typeof from === "function") {
     for (let key of __getOwnPropNames(from))
-      if (!__hasOwnProp.call(to, key) && key !== except)
+      if (!__hasOwnProp.call(to, key) && key === except)
         __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
   }

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:13:35
   if (from && typeof from === "object" || typeof from === "function") {
     for (let key of __getOwnPropNames(from))
       if (!__hasOwnProp.call(to, key) && key !== except)
-        __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
+        __defProp(to, key, { get: () => undefined, enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
   }
   return to;

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:13:64
   if (from && typeof from === "object" || typeof from === "function") {
     for (let key of __getOwnPropNames(from))
       if (!__hasOwnProp.call(to, key) && key !== except)
-        __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
+        __defProp(to, key, { get: () => from[key], enumerable: false });
   }
   return to;

[NoCoverage] BooleanLiteral
products/src/lib/products.service.js:17:78
   }
   return to;
 };
-var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: true }), mod);
+var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: false }), mod);
 var products_service_exports = {};
 __export(products_service_exports, {

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:17:20
   }
   return to;
 };
-var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: true }), mod);
+var __toCommonJS = () => undefined;
 var products_service_exports = {};
 __export(products_service_exports, {

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:20:20
 var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: true }), mod);
 var products_service_exports = {};
 __export(products_service_exports, {
-  ProductsService: () => ProductsService
+  ProductsService: () => undefined
 });
 module.exports = __toCommonJS(products_service_exports);

[NoCoverage] BlockStatement
products/src/lib/products.service.js:24:17
 });
 module.exports = __toCommonJS(products_service_exports);
 class ProductsService {
-  constructor() {
-    this.products = this.generateMockProducts();
-  }
+  constructor() {}
   generateMockProducts() {
     const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];

[NoCoverage] BlockStatement
products/src/lib/products.service.js:27:26
   constructor() {
     this.products = this.generateMockProducts();
   }
-  generateMockProducts() {
-    const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
-    const products = [];
-    for (let i = 1; i <= 50; i++) {
-      const category = categories[Math.floor(Math.random() * categories.length)];
-      products.push({
-        id: `prod-${i}`,
-        name: `Product ${i}`,
-        description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
-        category,
-        imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500)
-      });
-    }
-    return products;
-  }
+  generateMockProducts() {}
   getAllProducts(filter, page = 1, pageSize = 12) {
     let filteredProducts = [...this.products];

[NoCoverage] StringLiteral
products/src/lib/products.service.js:28:25
     this.products = this.generateMockProducts();
   }
   generateMockProducts() {
-    const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
+    const categories = ["", "Clothing", "Books", "Home & Garden", "Sports"];
     const products = [];
     for (let i = 1; i <= 50; i++) {

[NoCoverage] StringLiteral
products/src/lib/products.service.js:28:78
     this.products = this.generateMockProducts();
   }
   generateMockProducts() {
-    const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
+    const categories = ["Electronics", "Clothing", "Books", "Home & Garden", ""];
     const products = [];
     for (let i = 1; i <= 50; i++) {

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:30:21
   generateMockProducts() {
     const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
     const products = [];
-    for (let i = 1; i <= 50; i++) {
+    for (let i = 1; i > 50; i++) {
       const category = categories[Math.floor(Math.random() * categories.length)];
       products.push({

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:30:21
   generateMockProducts() {
     const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
     const products = [];
-    for (let i = 1; i <= 50; i++) {
+    for (let i = 1; false; i++) {
       const category = categories[Math.floor(Math.random() * categories.length)];
       products.push({

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:31:46
     const categories = ["Electronics", "Clothing", "Books", "Home & Garden", "Sports"];
     const products = [];
     for (let i = 1; i <= 50; i++) {
-      const category = categories[Math.floor(Math.random() * categories.length)];
+      const category = categories[Math.floor(Math.random() / categories.length)];
       products.push({
         id: `prod-${i}`,

[NoCoverage] ObjectLiteral
products/src/lib/products.service.js:32:21
     const products = [];
     for (let i = 1; i <= 50; i++) {
       const category = categories[Math.floor(Math.random() * categories.length)];
-      products.push({
-        id: `prod-${i}`,
-        name: `Product ${i}`,
-        description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
-        category,
-        imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500)
-      });
+      products.push({});
     }
     return products;

[NoCoverage] StringLiteral
products/src/lib/products.service.js:34:15
       const category = categories[Math.floor(Math.random() * categories.length)];
       products.push({
         id: `prod-${i}`,
-        name: `Product ${i}`,
+        name: ``,
         description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
         price: Math.round(Math.random() * 500 * 100) / 100 + 10,

[NoCoverage] MethodExpression
products/src/lib/products.service.js:35:48
       products.push({
         id: `prod-${i}`,
         name: `Product ${i}`,
-        description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
+        description: `This is a high-quality ${category.toUpperCase()} product with excellent features and great value for money.`,
         price: Math.round(Math.random() * 500 * 100) / 100 + 10,
         category,

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:36:16
         id: `prod-${i}`,
         name: `Product ${i}`,
         description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
+        price: Math.round(Math.random() * 500 * 100) * 100 + 10,
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:36:27
         id: `prod-${i}`,
         name: `Product ${i}`,
         description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
+        price: Math.round(Math.random() * 500 / 100) / 100 + 10,
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,

[NoCoverage] StringLiteral
products/src/lib/products.service.js:38:19
         description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
         price: Math.round(Math.random() * 500 * 100) / 100 + 10,
         category,
-        imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
+        imageUrl: ``,
         inStock: Math.random() > 0.2,
         rating: Math.round((Math.random() * 2 + 3) * 10) / 10,

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:39:18
         price: Math.round(Math.random() * 500 * 100) / 100 + 10,
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
+        inStock: true,
         rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
         reviewCount: Math.floor(Math.random() * 500)

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:39:18
         price: Math.round(Math.random() * 500 * 100) / 100 + 10,
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
+        inStock: Math.random() >= 0.2,
         rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
         reviewCount: Math.floor(Math.random() * 500)

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:40:29
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
         inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
+        rating: Math.round((Math.random() / 2 + 3) * 10) / 10,
         reviewCount: Math.floor(Math.random() * 500)
       });

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:40:28
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
         inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
+        rating: Math.round((Math.random() * 2 + 3) / 10) / 10,
         reviewCount: Math.floor(Math.random() * 500)
       });

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:41:33
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
         inStock: Math.random() > 0.2,
         rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500)
+        reviewCount: Math.floor(Math.random() / 500)
       });
     }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:48:9
   }
   getAllProducts(filter, page = 1, pageSize = 12) {
     let filteredProducts = [...this.products];
-    if (filter) {
+    if (true) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:48:9
   }
   getAllProducts(filter, page = 1, pageSize = 12) {
     let filteredProducts = [...this.products];
-    if (filter) {
+    if (false) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:49:11
   getAllProducts(filter, page = 1, pageSize = 12) {
     let filteredProducts = [...this.products];
     if (filter) {
-      if (filter.category) {
+      if (true) {
         filteredProducts = filteredProducts.filter(
           (p) => p.category === filter.category

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:49:11
   getAllProducts(filter, page = 1, pageSize = 12) {
     let filteredProducts = [...this.products];
     if (filter) {
-      if (filter.category) {
+      if (false) {
         filteredProducts = filteredProducts.filter(
           (p) => p.category === filter.category

[NoCoverage] MethodExpression
products/src/lib/products.service.js:50:28
     let filteredProducts = [...this.products];
     if (filter) {
       if (filter.category) {
-        filteredProducts = filteredProducts.filter(
-          (p) => p.category === filter.category
-        );
+        filteredProducts = filteredProducts;
       }
       if (filter.minPrice !== void 0) {

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:51:18
     if (filter) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(
-          (p) => p.category === filter.category
+          (p) => true
         );
       }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:51:18
     if (filter) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(
-          (p) => p.category === filter.category
+          (p) => false
         );
       }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:54:11
           (p) => p.category === filter.category
         );
       }
-      if (filter.minPrice !== void 0) {
+      if (true) {
         const minPrice = filter.minPrice;
         filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:54:11
           (p) => p.category === filter.category
         );
       }
-      if (filter.minPrice !== void 0) {
+      if (filter.minPrice === void 0) {
         const minPrice = filter.minPrice;
         filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:56:59
       }
       if (filter.minPrice !== void 0) {
         const minPrice = filter.minPrice;
-        filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);
+        filteredProducts = filteredProducts.filter((p) => false);
       }
       if (filter.maxPrice !== void 0) {

[NoCoverage] MethodExpression
products/src/lib/products.service.js:56:28
       }
       if (filter.minPrice !== void 0) {
         const minPrice = filter.minPrice;
-        filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);
+        filteredProducts = filteredProducts;
       }
       if (filter.maxPrice !== void 0) {

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:58:11
         const minPrice = filter.minPrice;
         filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);
       }
-      if (filter.maxPrice !== void 0) {
+      if (false) {
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:58:11
         const minPrice = filter.minPrice;
         filteredProducts = filteredProducts.filter((p) => p.price >= minPrice);
       }
-      if (filter.maxPrice !== void 0) {
+      if (filter.maxPrice === void 0) {
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);

[NoCoverage] MethodExpression
products/src/lib/products.service.js:60:28
       }
       if (filter.maxPrice !== void 0) {
         const maxPrice = filter.maxPrice;
-        filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);
+        filteredProducts = filteredProducts;
       }
       if (filter.inStock !== void 0) {

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:60:59
       }
       if (filter.maxPrice !== void 0) {
         const maxPrice = filter.maxPrice;
-        filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);
+        filteredProducts = filteredProducts.filter((p) => true);
       }
       if (filter.inStock !== void 0) {

[NoCoverage] BlockStatement
products/src/lib/products.service.js:62:38
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);
       }
-      if (filter.inStock !== void 0) {
-        filteredProducts = filteredProducts.filter(
-          (p) => p.inStock === filter.inStock
-        );
-      }
+      if (filter.inStock !== void 0) {}
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();

[NoCoverage] EqualityOperator
products/src/lib/products.service.js:62:11
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);
       }
-      if (filter.inStock !== void 0) {
+      if (filter.inStock === void 0) {
         filteredProducts = filteredProducts.filter(
           (p) => p.inStock === filter.inStock

[NoCoverage] MethodExpression
products/src/lib/products.service.js:63:28
         filteredProducts = filteredProducts.filter((p) => p.price <= maxPrice);
       }
       if (filter.inStock !== void 0) {
-        filteredProducts = filteredProducts.filter(
-          (p) => p.inStock === filter.inStock
-        );
+        filteredProducts = filteredProducts;
       }
       if (filter.searchTerm) {

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:64:11
       }
       if (filter.inStock !== void 0) {
         filteredProducts = filteredProducts.filter(
-          (p) => p.inStock === filter.inStock
+          () => undefined
         );
       }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:64:18
       }
       if (filter.inStock !== void 0) {
         filteredProducts = filteredProducts.filter(
-          (p) => p.inStock === filter.inStock
+          (p) => true
         );
       }

[NoCoverage] BlockStatement
products/src/lib/products.service.js:67:30
           (p) => p.inStock === filter.inStock
         );
       }
-      if (filter.searchTerm) {
-        const searchLower = filter.searchTerm.toLowerCase();
-        filteredProducts = filteredProducts.filter(
-          (p) => p.name.toLowerCase().includes(searchLower) || p.description.toLowerCase().includes(searchLower) || p.category.toLowerCase().includes(searchLower)
-        );
-      }
+      if (filter.searchTerm) {}
     }
     const total = filteredProducts.length;

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:67:11
           (p) => p.inStock === filter.inStock
         );
       }
-      if (filter.searchTerm) {
+      if (false) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(

[NoCoverage] MethodExpression
products/src/lib/products.service.js:68:29
         );
       }
       if (filter.searchTerm) {
-        const searchLower = filter.searchTerm.toLowerCase();
+        const searchLower = filter.searchTerm.toUpperCase();
         filteredProducts = filteredProducts.filter(
           (p) => p.name.toLowerCase().includes(searchLower) || p.description.toLowerCase().includes(searchLower) || p.category.toLowerCase().includes(searchLower)

[NoCoverage] MethodExpression
products/src/lib/products.service.js:69:28
       }
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();
-        filteredProducts = filteredProducts.filter(
-          (p) => p.name.toLowerCase().includes(searchLower) || p.description.toLowerCase().includes(searchLower) || p.category.toLowerCase().includes(searchLower)
-        );
+        filteredProducts = filteredProducts;
       }
     }

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:70:11
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
-          (p) => p.name.toLowerCase().includes(searchLower) || p.description.toLowerCase().includes(searchLower) || p.category.toLowerCase().includes(searchLower)
+          () => undefined
         );
       }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:70:18
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
-          (p) => p.name.toLowerCase().includes(searchLower) || p.description.toLowerCase().includes(searchLower) || p.category.toLowerCase().includes(searchLower)
+          (p) => false
         );
       }

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:75:34
       }
     }
     const total = filteredProducts.length;
-    const totalPages = Math.ceil(total / pageSize);
+    const totalPages = Math.ceil(total * pageSize);
     const startIndex = (page - 1) * pageSize;
     const endIndex = startIndex + pageSize;

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:76:25
     }
     const total = filteredProducts.length;
     const totalPages = Math.ceil(total / pageSize);
-    const startIndex = (page - 1) * pageSize;
+    const startIndex = (page + 1) * pageSize;
     const endIndex = startIndex + pageSize;
     const items = filteredProducts.slice(startIndex, endIndex);

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:76:24
     }
     const total = filteredProducts.length;
     const totalPages = Math.ceil(total / pageSize);
-    const startIndex = (page - 1) * pageSize;
+    const startIndex = (page - 1) / pageSize;
     const endIndex = startIndex + pageSize;
     const items = filteredProducts.slice(startIndex, endIndex);

[NoCoverage] ArithmeticOperator
products/src/lib/products.service.js:77:22
     const total = filteredProducts.length;
     const totalPages = Math.ceil(total / pageSize);
     const startIndex = (page - 1) * pageSize;
-    const endIndex = startIndex + pageSize;
+    const endIndex = startIndex - pageSize;
     const items = filteredProducts.slice(startIndex, endIndex);
     return {

[NoCoverage] MethodExpression
products/src/lib/products.service.js:78:19
     const totalPages = Math.ceil(total / pageSize);
     const startIndex = (page - 1) * pageSize;
     const endIndex = startIndex + pageSize;
-    const items = filteredProducts.slice(startIndex, endIndex);
+    const items = filteredProducts;
     return {
       items,

[NoCoverage] BlockStatement
products/src/lib/products.service.js:87:22
       totalPages
     };
   }
-  getProductById(id) {
-    return this.products.find((p) => p.id === id) || null;
-  }
+  getProductById(id) {}
   getCategories() {
     return [...new Set(this.products.map((p) => p.category))];

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:88:31
     };
   }
   getProductById(id) {
-    return this.products.find((p) => p.id === id) || null;
+    return this.products.find(() => undefined) || null;
   }
   getCategories() {

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:88:12
     };
   }
   getProductById(id) {
-    return this.products.find((p) => p.id === id) || null;
+    return false;
   }
   getCategories() {

[NoCoverage] BlockStatement
products/src/lib/products.service.js:90:19
   getProductById(id) {
     return this.products.find((p) => p.id === id) || null;
   }
-  getCategories() {
-    return [...new Set(this.products.map((p) => p.category))];
-  }
+  getCategories() {}
   getPriceRange() {
     const prices = this.products.map((p) => p.price);

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:91:42
     return this.products.find((p) => p.id === id) || null;
   }
   getCategories() {
-    return [...new Set(this.products.map((p) => p.category))];
+    return [...new Set(this.products.map(() => undefined))];
   }
   getPriceRange() {

[NoCoverage] ArrayDeclaration
products/src/lib/products.service.js:91:12
     return this.products.find((p) => p.id === id) || null;
   }
   getCategories() {
-    return [...new Set(this.products.map((p) => p.category))];
+    return [];
   }
   getPriceRange() {

[NoCoverage] BlockStatement
products/src/lib/products.service.js:93:19
   getCategories() {
     return [...new Set(this.products.map((p) => p.category))];
   }
-  getPriceRange() {
-    const prices = this.products.map((p) => p.price);
-    return {
-      min: Math.min(...prices),
-      max: Math.max(...prices)
-    };
-  }
+  getPriceRange() {}
 }
 // Annotate the CommonJS export names for ESM import in node:

[NoCoverage] ArrowFunction
products/src/lib/products.service.js:94:38
     return [...new Set(this.products.map((p) => p.category))];
   }
   getPriceRange() {
-    const prices = this.products.map((p) => p.price);
+    const prices = this.products.map(() => undefined);
     return {
       min: Math.min(...prices),

[NoCoverage] MethodExpression
products/src/lib/products.service.js:96:12
   getPriceRange() {
     const prices = this.products.map((p) => p.price);
     return {
-      min: Math.min(...prices),
+      min: Math.max(...prices),
       max: Math.max(...prices)
     };

[NoCoverage] MethodExpression
products/src/lib/products.service.js:97:12
     const prices = this.products.map((p) => p.price);
     return {
       min: Math.min(...prices),
-      max: Math.max(...prices)
+      max: Math.min(...prices)
     };
   }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:102:1
   }
 }
 // Annotate the CommonJS export names for ESM import in node:
-0 && (module.exports = {
-  ProductsService
-});
+false;
 

[NoCoverage] ConditionalExpression
products/src/lib/products.service.js:102:1
   }
 }
 // Annotate the CommonJS export names for ESM import in node:
-0 && (module.exports = {
-  ProductsService
-});
+true;
 
