[NoCoverage] ConditionalExpression
shared/models/src/index.js:8:42
 var __copyProps = (to, from, except, desc) => {
   if (from && typeof from === "object" || typeof from === "function") {
     for (let key of __getOwnPropNames(from))
-      if (!__hasOwnProp.call(to, key) && key !== except)
+      if (!__hasOwnProp.call(to, key) && true)
         __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
   }

[NoCoverage] ConditionalExpression
shared/models/src/index.js:9:64
   if (from && typeof from === "object" || typeof from === "function") {
     for (let key of __getOwnPropNames(from))
       if (!__hasOwnProp.call(to, key) && key !== except)
-        __defProp(to, key, { get: () => from[key], enumerable: !(desc = __getOwnPropDesc(from, key)) || desc.enumerable });
+        __defProp(to, key, { get: () => from[key], enumerable: true });
   }
   return to;

[NoCoverage] ConditionalExpression
shared/models/src/index.js:13:87
   }
   return to;
 };
-var __reExport = (target, mod, secondTarget) => (__copyProps(target, mod, "default"), secondTarget && __copyProps(secondTarget, mod, "default"));
+var __reExport = (target, mod, secondTarget) => (__copyProps(target, mod, "default"), true);
 var __toCommonJS = (mod) => __copyProps(__defProp({}, "__esModule", { value: true }), mod);
 var src_exports = {};

[NoCoverage] LogicalOperator
shared/models/src/index.js:19:1
 module.exports = __toCommonJS(src_exports);
 __reExport(src_exports, require("./lib/product.model"), module.exports);
 // Annotate the CommonJS export names for ESM import in node:
-0 && (module.exports = {
-  ...require("./lib/product.model")
-});
+0 || (module.exports = {
+  ...require("./lib/product.model")
+});
 

[NoCoverage] ConditionalExpression
shared/models/src/index.js:19:1
 module.exports = __toCommonJS(src_exports);
 __reExport(src_exports, require("./lib/product.model"), module.exports);
 // Annotate the CommonJS export names for ESM import in node:
-0 && (module.exports = {
-  ...require("./lib/product.model")
-});
+false;
 
