[NoCoverage] ArrowFunction
apps/api/vite.config.ts:5:29
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../node_modules/.vite/apps/api',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  test: {
-    name: 'api',
-    watch: false,
-    globals: true,
-    environment: 'node',
-    include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    reporters: ['default'],
-    passWithNoTests: true,
-    coverage: {
-      reportsDirectory: '../../coverage/apps/api',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] StringLiteral
apps/api/vite.config.ts:7:13
 
 export default defineConfig(() => ({
   root: __dirname,
-  cacheDir: '../../node_modules/.vite/apps/api',
+  cacheDir: "",
   plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
   test: {

[NoCoverage] StringLiteral
apps/api/vite.config.ts:8:50
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../node_modules/.vite/apps/api',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [tsconfigPaths(), nxCopyAssetsPlugin([""])],
   test: {
     name: 'api',

[NoCoverage] BooleanLiteral
apps/api/vite.config.ts:11:12
   plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
   test: {
     name: 'api',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'node',

[NoCoverage] BooleanLiteral
apps/api/vite.config.ts:12:14
   test: {
     name: 'api',
     watch: false,
-    globals: true,
+    globals: false,
     environment: 'node',
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],

[NoCoverage] StringLiteral
apps/api/vite.config.ts:13:18
     name: 'api',
     watch: false,
     globals: true,
-    environment: 'node',
+    environment: "",
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     reporters: ['default'],

[NoCoverage] BooleanLiteral
apps/api/vite.config.ts:16:22
     environment: 'node',
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     reporters: ['default'],
-    passWithNoTests: true,
+    passWithNoTests: false,
     coverage: {
       reportsDirectory: '../../coverage/apps/api',

[NoCoverage] ObjectLiteral
apps/api/vite.config.ts:17:15
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     reporters: ['default'],
     passWithNoTests: true,
-    coverage: {
-      reportsDirectory: '../../coverage/apps/api',
-      provider: 'v8' as const,
-    },
+    coverage: {},
   },
 }));

[NoCoverage] StringLiteral
apps/api/vite.config.ts:18:25
     reporters: ['default'],
     passWithNoTests: true,
     coverage: {
-      reportsDirectory: '../../coverage/apps/api',
+      reportsDirectory: "",
       provider: 'v8' as const,
     },
