[NoCoverage] StringLiteral
apps/shop/eslint.config.mjs:6:17
 
 export default [
   ...baseConfig,
-  ...nx.configs['flat/angular'],
+  ...nx.configs[""],
   ...nx.configs['flat/angular-template'],
   {

[NoCoverage] ArrayDeclaration
apps/shop/eslint.config.mjs:9:12
   ...nx.configs['flat/angular'],
   ...nx.configs['flat/angular-template'],
   {
-    files: ['**/*.ts'],
+    files: [],
     rules: {
       '@angular-eslint/directive-selector': [

[NoCoverage] ObjectLiteral
apps/shop/eslint.config.mjs:10:12
   ...nx.configs['flat/angular-template'],
   {
     files: ['**/*.ts'],
-    rules: {
-      '@angular-eslint/directive-selector': [
-        'error',
-        {
-          type: 'attribute',
-          prefix: 'app',
-          style: 'camelCase',
-        },
-      ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'app',
-          style: 'kebab-case',
-        },
-      ],
-    },
+    rules: {},
   },
   {

[NoCoverage] ArrayDeclaration
apps/shop/eslint.config.mjs:11:45
   {
     files: ['**/*.ts'],
     rules: {
-      '@angular-eslint/directive-selector': [
-        'error',
-        {
-          type: 'attribute',
-          prefix: 'app',
-          style: 'camelCase',
-        },
-      ],
+      '@angular-eslint/directive-selector': [],
       '@angular-eslint/component-selector': [
         'error',

[NoCoverage] StringLiteral
apps/shop/eslint.config.mjs:12:9
     files: ['**/*.ts'],
     rules: {
       '@angular-eslint/directive-selector': [
-        'error',
+        "",
         {
           type: 'attribute',

[NoCoverage] StringLiteral
apps/shop/eslint.config.mjs:15:19
         'error',
         {
           type: 'attribute',
-          prefix: 'app',
+          prefix: "",
           style: 'camelCase',
         },

[NoCoverage] ArrayDeclaration
apps/shop/eslint.config.mjs:19:45
           style: 'camelCase',
         },
       ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'app',
-          style: 'kebab-case',
-        },
-      ],
+      '@angular-eslint/component-selector': [],
     },
   },

[NoCoverage] ObjectLiteral
apps/shop/eslint.config.mjs:21:9
       ],
       '@angular-eslint/component-selector': [
         'error',
-        {
-          type: 'element',
-          prefix: 'app',
-          style: 'kebab-case',
-        },
+        {},
       ],
     },

[NoCoverage] StringLiteral
apps/shop/eslint.config.mjs:24:18
         {
           type: 'element',
           prefix: 'app',
-          style: 'kebab-case',
+          style: "",
         },
       ],

[NoCoverage] StringLiteral
apps/shop/eslint.config.mjs:30:13
     },
   },
   {
-    files: ['**/*.html'],
+    files: [""],
     // Override or add rules here
     rules: {},

[NoCoverage] ArrayDeclaration
apps/shop/eslint.config.mjs:30:12
     },
   },
   {
-    files: ['**/*.html'],
+    files: [],
     // Override or add rules here
     rules: {},
