[NoCoverage] ObjectLiteral
shop/src/app/app.config.server.ts:6:41
 import { appConfig } from './app.config';
 import { serverRoutes } from './app.routes.server';
 
-const serverConfig: ApplicationConfig = {
-  providers: [provideServerRendering(withRoutes(serverRoutes))],
-};
+const serverConfig: ApplicationConfig = {};
 
 export const config = mergeApplicationConfig(appConfig, serverConfig);
