[NoCoverage] ObjectLiteral
shop/src/app/app.config.ts:14:45
   withEventReplay,
 } from '@angular/platform-browser';
 
-export const appConfig: ApplicationConfig = {
-  providers: [
-    provideClientHydration(withEventReplay()),
-    provideBrowserGlobalErrorListeners(),
-    provideZoneChangeDetection({ eventCoalescing: true }),
-    provideRouter(appRoutes),
-    provideHttpClient(withFetch()),
-  ],
-};
+export const appConfig: ApplicationConfig = {};
 

[NoCoverage] BooleanLiteral
shop/src/app/app.config.ts:18:51
   providers: [
     provideClientHydration(withEventReplay()),
     provideBrowserGlobalErrorListeners(),
-    provideZoneChangeDetection({ eventCoalescing: true }),
+    provideZoneChangeDetection({ eventCoalescing: false }),
     provideRouter(appRoutes),
     provideHttpClient(withFetch()),
