[Survived] ObjectLiteral
shop/src/app/app.routes.ts:4:3
 import { Route } from '@angular/router';
 
 export const appRoutes: Route[] = [
-  {
-    path: '',
-    redirectTo: 'products',
-    pathMatch: 'full',
-  },
+  {},
   {
     path: 'products',

[Survived] StringLiteral
shop/src/app/app.routes.ts:7:16
   {
     path: '',
     redirectTo: 'products',
-    pathMatch: 'full',
+    pathMatch: "",
   },
   {

[Survived] ArrowFunction
shop/src/app/app.routes.ts:11:19
   },
   {
     path: 'products',
-    loadChildren: () =>
-      import('@org/shop/feature-products').then(m => m.featureProductsRoutes),
+    loadChildren: () => undefined,
   },
   {

[NoCoverage] ArrowFunction
shop/src/app/app.routes.ts:12:49
   {
     path: 'products',
     loadChildren: () =>
-      import('@org/shop/feature-products').then(m => m.featureProductsRoutes),
+      import('@org/shop/feature-products').then(() => undefined),
   },
   {

[Survived] ObjectLiteral
shop/src/app/app.routes.ts:14:3
     loadChildren: () =>
       import('@org/shop/feature-products').then(m => m.featureProductsRoutes),
   },
-  {
-    path: 'products',
-    loadChildren: () =>
-      import('@org/shop/feature-product-detail').then(
-        m => m.featureProductDetailRoutes
-      ),
-  },
+  {},
   {
     path: '**',

[Survived] ArrowFunction
shop/src/app/app.routes.ts:16:19
   },
   {
     path: 'products',
-    loadChildren: () =>
-      import('@org/shop/feature-product-detail').then(
-        m => m.featureProductDetailRoutes
-      ),
+    loadChildren: () => undefined,
   },
   {

[NoCoverage] ArrowFunction
shop/src/app/app.routes.ts:18:9
     path: 'products',
     loadChildren: () =>
       import('@org/shop/feature-product-detail').then(
-        m => m.featureProductDetailRoutes
+        () => undefined
       ),
   },
