[NoCoverage] ArrowFunction
apps/shop/src/main.server.ts:5:19
 import { App } from './app/app';
 import { config } from './app/app.config.server';
 
-const bootstrap = (context: BootstrapContext) => bootstrapApplication(App, config, context);
+const bootstrap = () => undefined;
 
 export default bootstrap;
