[NoCoverage] ArrowFunction
apps/shop/src/main.ts:5:44
 import { appConfig } from './app/app.config';
 import { App } from './app/app';
 
-bootstrapApplication(App, appConfig).catch((err) => console.error(err));
+bootstrapApplication(App, appConfig).catch(() => undefined);
 
