[NoCoverage] BooleanLiteral
apps/shop/src/server.ts:35:12
 app.use(
   express.static(browserDistFolder, {
     maxAge: '1y',
-    index: false,
+    index: true,
     redirect: false,
   })

[NoCoverage] BooleanLiteral
apps/shop/src/server.ts:36:15
   express.static(browserDistFolder, {
     maxAge: '1y',
     index: false,
-    redirect: false,
+    redirect: true,
   })
 );

[NoCoverage] BlockStatement
apps/shop/src/server.ts:43:36
 /**
  * Handle all other requests by rendering the Angular application.
  */
-app.use('/**', (req, res, next) => {
-  angularApp
-    .handle(req)
-    .then((response) =>
-      response ? writeResponseToNodeResponse(response, res) : next()
-    )
-    .catch(next);
-});
+app.use('/**', (req, res, next) => {});
 
 /**

[NoCoverage] StringLiteral
apps/shop/src/server.ts:43:9
 /**
  * Handle all other requests by rendering the Angular application.
  */
-app.use('/**', (req, res, next) => {
+app.use("", (req, res, next) => {
   angularApp
     .handle(req)

[NoCoverage] ArrowFunction
apps/shop/src/server.ts:46:11
 app.use('/**', (req, res, next) => {
   angularApp
     .handle(req)
-    .then((response) =>
-      response ? writeResponseToNodeResponse(response, res) : next()
+    .then(() => undefined
     )
     .catch(next);

[NoCoverage] ConditionalExpression
apps/shop/src/server.ts:56:5
  * Start the server if this module is the main entry point.
  * The server listens on the port defined by the `PORT` environment variable, or defaults to 4000.
  */
-if (isMainModule(import.meta.url)) {
+if (false) {
   const port = process.env['PORT'] || 4000;
   app.listen(port, () => {

[NoCoverage] BlockStatement
apps/shop/src/server.ts:56:36
  * Start the server if this module is the main entry point.
  * The server listens on the port defined by the `PORT` environment variable, or defaults to 4000.
  */
-if (isMainModule(import.meta.url)) {
-  const port = process.env['PORT'] || 4000;
-  app.listen(port, () => {
-    console.log(`Node Express server listening on http://localhost:${port}`);
-  });
-}
+if (isMainModule(import.meta.url)) {}
 
 /**

[NoCoverage] ConditionalExpression
apps/shop/src/server.ts:57:16
  * The server listens on the port defined by the `PORT` environment variable, or defaults to 4000.
  */
 if (isMainModule(import.meta.url)) {
-  const port = process.env['PORT'] || 4000;
+  const port = false;
   app.listen(port, () => {
     console.log(`Node Express server listening on http://localhost:${port}`);

[NoCoverage] ConditionalExpression
apps/shop/src/server.ts:57:16
  * The server listens on the port defined by the `PORT` environment variable, or defaults to 4000.
  */
 if (isMainModule(import.meta.url)) {
-  const port = process.env['PORT'] || 4000;
+  const port = true;
   app.listen(port, () => {
     console.log(`Node Express server listening on http://localhost:${port}`);

[NoCoverage] BlockStatement
apps/shop/src/server.ts:58:26
  */
 if (isMainModule(import.meta.url)) {
   const port = process.env['PORT'] || 4000;
-  app.listen(port, () => {
-    console.log(`Node Express server listening on http://localhost:${port}`);
-  });
+  app.listen(port, () => {});
 }
 

[NoCoverage] StringLiteral
apps/shop/src/server.ts:59:17
 if (isMainModule(import.meta.url)) {
   const port = process.env['PORT'] || 4000;
   app.listen(port, () => {
-    console.log(`Node Express server listening on http://localhost:${port}`);
+    console.log(``);
   });
 }
