[NoCoverage] ArrowFunction
apps/shop/vite.config.mts:7:29
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../node_modules/.vite/apps/shop',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  // Uncomment this if you are using workers.
-  // worker: {
-  //  plugins: [ nxViteTsPaths() ],
-  // },
-  test: {
-    name: 'shop',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../coverage/apps/shop',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] ObjectLiteral
apps/shop/vite.config.mts:7:36
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../node_modules/.vite/apps/shop',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  // Uncomment this if you are using workers.
-  // worker: {
-  //  plugins: [ nxViteTsPaths() ],
-  // },
-  test: {
-    name: 'shop',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../coverage/apps/shop',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => ({}));
 

[NoCoverage] ArrayDeclaration
apps/shop/vite.config.mts:10:60
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../node_modules/.vite/apps/shop',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin([])],
   // Uncomment this if you are using workers.
   // worker: {

[NoCoverage] BooleanLiteral
apps/shop/vite.config.mts:17:12
   // },
   test: {
     name: 'shop',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'jsdom',

[NoCoverage] ArrayDeclaration
apps/shop/vite.config.mts:20:14
     watch: false,
     globals: true,
     environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
+    include: [],
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],

[NoCoverage] StringLiteral
apps/shop/vite.config.mts:22:17
     environment: 'jsdom',
     include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
+    reporters: [""],
     coverage: {
       reportsDirectory: '../../coverage/apps/shop',

[NoCoverage] StringLiteral
apps/shop/vite.config.mts:24:25
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],
     coverage: {
-      reportsDirectory: '../../coverage/apps/shop',
+      reportsDirectory: "",
       provider: 'v8' as const,
     },
