[NoCoverage] ArrayDeclaration
apps/shop-e2e/eslint.config.mjs:4:16
 import playwright from 'eslint-plugin-playwright';
 import baseConfig from '../../eslint.config.mjs';
 
-export default [
-  playwright.configs['flat/recommended'],
-  ...baseConfig,
-  {
-    files: ['**/*.ts', '**/*.js'],
-    // Override or add rules here
-    rules: {},
-  },
-];
+export default [];
 

[NoCoverage] StringLiteral
apps/shop-e2e/eslint.config.mjs:8:24
   playwright.configs['flat/recommended'],
   ...baseConfig,
   {
-    files: ['**/*.ts', '**/*.js'],
+    files: ['**/*.ts', ""],
     // Override or add rules here
     rules: {},
