[NoCoverage] ConditionalExpression
apps/shop-e2e/playwright.config.ts:6:17
 import { workspaceRoot } from '@nx/devkit';
 
 // For CI, you may want to set BASE_URL to the deployed application.
-const baseURL = process.env['BASE_URL'] || 'http://localhost:4200';
+const baseURL = false;
 
 /**

[NoCoverage] ConditionalExpression
apps/shop-e2e/playwright.config.ts:6:17
 import { workspaceRoot } from '@nx/devkit';
 
 // For CI, you may want to set BASE_URL to the deployed application.
-const baseURL = process.env['BASE_URL'] || 'http://localhost:4200';
+const baseURL = true;
 
 /**

[NoCoverage] StringLiteral
apps/shop-e2e/playwright.config.ts:18:41
  * See https://playwright.dev/docs/test-configuration.
  */
 export default defineConfig({
-  ...nxE2EPreset(__filename, { testDir: './src' }),
+  ...nxE2EPreset(__filename, { testDir: "" }),
   /* Shared settings for all the projects below. See https://playwright.dev/docs/api/class-testoptions. */
   use: {

[NoCoverage] StringLiteral
apps/shop-e2e/playwright.config.ts:28:10
   /* Run your local dev server before starting the tests */
   webServer: {
     command: 'npx nx run shop:serve',
-    url: 'http://localhost:4200',
+    url: "",
     reuseExistingServer: true,
     cwd: workspaceRoot,

[NoCoverage] BooleanLiteral
apps/shop-e2e/playwright.config.ts:29:26
   webServer: {
     command: 'npx nx run shop:serve',
     url: 'http://localhost:4200',
-    reuseExistingServer: true,
+    reuseExistingServer: false,
     cwd: workspaceRoot,
   },
