[NoCoverage] ObjectLiteral
packages/api/products/eslint.config.mjs:5:3
 
 export default [
   ...baseConfig,
-  {
-    files: ['**/*.json'],
-    rules: {
-      '@nx/dependency-checks': [
-        'error',
-        {
-          ignoredFiles: ['{projectRoot}/eslint.config.{js,cjs,mjs,ts,cts,mts}'],
-        },
-      ],
-    },
-    languageOptions: {
-      parser: await import('jsonc-eslint-parser'),
-    },
-  },
+  {},
 ];
 

[NoCoverage] StringLiteral
packages/api/products/eslint.config.mjs:6:13
 export default [
   ...baseConfig,
   {
-    files: ['**/*.json'],
+    files: [""],
     rules: {
       '@nx/dependency-checks': [

[NoCoverage] ObjectLiteral
packages/api/products/eslint.config.mjs:7:12
   ...baseConfig,
   {
     files: ['**/*.json'],
-    rules: {
-      '@nx/dependency-checks': [
-        'error',
-        {
-          ignoredFiles: ['{projectRoot}/eslint.config.{js,cjs,mjs,ts,cts,mts}'],
-        },
-      ],
-    },
+    rules: {},
     languageOptions: {
       parser: await import('jsonc-eslint-parser'),

[NoCoverage] ArrayDeclaration
packages/api/products/eslint.config.mjs:8:32
   {
     files: ['**/*.json'],
     rules: {
-      '@nx/dependency-checks': [
-        'error',
-        {
-          ignoredFiles: ['{projectRoot}/eslint.config.{js,cjs,mjs,ts,cts,mts}'],
-        },
-      ],
+      '@nx/dependency-checks': [],
     },
     languageOptions: {

[NoCoverage] ObjectLiteral
packages/api/products/eslint.config.mjs:10:9
     rules: {
       '@nx/dependency-checks': [
         'error',
-        {
-          ignoredFiles: ['{projectRoot}/eslint.config.{js,cjs,mjs,ts,cts,mts}'],
-        },
+        {},
       ],
     },

[NoCoverage] StringLiteral
packages/api/products/eslint.config.mjs:11:26
       '@nx/dependency-checks': [
         'error',
         {
-          ignoredFiles: ['{projectRoot}/eslint.config.{js,cjs,mjs,ts,cts,mts}'],
+          ignoredFiles: [""],
         },
       ],

[NoCoverage] ObjectLiteral
packages/api/products/eslint.config.mjs:15:22
         },
       ],
     },
-    languageOptions: {
-      parser: await import('jsonc-eslint-parser'),
-    },
+    languageOptions: {},
   },
 ];
