[Killed] BlockStatement
products/src/lib/products.service.ts:6:45
 export class ProductsService {
   private products: Product[] = this.generateMockProducts();
 
-  private generateMockProducts(): Product[] {
-    const categories = ['Electronics', 'Clothing', 'Books', 'Home & Garden', 'Sports'];
-    const products: Product[] = [];
-
-    for (let i = 1; i <= 50; i++) {
-      const category = categories[Math.floor(Math.random() * categories.length)];
-      products.push({
-        id: `prod-${i}`,
-        name: `Product ${i}`,
-        description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
-        category,
-        imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500),
-      });
-    }
-
-    return products;
-  }
+  private generateMockProducts(): Product[] {}
 
   getAllProducts(
killedBy: ProductsService getAllProducts should return paginated products with default pagination
statusReason: this.products is not iterable

[Survived] StringLiteral
products/src/lib/products.service.ts:7:61
   private products: Product[] = this.generateMockProducts();
 
   private generateMockProducts(): Product[] {
-    const categories = ['Electronics', 'Clothing', 'Books', 'Home & Garden', 'Sports'];
+    const categories = ['Electronics', 'Clothing', 'Books', "", 'Sports'];
     const products: Product[] = [];
 

[Killed] BlockStatement
products/src/lib/products.service.ts:10:35
     const categories = ['Electronics', 'Clothing', 'Books', 'Home & Garden', 'Sports'];
     const products: Product[] = [];
 
-    for (let i = 1; i <= 50; i++) {
-      const category = categories[Math.floor(Math.random() * categories.length)];
-      products.push({
-        id: `prod-${i}`,
-        name: `Product ${i}`,
-        description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
-        category,
-        imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
-        inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500),
-      });
-    }
+    for (let i = 1; i <= 50; i++) {}
 
     return products;
killedBy: ProductsService getAllProducts should paginate results correctly
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] EqualityOperator
products/src/lib/products.service.ts:10:21
     const categories = ['Electronics', 'Clothing', 'Books', 'Home & Garden', 'Sports'];
     const products: Product[] = [];
 
-    for (let i = 1; i <= 50; i++) {
+    for (let i = 1; i > 50; i++) {
       const category = categories[Math.floor(Math.random() * categories.length)];
       products.push({
killedBy: ProductsService getAllProducts should paginate results correctly
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] ArithmeticOperator
products/src/lib/products.service.ts:16:16
         id: `prod-${i}`,
         name: `Product ${i}`,
         description: `This is a high-quality ${category.toLowerCase()} product with excellent features and great value for money.`,
-        price: Math.round(Math.random() * 500 * 100) / 100 + 10,
+        price: Math.round(Math.random() * 500 * 100) / 100 - 10,
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
killedBy: ProductsService getPriceRange should return min and max prices
statusReason: expected -5.78 to be greater than or equal to 0

[Survived] ArithmeticOperator
products/src/lib/products.service.ts:20:17
         category,
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
         inStock: Math.random() > 0.2,
-        rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
+        rating: Math.round((Math.random() * 2 + 3) * 10) * 10,
         reviewCount: Math.floor(Math.random() * 500),
       });

[Survived] ArithmeticOperator
products/src/lib/products.service.ts:21:33
         imageUrl: `https://placehold.co/300x300?text=Product+${i}`,
         inStock: Math.random() > 0.2,
         rating: Math.round((Math.random() * 2 + 3) * 10) / 10,
-        reviewCount: Math.floor(Math.random() * 500),
+        reviewCount: Math.floor(Math.random() / 500),
       });
     }

[Killed] ConditionalExpression
products/src/lib/products.service.ts:35:9
   ): PaginatedResponse<Product> {
     let filteredProducts = [...this.products];
 
-    if (filter) {
+    if (true) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(
killedBy: ProductsService getAllProducts should return paginated products with default pagination
statusReason: Cannot read properties of undefined (reading 'category')

[Killed] BlockStatement
products/src/lib/products.service.ts:36:28
     let filteredProducts = [...this.products];
 
     if (filter) {
-      if (filter.category) {
-        filteredProducts = filteredProducts.filter(
-          p => p.category === filter.category
-        );
-      }
+      if (filter.category) {}
 
       if (filter.minPrice !== undefined) {
killedBy: ProductsService getAllProducts should filter products by category
statusReason: expected 'Home & Garden' to be 'Electronics' // Object.is equality

[Killed] MethodExpression
products/src/lib/products.service.ts:37:28
 
     if (filter) {
       if (filter.category) {
-        filteredProducts = filteredProducts.filter(
-          p => p.category === filter.category
-        );
+        filteredProducts = filteredProducts;
       }
 
killedBy: ProductsService getAllProducts should filter products by category
statusReason: expected 'Clothing' to be 'Electronics' // Object.is equality

[Killed] ConditionalExpression
products/src/lib/products.service.ts:38:16
     if (filter) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(
-          p => p.category === filter.category
+          p => true
         );
       }
killedBy: ProductsService getAllProducts should filter products by category
statusReason: expected 'Books' to be 'Electronics' // Object.is equality

[Killed] EqualityOperator
products/src/lib/products.service.ts:38:16
     if (filter) {
       if (filter.category) {
         filteredProducts = filteredProducts.filter(
-          p => p.category === filter.category
+          p => p.category !== filter.category
         );
       }
killedBy: ProductsService getAllProducts should filter products by category
statusReason: expected 'Books' to be 'Electronics' // Object.is equality

[Killed] BlockStatement
products/src/lib/products.service.ts:42:42
         );
       }
 
-      if (filter.minPrice !== undefined) {
-        const minPrice = filter.minPrice;
-        filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
-      }
+      if (filter.minPrice !== undefined) {}
 
       if (filter.maxPrice !== undefined) {
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 30.54 to be greater than or equal to 50

[Killed] EqualityOperator
products/src/lib/products.service.ts:42:11
         );
       }
 
-      if (filter.minPrice !== undefined) {
+      if (filter.minPrice === undefined) {
         const minPrice = filter.minPrice;
         filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 26.34 to be greater than or equal to 50

[Killed] EqualityOperator
products/src/lib/products.service.ts:44:57
 
       if (filter.minPrice !== undefined) {
         const minPrice = filter.minPrice;
-        filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
+        filteredProducts = filteredProducts.filter(p => p.price < minPrice);
       }
 
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 15.57 to be greater than or equal to 50

[Killed] MethodExpression
products/src/lib/products.service.ts:44:28
 
       if (filter.minPrice !== undefined) {
         const minPrice = filter.minPrice;
-        filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
+        filteredProducts = filteredProducts;
       }
 
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 42.53 to be greater than or equal to 50

[Killed] EqualityOperator
products/src/lib/products.service.ts:47:11
         filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
       }
 
-      if (filter.maxPrice !== undefined) {
+      if (filter.maxPrice === undefined) {
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 254.14 to be less than or equal to 150

[Killed] ConditionalExpression
products/src/lib/products.service.ts:47:11
         filteredProducts = filteredProducts.filter(p => p.price >= minPrice);
       }
 
-      if (filter.maxPrice !== undefined) {
+      if (false) {
         const maxPrice = filter.maxPrice;
         filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 269.1 to be less than or equal to 150

[Killed] ConditionalExpression
products/src/lib/products.service.ts:49:57
 
       if (filter.maxPrice !== undefined) {
         const maxPrice = filter.maxPrice;
-        filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
+        filteredProducts = filteredProducts.filter(p => true);
       }
 
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 298.75 to be less than or equal to 150

[Killed] EqualityOperator
products/src/lib/products.service.ts:49:57
 
       if (filter.maxPrice !== undefined) {
         const maxPrice = filter.maxPrice;
-        filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
+        filteredProducts = filteredProducts.filter(p => p.price > maxPrice);
       }
 
killedBy: ProductsService getAllProducts should filter products by price range
statusReason: expected 457.81 to be less than or equal to 150

[Survived] EqualityOperator
products/src/lib/products.service.ts:52:11
         filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
       }
 
-      if (filter.inStock !== undefined) {
+      if (filter.inStock === undefined) {
         filteredProducts = filteredProducts.filter(
           p => p.inStock === filter.inStock

[Survived] ConditionalExpression
products/src/lib/products.service.ts:52:11
         filteredProducts = filteredProducts.filter(p => p.price <= maxPrice);
       }
 
-      if (filter.inStock !== undefined) {
+      if (false) {
         filteredProducts = filteredProducts.filter(
           p => p.inStock === filter.inStock

[NoCoverage] MethodExpression
products/src/lib/products.service.ts:53:28
       }
 
       if (filter.inStock !== undefined) {
-        filteredProducts = filteredProducts.filter(
-          p => p.inStock === filter.inStock
-        );
+        filteredProducts = filteredProducts;
       }
 

[NoCoverage] ConditionalExpression
products/src/lib/products.service.ts:54:16
 
       if (filter.inStock !== undefined) {
         filteredProducts = filteredProducts.filter(
-          p => p.inStock === filter.inStock
+          p => true
         );
       }

[NoCoverage] ConditionalExpression
products/src/lib/products.service.ts:54:16
 
       if (filter.inStock !== undefined) {
         filteredProducts = filteredProducts.filter(
-          p => p.inStock === filter.inStock
+          p => false
         );
       }

[Killed] ConditionalExpression
products/src/lib/products.service.ts:58:11
         );
       }
 
-      if (filter.searchTerm) {
+      if (false) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
killedBy: ProductsService getAllProducts should handle search term filtering
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
products/src/lib/products.service.ts:58:11
         );
       }
 
-      if (filter.searchTerm) {
+      if (true) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
killedBy: ProductsService getAllProducts should filter products by category
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] MethodExpression
products/src/lib/products.service.ts:60:28
 
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();
-        filteredProducts = filteredProducts.filter(
-          p =>
-            p.name.toLowerCase().includes(searchLower) ||
-            p.description.toLowerCase().includes(searchLower) ||
-            p.category.toLowerCase().includes(searchLower)
-        );
+        filteredProducts = filteredProducts;
       }
     }
killedBy: ProductsService getAllProducts should handle search term filtering
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
products/src/lib/products.service.ts:61:11
       if (filter.searchTerm) {
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
-          p =>
-            p.name.toLowerCase().includes(searchLower) ||
-            p.description.toLowerCase().includes(searchLower) ||
-            p.category.toLowerCase().includes(searchLower)
+          () => undefined
         );
       }

[Killed] ConditionalExpression
products/src/lib/products.service.ts:62:13
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
           p =>
-            p.name.toLowerCase().includes(searchLower) ||
-            p.description.toLowerCase().includes(searchLower) ||
-            p.category.toLowerCase().includes(searchLower)
+            true
         );
       }
killedBy: ProductsService getAllProducts should handle search term filtering
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
products/src/lib/products.service.ts:62:13
         const searchLower = filter.searchTerm.toLowerCase();
         filteredProducts = filteredProducts.filter(
           p =>
-            p.name.toLowerCase().includes(searchLower) ||
-            p.description.toLowerCase().includes(searchLower) ||
+            p.name.toLowerCase().includes(searchLower) && p.description.toLowerCase().includes(searchLower) ||
             p.category.toLowerCase().includes(searchLower)
         );

[Survived] MethodExpression
products/src/lib/products.service.ts:63:13
         filteredProducts = filteredProducts.filter(
           p =>
             p.name.toLowerCase().includes(searchLower) ||
-            p.description.toLowerCase().includes(searchLower) ||
+            p.description.toUpperCase().includes(searchLower) ||
             p.category.toLowerCase().includes(searchLower)
         );

[Survived] MethodExpression
products/src/lib/products.service.ts:64:13
           p =>
             p.name.toLowerCase().includes(searchLower) ||
             p.description.toLowerCase().includes(searchLower) ||
-            p.category.toLowerCase().includes(searchLower)
+            p.category.toUpperCase().includes(searchLower)
         );
       }

[Killed] BlockStatement
products/src/lib/products.service.ts:84:46
     };
   }
 
-  getProductById(id: string): Product | null {
-    return this.products.find(p => p.id === id) || null;
-  }
+  getProductById(id: string): Product | null {}
 
   getCategories(): string[] {
killedBy: ProductsService getProductById should return a product by id
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
products/src/lib/products.service.ts:85:12
   }
 
   getProductById(id: string): Product | null {
-    return this.products.find(p => p.id === id) || null;
+    return false;
   }
 
killedBy: ProductsService getProductById should return a product by id
statusReason: expected false to be truthy

[Killed] ConditionalExpression
products/src/lib/products.service.ts:85:36
   }
 
   getProductById(id: string): Product | null {
-    return this.products.find(p => p.id === id) || null;
+    return this.products.find(p => true) || null;
   }
 
killedBy: ProductsService getProductById should return null for non-existent id
statusReason: expected { id: 'prod-1', …(8) } to be null

[Killed] BlockStatement
products/src/lib/products.service.ts:88:29
     return this.products.find(p => p.id === id) || null;
   }
 
-  getCategories(): string[] {
-    return [...new Set(this.products.map(p => p.category))];
-  }
+  getCategories(): string[] {}
 
   getPriceRange(): { min: number; max: number } {
killedBy: ProductsService getCategories should return unique categories
statusReason: expected undefined to be truthy

[Survived] ArrowFunction
products/src/lib/products.service.ts:89:42
   }
 
   getCategories(): string[] {
-    return [...new Set(this.products.map(p => p.category))];
+    return [...new Set(this.products.map(() => undefined))];
   }
 

[Killed] BlockStatement
products/src/lib/products.service.ts:92:49
     return [...new Set(this.products.map(p => p.category))];
   }
 
-  getPriceRange(): { min: number; max: number } {
-    const prices = this.products.map(p => p.price);
-    return {
-      min: Math.min(...prices),
-      max: Math.max(...prices),
-    };
-  }
+  getPriceRange(): { min: number; max: number } {}
 }
killedBy: ProductsService getPriceRange should return min and max prices
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
products/src/lib/products.service.ts:93:38
   }
 
   getPriceRange(): { min: number; max: number } {
-    const prices = this.products.map(p => p.price);
+    const prices = this.products.map(() => undefined);
     return {
       min: Math.min(...prices),
killedBy: ProductsService getPriceRange should return min and max prices
statusReason: expected NaN to be less than or equal to NaN

[Survived] MethodExpression
products/src/lib/products.service.ts:96:12
     const prices = this.products.map(p => p.price);
     return {
       min: Math.min(...prices),
-      max: Math.max(...prices),
+      max: Math.min(...prices),
     };
   }
