[NoCoverage] ArrowFunction
packages/api/products/vite.config.ts:5:29
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/api/products',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  test: {
-    name: 'products',
-    watch: false,
-    globals: true,
-    environment: 'node',
-    include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    reporters: ['default'],
-    passWithNoTests: true,
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/api/products',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] StringLiteral
packages/api/products/vite.config.ts:7:13
 
 export default defineConfig(() => ({
   root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/api/products',
+  cacheDir: "",
   plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
   test: {

[NoCoverage] ArrayDeclaration
packages/api/products/vite.config.ts:8:49
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/api/products',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [tsconfigPaths(), nxCopyAssetsPlugin([])],
   test: {
     name: 'products',

[NoCoverage] StringLiteral
packages/api/products/vite.config.ts:8:50
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/api/products',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [tsconfigPaths(), nxCopyAssetsPlugin([""])],
   test: {
     name: 'products',

[NoCoverage] StringLiteral
packages/api/products/vite.config.ts:10:11
   cacheDir: '../../../node_modules/.vite/packages/api/products',
   plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
   test: {
-    name: 'products',
+    name: "",
     watch: false,
     globals: true,

[NoCoverage] BooleanLiteral
packages/api/products/vite.config.ts:11:12
   plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
   test: {
     name: 'products',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'node',

[NoCoverage] ArrayDeclaration
packages/api/products/vite.config.ts:14:14
     watch: false,
     globals: true,
     environment: 'node',
-    include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
+    include: [],
     reporters: ['default'],
     passWithNoTests: true,
