[NoCoverage] ArrowFunction
packages/shared/models/vite.config.ts:5:29
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shared/models',
-  plugins: [tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  // Uncomment this if you are using workers.
-  // worker: {
-  //  plugins: [ nxViteTsPaths() ],
-  // },
-  test: {
-    name: 'models',
-    watch: false,
-    globals: true,
-    environment: 'node',
-    include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    reporters: ['default'],
-    passWithNoTests: true,
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shared/models',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] BooleanLiteral
packages/shared/models/vite.config.ts:15:12
   // },
   test: {
     name: 'models',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'node',

[NoCoverage] StringLiteral
packages/shared/models/vite.config.ts:18:15
     watch: false,
     globals: true,
     environment: 'node',
-    include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
+    include: [""],
     reporters: ['default'],
     passWithNoTests: true,

[NoCoverage] StringLiteral
packages/shared/models/vite.config.ts:19:17
     globals: true,
     environment: 'node',
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    reporters: ['default'],
+    reporters: [""],
     passWithNoTests: true,
     coverage: {

[NoCoverage] ArrayDeclaration
packages/shared/models/vite.config.ts:19:16
     globals: true,
     environment: 'node',
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    reporters: ['default'],
+    reporters: [],
     passWithNoTests: true,
     coverage: {

[NoCoverage] ObjectLiteral
packages/shared/models/vite.config.ts:21:15
     include: ['src/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     reporters: ['default'],
     passWithNoTests: true,
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shared/models',
-      provider: 'v8' as const,
-    },
+    coverage: {},
   },
 }));

[NoCoverage] StringLiteral
packages/shared/models/vite.config.ts:22:25
     reporters: ['default'],
     passWithNoTests: true,
     coverage: {
-      reportsDirectory: '../../../coverage/packages/shared/models',
+      reportsDirectory: "",
       provider: 'v8' as const,
     },
