[Survived] ObjectLiteral
src/lib/store/cart.store.ts:18:47
   targetCurrency: 'USD',
 };
 
-const VALID_COUPONS: Record<string, Coupon> = {
-  SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
-  SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
-  FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },
-};
+const VALID_COUPONS: Record<string, Coupon> = {};
 
 const CURRENCY_RATES: Record<SupportedCurrency, number> = {

[Survived] StringLiteral
src/lib/store/cart.store.ts:19:35
 };
 
 const VALID_COUPONS: Record<string, Coupon> = {
-  SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
+  SAVE10: { code: 'SAVE10', type: "", value: 10 },
   SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
   FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },

[Survived] StringLiteral
src/lib/store/cart.store.ts:19:19
 };
 
 const VALID_COUPONS: Record<string, Coupon> = {
-  SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
+  SAVE10: { code: "", type: 'PERCENTAGE', value: 10 },
   SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
   FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },

[Survived] ObjectLiteral
src/lib/store/cart.store.ts:20:11
 
 const VALID_COUPONS: Record<string, Coupon> = {
   SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
-  SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
+  SAVE20: {},
   FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },
 };

[Survived] StringLiteral
src/lib/store/cart.store.ts:20:19
 
 const VALID_COUPONS: Record<string, Coupon> = {
   SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
-  SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
+  SAVE20: { code: "", type: 'FIXED', value: 20 },
   FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },
 };

[Survived] StringLiteral
src/lib/store/cart.store.ts:21:39
 const VALID_COUPONS: Record<string, Coupon> = {
   SAVE10: { code: 'SAVE10', type: 'PERCENTAGE', value: 10 },
   SAVE20: { code: 'SAVE20', type: 'FIXED', value: 20 },
-  FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },
+  FREESHIP: { code: 'FREESHIP', type: "", value: 0 },
 };
 

[Survived] ObjectLiteral
src/lib/store/cart.store.ts:24:59
   FREESHIP: { code: 'FREESHIP', type: 'FREESHIP', value: 0 },
 };
 
-const CURRENCY_RATES: Record<SupportedCurrency, number> = {
-  USD: 1.0,
-  EUR: 0.92,
-  GBP: 0.79,
-};
+const CURRENCY_RATES: Record<SupportedCurrency, number> = {};
 
 export const CartStore = signalStore(

[Killed] ArrowFunction
src/lib/store/cart.store.ts:34:25
   { providedIn: 'root' },
   withState(initialState),
   withComputed((store) => {
-    const rawSubtotal = () =>
-      store.items().reduce((acc, item) => {
-        const itemPrice =
-          item.product.price + (item.selectedVariant?.additionalPrice || 0);
-        return acc + itemPrice * item.quantity;
-      }, 0);
+    const rawSubtotal = () => undefined;
 
     const discountAmount = () => {
killedBy: CartStore should initialize with default empty state
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:35:43
   withState(initialState),
   withComputed((store) => {
     const rawSubtotal = () =>
-      store.items().reduce((acc, item) => {
-        const itemPrice =
-          item.product.price + (item.selectedVariant?.additionalPrice || 0);
-        return acc + itemPrice * item.quantity;
-      }, 0);
+      store.items().reduce((acc, item) => {}, 0);
 
     const discountAmount = () => {
killedBy: CartStore should treat different variants of the same product as separate items
statusReason: expected undefined to be 250 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:37:33
     const rawSubtotal = () =>
       store.items().reduce((acc, item) => {
         const itemPrice =
-          item.product.price + (item.selectedVariant?.additionalPrice || 0);
+          item.product.price + (false);
         return acc + itemPrice * item.quantity;
       }, 0);
killedBy: CartStore should treat different variants of the same product as separate items
statusReason: expected 240 to be 250 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:37:33
     const rawSubtotal = () =>
       store.items().reduce((acc, item) => {
         const itemPrice =
-          item.product.price + (item.selectedVariant?.additionalPrice || 0);
+          item.product.price + (true);
         return acc + itemPrice * item.quantity;
       }, 0);
killedBy: CartStore should treat different variants of the same product as separate items
statusReason: expected 242 to be 250 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:38:16
       store.items().reduce((acc, item) => {
         const itemPrice =
           item.product.price + (item.selectedVariant?.additionalPrice || 0);
-        return acc + itemPrice * item.quantity;
+        return acc - itemPrice * item.quantity;
       }, 0);
 
killedBy: CartStore should treat different variants of the same product as separate items
statusReason: expected -250 to be 250 // Object.is equality

[Survived] ArithmeticOperator
src/lib/store/cart.store.ts:38:22
       store.items().reduce((acc, item) => {
         const itemPrice =
           item.product.price + (item.selectedVariant?.additionalPrice || 0);
-        return acc + itemPrice * item.quantity;
+        return acc + itemPrice / item.quantity;
       }, 0);
 

[Killed] BlockStatement
src/lib/store/cart.store.ts:41:34
         return acc + itemPrice * item.quantity;
       }, 0);
 
-    const discountAmount = () => {
-      const discount = store.appliedDiscount();
-      if (!discount) return 0;
-      const subtotal = rawSubtotal();
-      if (discount.type === 'PERCENTAGE') {
-        return +((subtotal * discount.value) / 100).toFixed(2);
-      }
-      if (discount.type === 'FIXED') {
-        return Math.min(subtotal, discount.value);
-      }
-      return 0;
-    };
+    const discountAmount = () => {};
 
     const netSubtotal = () => Math.max(0, rawSubtotal() - discountAmount());
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 5.99 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:43:11
 
     const discountAmount = () => {
       const discount = store.appliedDiscount();
-      if (!discount) return 0;
+      if (false) return 0;
       const subtotal = rawSubtotal();
       if (discount.type === 'PERCENTAGE') {
killedBy: CartWidgetComponent should create cart widget component
statusReason: Cannot read properties of null (reading 'type')

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:43:11
 
     const discountAmount = () => {
       const discount = store.appliedDiscount();
-      if (!discount) return 0;
+      if (discount) return 0;
       const subtotal = rawSubtotal();
       if (discount.type === 'PERCENTAGE') {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: Cannot read properties of null (reading 'type')

[Killed] BlockStatement
src/lib/store/cart.store.ts:45:43
       const discount = store.appliedDiscount();
       if (!discount) return 0;
       const subtotal = rawSubtotal();
-      if (discount.type === 'PERCENTAGE') {
-        return +((subtotal * discount.value) / 100).toFixed(2);
-      }
+      if (discount.type === 'PERCENTAGE') {}
       if (discount.type === 'FIXED') {
         return Math.min(subtotal, discount.value);
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected +0 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:45:11
       const discount = store.appliedDiscount();
       if (!discount) return 0;
       const subtotal = rawSubtotal();
-      if (discount.type === 'PERCENTAGE') {
+      if (true) {
         return +((subtotal * discount.value) / 100).toFixed(2);
       }
killedBy: CartStore should apply FIXED coupon correctly (SAVE20 -> $20 off)
statusReason: expected 24 to be 20 // Object.is equality

[Killed] UnaryOperator
src/lib/store/cart.store.ts:46:16
       if (!discount) return 0;
       const subtotal = rawSubtotal();
       if (discount.type === 'PERCENTAGE') {
-        return +((subtotal * discount.value) / 100).toFixed(2);
+        return -(subtotal * discount.value / 100).toFixed(2);
       }
       if (discount.type === 'FIXED') {
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected -12 to be 12 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:46:18
       if (!discount) return 0;
       const subtotal = rawSubtotal();
       if (discount.type === 'PERCENTAGE') {
-        return +((subtotal * discount.value) / 100).toFixed(2);
+        return +(subtotal * discount.value * 100).toFixed(2);
       }
       if (discount.type === 'FIXED') {
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected 120000 to be 12 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:48:38
       if (discount.type === 'PERCENTAGE') {
         return +((subtotal * discount.value) / 100).toFixed(2);
       }
-      if (discount.type === 'FIXED') {
-        return Math.min(subtotal, discount.value);
-      }
+      if (discount.type === 'FIXED') {}
       return 0;
     };
killedBy: CartStore should apply FIXED coupon correctly (SAVE20 -> $20 off)
statusReason: expected +0 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:48:11
       if (discount.type === 'PERCENTAGE') {
         return +((subtotal * discount.value) / 100).toFixed(2);
       }
-      if (discount.type === 'FIXED') {
+      if (false) {
         return Math.min(subtotal, discount.value);
       }
killedBy: CartStore should apply FIXED coupon correctly (SAVE20 -> $20 off)
statusReason: expected +0 to be 20 // Object.is equality

[Killed] MethodExpression
src/lib/store/cart.store.ts:49:16
         return +((subtotal * discount.value) / 100).toFixed(2);
       }
       if (discount.type === 'FIXED') {
-        return Math.min(subtotal, discount.value);
+        return Math.max(subtotal, discount.value);
       }
       return 0;
killedBy: CartStore should apply FIXED coupon correctly (SAVE20 -> $20 off)
statusReason: expected 120 to be 20 // Object.is equality

[Killed] MethodExpression
src/lib/store/cart.store.ts:54:31
       return 0;
     };
 
-    const netSubtotal = () => Math.max(0, rawSubtotal() - discountAmount());
+    const netSubtotal = () => Math.min(0, rawSubtotal() - discountAmount());
 
     const isEligibleForFreeShipping = () => {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 5.99 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:54:43
       return 0;
     };
 
-    const netSubtotal = () => Math.max(0, rawSubtotal() - discountAmount());
+    const netSubtotal = () => Math.max(0, rawSubtotal() + discountAmount());
 
     const isEligibleForFreeShipping = () => {
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected 132 to be 108 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:56:45
 
     const netSubtotal = () => Math.max(0, rawSubtotal() - discountAmount());
 
-    const isEligibleForFreeShipping = () => {
-      const discount = store.appliedDiscount();
-      if (discount?.type === 'FREESHIP') return true;
-      return netSubtotal() >= 100;
-    };
+    const isEligibleForFreeShipping = () => {};
 
     const freeShippingRemaining = () => {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 5.99 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:58:11
 
     const isEligibleForFreeShipping = () => {
       const discount = store.appliedDiscount();
-      if (discount?.type === 'FREESHIP') return true;
+      if (true) return true;
       return netSubtotal() >= 100;
     };
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected +0 to be 5.99 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:58:49
 
     const isEligibleForFreeShipping = () => {
       const discount = store.appliedDiscount();
-      if (discount?.type === 'FREESHIP') return true;
+      if (discount?.type === 'FREESHIP') return false;
       return netSubtotal() >= 100;
     };
killedBy: CartStore should apply FREESHIP coupon and make shipping $0 even below $100 threshold
statusReason: expected 5.99 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:59:14
     const isEligibleForFreeShipping = () => {
       const discount = store.appliedDiscount();
       if (discount?.type === 'FREESHIP') return true;
-      return netSubtotal() >= 100;
+      return true;
     };
 
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected +0 to be 5.99 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:59:14
     const isEligibleForFreeShipping = () => {
       const discount = store.appliedDiscount();
       if (discount?.type === 'FREESHIP') return true;
-      return netSubtotal() >= 100;
+      return false;
     };
 
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 5.99 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:62:41
       return netSubtotal() >= 100;
     };
 
-    const freeShippingRemaining = () => {
-      if (isEligibleForFreeShipping()) return 0;
-      return +(100 - netSubtotal()).toFixed(2);
-    };
+    const freeShippingRemaining = () => {};
 
     const shippingCost = () => {
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:63:11
     };
 
     const freeShippingRemaining = () => {
-      if (isEligibleForFreeShipping()) return 0;
+      if (true) return 0;
       return +(100 - netSubtotal()).toFixed(2);
     };
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected +0 to be 20 // Object.is equality

[Survived] ConditionalExpression
src/lib/store/cart.store.ts:63:11
     };
 
     const freeShippingRemaining = () => {
-      if (isEligibleForFreeShipping()) return 0;
+      if (false) return 0;
       return +(100 - netSubtotal()).toFixed(2);
     };

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:64:16
 
     const freeShippingRemaining = () => {
       if (isEligibleForFreeShipping()) return 0;
-      return +(100 - netSubtotal()).toFixed(2);
+      return +(100 + netSubtotal()).toFixed(2);
     };
 
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected 180 to be 20 // Object.is equality

[Killed] UnaryOperator
src/lib/store/cart.store.ts:64:14
 
     const freeShippingRemaining = () => {
       if (isEligibleForFreeShipping()) return 0;
-      return +(100 - netSubtotal()).toFixed(2);
+      return -(100 - netSubtotal()).toFixed(2);
     };
 
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected -20 to be 20 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:67:32
       return +(100 - netSubtotal()).toFixed(2);
     };
 
-    const shippingCost = () => {
-      if (store.items().length === 0) return 0;
-      return isEligibleForFreeShipping() ? 0 : 5.99;
-    };
+    const shippingCost = () => {};
 
     const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:68:11
     };
 
     const shippingCost = () => {
-      if (store.items().length === 0) return 0;
+      if (true) return 0;
       return isEligibleForFreeShipping() ? 0 : 5.99;
     };
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected +0 to be 5.99 // Object.is equality

[Killed] EqualityOperator
src/lib/store/cart.store.ts:68:11
     };
 
     const shippingCost = () => {
-      if (store.items().length === 0) return 0;
+      if (store.items().length !== 0) return 0;
       return isEligibleForFreeShipping() ? 0 : 5.99;
     };
killedBy: CartStore should calculate shipping fee when subtotal is below free shipping threshold ($100)
statusReason: expected +0 to be 5.99 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:72:23
       return isEligibleForFreeShipping() ? 0 : 5.99;
     };
 
-    const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
+    const taxAmount = () => undefined;
 
     const total = () =>
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected undefined to be 22.8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:72:32
       return isEligibleForFreeShipping() ? 0 : 5.99;
     };
 
-    const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
+    const taxAmount = () => +((netSubtotal() / 0.19)).toFixed(2);
 
     const total = () =>
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 631.58 to be 22.8 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:74:19
 
     const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
 
-    const total = () =>
-      +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
+    const total = () => undefined;
 
     const convertedTotal = () => {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected undefined to be 142.8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:75:9
     const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
 
     const total = () =>
-      +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
+      +(netSubtotal() - taxAmount() + shippingCost()).toFixed(2);
 
     const convertedTotal = () => {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected 97.2 to be 142.8 // Object.is equality

[Killed] UnaryOperator
src/lib/store/cart.store.ts:75:7
     const taxAmount = () => +((netSubtotal() * 0.19)).toFixed(2);
 
     const total = () =>
-      +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
+      -(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
 
     const convertedTotal = () => {
killedBy: CartStore should calculate rawSubtotal, netSubtotal, taxAmount (19%), shipping, and total
statusReason: expected -142.8 to be 142.8 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:77:34
     const total = () =>
       +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
 
-    const convertedTotal = () => {
-      const rate = CURRENCY_RATES[store.targetCurrency()] || 1.0;
-      return +(total() * rate).toFixed(2);
-    };
+    const convertedTotal = () => {};
 
     const itemCount = () =>
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected undefined to be 131.38 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:78:20
       +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
 
     const convertedTotal = () => {
-      const rate = CURRENCY_RATES[store.targetCurrency()] || 1.0;
+      const rate = false;
       return +(total() * rate).toFixed(2);
     };
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected +0 to be 131.38 // Object.is equality

[Killed] LogicalOperator
src/lib/store/cart.store.ts:78:20
       +(netSubtotal() + taxAmount() + shippingCost()).toFixed(2);
 
     const convertedTotal = () => {
-      const rate = CURRENCY_RATES[store.targetCurrency()] || 1.0;
+      const rate = CURRENCY_RATES[store.targetCurrency()] && 1.0;
       return +(total() * rate).toFixed(2);
     };
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected 142.8 to be 131.38 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:79:16
 
     const convertedTotal = () => {
       const rate = CURRENCY_RATES[store.targetCurrency()] || 1.0;
-      return +(total() * rate).toFixed(2);
+      return +(total() / rate).toFixed(2);
     };
 
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected 155.22 to be 131.38 // Object.is equality

[Killed] UnaryOperator
src/lib/store/cart.store.ts:79:14
 
     const convertedTotal = () => {
       const rate = CURRENCY_RATES[store.targetCurrency()] || 1.0;
-      return +(total() * rate).toFixed(2);
+      return -(total() * rate).toFixed(2);
     };
 
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected -131.38 to be 131.38 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:82:23
       return +(total() * rate).toFixed(2);
     };
 
-    const itemCount = () =>
-      store.items().reduce((acc, item) => acc + item.quantity, 0);
+    const itemCount = () => undefined;
 
     const isEmpty = () => store.items().length === 0;
killedBy: CartStore should initialize with default empty state
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:83:28
     };
 
     const itemCount = () =>
-      store.items().reduce((acc, item) => acc + item.quantity, 0);
+      store.items().reduce(() => undefined, 0);
 
     const isEmpty = () => store.items().length === 0;
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:83:43
     };
 
     const itemCount = () =>
-      store.items().reduce((acc, item) => acc + item.quantity, 0);
+      store.items().reduce((acc, item) => acc - item.quantity, 0);
 
     const isEmpty = () => store.items().length === 0;
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected -1 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/store/cart.store.ts:85:27
     const itemCount = () =>
       store.items().reduce((acc, item) => acc + item.quantity, 0);
 
-    const isEmpty = () => store.items().length === 0;
+    const isEmpty = () => store.items().length !== 0;
 
     return {
killedBy: CartStore should initialize with default empty state
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:85:27
     const itemCount = () =>
       store.items().reduce((acc, item) => acc + item.quantity, 0);
 
-    const isEmpty = () => store.items().length === 0;
+    const isEmpty = () => false;
 
     return {
killedBy: CartStore should initialize with default empty state
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:102:79
     };
   }),
   withMethods((store) => ({
-    addItem(product: Product, quantity = 1, selectedVariant?: ProductVariant) {
-      const currentItems = store.items();
-      const existingIndex = currentItems.findIndex(
-        (item) =>
-          item.product.id === product.id &&
-          item.selectedVariant?.id === selectedVariant?.id
-      );
-
-      if (existingIndex > -1) {
-        const updated = [...currentItems];
-        updated[existingIndex] = {
-          ...updated[existingIndex],
-          quantity: updated[existingIndex].quantity + quantity,
-        };
-        patchState(store, { items: updated });
-      } else {
-        const newItem: CartItem = {
-          product,
-          quantity,
-          selectedVariant,
-          addedAt: new Date().toISOString(),
-        };
-        patchState(store, { items: [...currentItems, newItem] });
-      }
-    },
+    addItem(product: Product, quantity = 1, selectedVariant?: ProductVariant) {},
 
     removeItem(productId: string, variantId?: string) {
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:105:9
     addItem(product: Product, quantity = 1, selectedVariant?: ProductVariant) {
       const currentItems = store.items();
       const existingIndex = currentItems.findIndex(
-        (item) =>
-          item.product.id === product.id &&
-          item.selectedVariant?.id === selectedVariant?.id
+        () => undefined
       );
 
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected 2 to be 3 // Object.is equality

[Killed] EqualityOperator
src/lib/store/cart.store.ts:106:11
       const currentItems = store.items();
       const existingIndex = currentItems.findIndex(
         (item) =>
-          item.product.id === product.id &&
+          item.product.id !== product.id &&
           item.selectedVariant?.id === selectedVariant?.id
       );
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/store/cart.store.ts:106:11
       const currentItems = store.items();
       const existingIndex = currentItems.findIndex(
         (item) =>
-          item.product.id === product.id &&
-          item.selectedVariant?.id === selectedVariant?.id
+          item.product.id === product.id || item.selectedVariant?.id === selectedVariant?.id
       );
 
killedBy: CartStore should treat different variants of the same product as separate items
statusReason: expected 1 to be 2 // Object.is equality

[Killed] OptionalChaining
src/lib/store/cart.store.ts:107:11
       const existingIndex = currentItems.findIndex(
         (item) =>
           item.product.id === product.id &&
-          item.selectedVariant?.id === selectedVariant?.id
+          item.selectedVariant.id === selectedVariant?.id
       );
 
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
src/lib/store/cart.store.ts:107:40
       const existingIndex = currentItems.findIndex(
         (item) =>
           item.product.id === product.id &&
-          item.selectedVariant?.id === selectedVariant?.id
+          item.selectedVariant?.id === selectedVariant.id
       );
 
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/lib/store/cart.store.ts:110:31
           item.selectedVariant?.id === selectedVariant?.id
       );
 
-      if (existingIndex > -1) {
-        const updated = [...currentItems];
-        updated[existingIndex] = {
-          ...updated[existingIndex],
-          quantity: updated[existingIndex].quantity + quantity,
-        };
-        patchState(store, { items: updated });
-      } else {
+      if (existingIndex > -1) {} else {
         const newItem: CartItem = {
           product,
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:110:11
           item.selectedVariant?.id === selectedVariant?.id
       );
 
-      if (existingIndex > -1) {
+      if (true) {
         const updated = [...currentItems];
         updated[existingIndex] = {
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] ArithmeticOperator
src/lib/store/cart.store.ts:114:21
         const updated = [...currentItems];
         updated[existingIndex] = {
           ...updated[existingIndex],
-          quantity: updated[existingIndex].quantity + quantity,
+          quantity: updated[existingIndex].quantity - quantity,
         };
         patchState(store, { items: updated });
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected -1 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:117:14
           quantity: updated[existingIndex].quantity + quantity,
         };
         patchState(store, { items: updated });
-      } else {
-        const newItem: CartItem = {
-          product,
-          quantity,
-          selectedVariant,
-          addedAt: new Date().toISOString(),
-        };
-        patchState(store, { items: [...currentItems, newItem] });
-      }
+      } else {}
     },
 
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected +0 to be 1 // Object.is equality
