[Killed] ObjectLiteral
src/lib/store/cart.store.ts:118:35
         };
         patchState(store, { items: updated });
       } else {
-        const newItem: CartItem = {
-          product,
-          quantity,
-          selectedVariant,
-          addedAt: new Date().toISOString(),
-        };
+        const newItem: CartItem = {};
         patchState(store, { items: [...currentItems, newItem] });
       }
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/lib/store/cart.store.ts:124:36
           selectedVariant,
           addedAt: new Date().toISOString(),
         };
-        patchState(store, { items: [...currentItems, newItem] });
+        patchState(store, { items: [] });
       }
     },
killedBy: CartStore should add items to cart and increment quantity if product already exists
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:128:55
       }
     },
 
-    removeItem(productId: string, variantId?: string) {
-      const updated = store
-        .items()
-        .filter(
-          (item) =>
-            !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
-            )
-        );
-      patchState(store, { items: updated });
-    },
+    removeItem(productId: string, variantId?: string) {},
 
     updateQuantity(productId: string, quantity: number, variantId?: string) {
killedBy: CartStore should remove items from cart
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/lib/store/cart.store.ts:129:23
     },
 
     removeItem(productId: string, variantId?: string) {
-      const updated = store
-        .items()
-        .filter(
-          (item) =>
-            !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
-            )
-        );
+      const updated = store.items();
       patchState(store, { items: updated });
     },
killedBy: CartStore should remove items from cart
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/store/cart.store.ts:132:11
       const updated = store
         .items()
         .filter(
-          (item) =>
-            !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
-            )
+          () => undefined
         );
       patchState(store, { items: updated });
killedBy: CartStore should remove items from cart
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:133:13
         .items()
         .filter(
           (item) =>
-            !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
-            )
+            item.product.id === productId && (!variantId || item.selectedVariant?.id === variantId)
         );
       patchState(store, { items: updated });
killedBy: CartStore should remove items from cart
statusReason: expected 'p1' to be 'p2' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:134:15
         .filter(
           (item) =>
             !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
+              false
             )
         );
killedBy: CartStore should remove items from cart
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:134:15
         .filter(
           (item) =>
             !(
-              item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
+              true
             )
         );
killedBy: CartStore should remove items from cart
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/lib/store/cart.store.ts:135:16
           (item) =>
             !(
               item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
+              (true)
             )
         );

[Survived] BooleanLiteral
src/lib/store/cart.store.ts:135:16
           (item) =>
             !(
               item.product.id === productId &&
-              (!variantId || item.selectedVariant?.id === variantId)
+              (variantId || item.selectedVariant?.id === variantId)
             )
         );

[Killed] ObjectLiteral
src/lib/store/cart.store.ts:138:25
               (!variantId || item.selectedVariant?.id === variantId)
             )
         );
-      patchState(store, { items: updated });
+      patchState(store, {});
     },
 
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:141:77
       patchState(store, { items: updated });
     },
 
-    updateQuantity(productId: string, quantity: number, variantId?: string) {
-      if (quantity <= 0) {
-        this.removeItem(productId, variantId);
-        return;
-      }
-      const updated = store.items().map((item) => {
-        if (
-          item.product.id === productId &&
-          (!variantId || item.selectedVariant?.id === variantId)
-        ) {
-          return { ...item, quantity };
-        }
-        return item;
-      });
-      patchState(store, { items: updated });
-    },
+    updateQuantity(productId: string, quantity: number, variantId?: string) {},
 
     applyCoupon(code: string): { success: boolean; message: string } {
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected 3 to be 2 // Object.is equality

[Killed] EqualityOperator
src/lib/store/cart.store.ts:142:11
     },
 
     updateQuantity(productId: string, quantity: number, variantId?: string) {
-      if (quantity <= 0) {
+      if (quantity < 0) {
         this.removeItem(productId, variantId);
         return;
killedBy: CartStore should update quantity and remove item if set to 0 or negative
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:142:11
     },
 
     updateQuantity(productId: string, quantity: number, variantId?: string) {
-      if (quantity <= 0) {
+      if (true) {
         this.removeItem(productId, variantId);
         return;
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] BlockStatement
src/lib/store/cart.store.ts:146:51
         this.removeItem(productId, variantId);
         return;
       }
-      const updated = store.items().map((item) => {
-        if (
-          item.product.id === productId &&
-          (!variantId || item.selectedVariant?.id === variantId)
-        ) {
-          return { ...item, quantity };
-        }
-        return item;
-      });
+      const updated = store.items().map((item) => {});
       patchState(store, { items: updated });
     },
killedBy: CartStore should update quantity and remove item if set to 0 or negative
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] EqualityOperator
src/lib/store/cart.store.ts:148:11
       }
       const updated = store.items().map((item) => {
         if (
-          item.product.id === productId &&
+          item.product.id !== productId &&
           (!variantId || item.selectedVariant?.id === variantId)
         ) {
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:148:11
       }
       const updated = store.items().map((item) => {
         if (
-          item.product.id === productId &&
-          (!variantId || item.selectedVariant?.id === variantId)
+          false
         ) {
           return { ...item, quantity };
killedBy: CartStore should update quantity and remove item if set to 0 or negative
statusReason: expected 3 to be 5 // Object.is equality

[Survived] LogicalOperator
src/lib/store/cart.store.ts:149:12
       const updated = store.items().map((item) => {
         if (
           item.product.id === productId &&
-          (!variantId || item.selectedVariant?.id === variantId)
+          (!variantId && item.selectedVariant?.id === variantId)
         ) {
           return { ...item, quantity };

[Killed] BlockStatement
src/lib/store/cart.store.ts:150:11
         if (
           item.product.id === productId &&
           (!variantId || item.selectedVariant?.id === variantId)
-        ) {
-          return { ...item, quantity };
-        }
+        ) {}
         return item;
       });
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/cart.store.ts:151:18
           item.product.id === productId &&
           (!variantId || item.selectedVariant?.id === variantId)
         ) {
-          return { ...item, quantity };
+          return {};
         }
         return item;
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: Cannot read properties of undefined (reading 'price')

[Killed] ObjectLiteral
src/lib/store/cart.store.ts:155:25
         }
         return item;
       });
-      patchState(store, { items: updated });
+      patchState(store, {});
     },
 
killedBy: CartWidgetComponent should render items and handle quantity increment and removal buttons
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:158:70
       patchState(store, { items: updated });
     },
 
-    applyCoupon(code: string): { success: boolean; message: string } {
-      const coupon = VALID_COUPONS[code.toUpperCase()];
-      if (!coupon) {
-        return { success: false, message: 'Invalid coupon code' };
-      }
-      patchState(store, {
-        couponCode: coupon.code,
-        appliedDiscount: coupon,
-      });
-      return { success: true, message: 'Coupon applied successfully' };
-    },
+    applyCoupon(code: string): { success: boolean; message: string } {},
 
     removeCoupon() {
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] MethodExpression
src/lib/store/cart.store.ts:159:36
     },
 
     applyCoupon(code: string): { success: boolean; message: string } {
-      const coupon = VALID_COUPONS[code.toUpperCase()];
+      const coupon = VALID_COUPONS[code.toLowerCase()];
       if (!coupon) {
         return { success: false, message: 'Invalid coupon code' };
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:160:11
 
     applyCoupon(code: string): { success: boolean; message: string } {
       const coupon = VALID_COUPONS[code.toUpperCase()];
-      if (!coupon) {
+      if (coupon) {
         return { success: false, message: 'Invalid coupon code' };
       }
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/cart.store.ts:160:11
 
     applyCoupon(code: string): { success: boolean; message: string } {
       const coupon = VALID_COUPONS[code.toUpperCase()];
-      if (!coupon) {
+      if (true) {
         return { success: false, message: 'Invalid coupon code' };
       }
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:161:27
     applyCoupon(code: string): { success: boolean; message: string } {
       const coupon = VALID_COUPONS[code.toUpperCase()];
       if (!coupon) {
-        return { success: false, message: 'Invalid coupon code' };
+        return { success: true, message: 'Invalid coupon code' };
       }
       patchState(store, {
killedBy: CartStore should reject invalid or inapplicable coupon codes
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/store/cart.store.ts:161:16
     applyCoupon(code: string): { success: boolean; message: string } {
       const coupon = VALID_COUPONS[code.toUpperCase()];
       if (!coupon) {
-        return { success: false, message: 'Invalid coupon code' };
+        return {};
       }
       patchState(store, {
killedBy: CartStore should reject invalid or inapplicable coupon codes
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/store/cart.store.ts:167:25
         couponCode: coupon.code,
         appliedDiscount: coupon,
       });
-      return { success: true, message: 'Coupon applied successfully' };
+      return { success: false, message: 'Coupon applied successfully' };
     },
 
killedBy: CartStore should apply PERCENTAGE coupon correctly (SAVE10 -> 10% off)
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/store/cart.store.ts:167:40
         couponCode: coupon.code,
         appliedDiscount: coupon,
       });
-      return { success: true, message: 'Coupon applied successfully' };
+      return { success: true, message: "" };
     },
 

[Killed] BlockStatement
src/lib/store/cart.store.ts:170:20
       return { success: true, message: 'Coupon applied successfully' };
     },
 
-    removeCoupon() {
-      patchState(store, { couponCode: null, appliedDiscount: null });
-    },
+    removeCoupon() {},
 
     setCurrency(currency: SupportedCurrency) {
killedBy: CartStore should remove coupon when removeCoupon is called
statusReason: expected 'SAVE10' to be null

[Killed] BlockStatement
src/lib/store/cart.store.ts:174:46
       patchState(store, { couponCode: null, appliedDiscount: null });
     },
 
-    setCurrency(currency: SupportedCurrency) {
-      patchState(store, { targetCurrency: currency });
-    },
+    setCurrency(currency: SupportedCurrency) {},
 
     clearCart() {
killedBy: CartStore should convert convertedTotal according to selected currency rate
statusReason: expected 142.8 to be 131.38 // Object.is equality

[Killed] BlockStatement
src/lib/store/cart.store.ts:178:17
       patchState(store, { targetCurrency: currency });
     },
 
-    clearCart() {
-      patchState(store, {
-        items: [],
-        couponCode: null,
-        appliedDiscount: null,
-      });
-    },
+    clearCart() {},
   }))
 );
killedBy: CartStore should clear cart on clearCart()
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/lib/store/cart.store.ts:180:16
 
     clearCart() {
       patchState(store, {
-        items: [],
+        items: ["Stryker was here"],
         couponCode: null,
         appliedDiscount: null,
killedBy: CartStore should clear cart on clearCart()
statusReason: expected 1 to be +0 // Object.is equality
