[NoCoverage] ArrowFunction
packages/shop/cart/vite.config.mts:6:29
 import angular from '@analogjs/vite-plugin-angular';
 import tsconfigPaths from 'vite-tsconfig-paths';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/cart',
-  plugins: [angular(), tsconfigPaths()],
-  test: {
-    name: 'cart',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/cart',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] StringLiteral
packages/shop/cart/vite.config.mts:8:13
 
 export default defineConfig(() => ({
   root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/cart',
+  cacheDir: "",
   plugins: [angular(), tsconfigPaths()],
   test: {

[NoCoverage] ArrayDeclaration
packages/shop/cart/vite.config.mts:9:12
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/shop/cart',
-  plugins: [angular(), tsconfigPaths()],
+  plugins: [],
   test: {
     name: 'cart',

[NoCoverage] ObjectLiteral
packages/shop/cart/vite.config.mts:10:9
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/shop/cart',
   plugins: [angular(), tsconfigPaths()],
-  test: {
-    name: 'cart',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/cart',
-      provider: 'v8' as const,
-    },
-  },
+  test: {},
 }));
 

[NoCoverage] StringLiteral
packages/shop/cart/vite.config.mts:11:11
   cacheDir: '../../../node_modules/.vite/packages/shop/cart',
   plugins: [angular(), tsconfigPaths()],
   test: {
-    name: 'cart',
+    name: "",
     watch: false,
     globals: true,

[NoCoverage] BooleanLiteral
packages/shop/cart/vite.config.mts:12:12
   plugins: [angular(), tsconfigPaths()],
   test: {
     name: 'cart',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'jsdom',

[NoCoverage] StringLiteral
packages/shop/cart/vite.config.mts:15:15
     watch: false,
     globals: true,
     environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
+    include: [""],
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],

[NoCoverage] ObjectLiteral
packages/shop/cart/vite.config.mts:18:15
     include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/cart',
-      provider: 'v8' as const,
-    },
+    coverage: {},
   },
 }));
