[Survived] StringLiteral
src/lib/store/checkout.store.ts:24:64
 const initialState: CheckoutState = {
   currentStep: 1,
   customerInfo: { firstName: '', lastName: '', email: '', phone: '' },
-  shippingAddress: { street: '', city: '', state: '', zipCode: '', country: '' },
+  shippingAddress: { street: '', city: '', state: '', zipCode: "Stryker was here!", country: '' },
   selectedShippingMethod: {
     id: 'standard',

[Survived] StringLiteral
src/lib/store/checkout.store.ts:24:40
 const initialState: CheckoutState = {
   currentStep: 1,
   customerInfo: { firstName: '', lastName: '', email: '', phone: '' },
-  shippingAddress: { street: '', city: '', state: '', zipCode: '', country: '' },
+  shippingAddress: { street: '', city: "Stryker was here!", state: '', zipCode: '', country: '' },
   selectedShippingMethod: {
     id: 'standard',

[Survived] StringLiteral
src/lib/store/checkout.store.ts:27:11
   shippingAddress: { street: '', city: '', state: '', zipCode: '', country: '' },
   selectedShippingMethod: {
     id: 'standard',
-    name: 'Standard Shipping',
+    name: "",
     cost: 4.99,
     estimatedDays: 5,

[Survived] StringLiteral
src/lib/store/checkout.store.ts:31:26
     cost: 4.99,
     estimatedDays: 5,
   },
-  paymentInfo: { method: 'CREDIT_CARD' },
+  paymentInfo: { method: "" },
   orderStatus: 'IDLE',
   orderConfirmation: null,

[Survived] ObjectLiteral
src/lib/store/checkout.store.ts:36:58
   orderConfirmation: null,
 };
 
-const SHIPPING_METHODS: Record<string, ShippingMethod> = {
-  standard: { id: 'standard', name: 'Standard Shipping', cost: 4.99, estimatedDays: 5 },
-  express: { id: 'express', name: 'Express Shipping', cost: 14.99, estimatedDays: 2 },
-  overnight: { id: 'overnight', name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },
-};
+const SHIPPING_METHODS: Record<string, ShippingMethod> = {};
 
 function isLuhnValid(cardNumber: string): boolean {

[Survived] StringLiteral
src/lib/store/checkout.store.ts:37:19
 };
 
 const SHIPPING_METHODS: Record<string, ShippingMethod> = {
-  standard: { id: 'standard', name: 'Standard Shipping', cost: 4.99, estimatedDays: 5 },
+  standard: { id: "", name: 'Standard Shipping', cost: 4.99, estimatedDays: 5 },
   express: { id: 'express', name: 'Express Shipping', cost: 14.99, estimatedDays: 2 },
   overnight: { id: 'overnight', name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },

[Survived] ObjectLiteral
src/lib/store/checkout.store.ts:39:14
 const SHIPPING_METHODS: Record<string, ShippingMethod> = {
   standard: { id: 'standard', name: 'Standard Shipping', cost: 4.99, estimatedDays: 5 },
   express: { id: 'express', name: 'Express Shipping', cost: 14.99, estimatedDays: 2 },
-  overnight: { id: 'overnight', name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },
+  overnight: {},
 };
 

[Survived] StringLiteral
src/lib/store/checkout.store.ts:39:20
 const SHIPPING_METHODS: Record<string, ShippingMethod> = {
   standard: { id: 'standard', name: 'Standard Shipping', cost: 4.99, estimatedDays: 5 },
   express: { id: 'express', name: 'Express Shipping', cost: 14.99, estimatedDays: 2 },
-  overnight: { id: 'overnight', name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },
+  overnight: { id: "", name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },
 };
 

[Killed] BlockStatement
src/lib/store/checkout.store.ts:42:51
   overnight: { id: 'overnight', name: 'Overnight Express', cost: 29.99, estimatedDays: 1 },
 };
 
-function isLuhnValid(cardNumber: string): boolean {
-  const sanitized = cardNumber.replace(/\D/g, '');
-  if (sanitized.length < 13 || sanitized.length > 19) return false;
-  let sum = 0;
-  let shouldDouble = false;
-
-  for (let i = sanitized.length - 1; i >= 0; i--) {
-    let digit = parseInt(sanitized.charAt(i), 10);
-    if (shouldDouble) {
-      digit *= 2;
-      if (digit > 9) digit -= 9;
-    }
-    sum += digit;
-    shouldDouble = !shouldDouble;
-  }
-  return sum % 10 === 0;
-}
+function isLuhnValid(cardNumber: string): boolean {}
 
 export const CheckoutStore = signalStore(
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
src/lib/store/checkout.store.ts:43:47
 };
 
 function isLuhnValid(cardNumber: string): boolean {
-  const sanitized = cardNumber.replace(/\D/g, '');
+  const sanitized = cardNumber.replace(/\D/g, "Stryker was here!");
   if (sanitized.length < 13 || sanitized.length > 19) return false;
   let sum = 0;

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:44:7
 
 function isLuhnValid(cardNumber: string): boolean {
   const sanitized = cardNumber.replace(/\D/g, '');
-  if (sanitized.length < 13 || sanitized.length > 19) return false;
+  if (sanitized.length >= 13 || sanitized.length > 19) return false;
   let sum = 0;
   let shouldDouble = false;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:44:7
 
 function isLuhnValid(cardNumber: string): boolean {
   const sanitized = cardNumber.replace(/\D/g, '');
-  if (sanitized.length < 13 || sanitized.length > 19) return false;
+  if (true) return false;
   let sum = 0;
   let shouldDouble = false;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:46:22
   const sanitized = cardNumber.replace(/\D/g, '');
   if (sanitized.length < 13 || sanitized.length > 19) return false;
   let sum = 0;
-  let shouldDouble = false;
+  let shouldDouble = true;
 
   for (let i = sanitized.length - 1; i >= 0; i--) {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:48:38
   let sum = 0;
   let shouldDouble = false;
 
-  for (let i = sanitized.length - 1; i >= 0; i--) {
+  for (let i = sanitized.length - 1; false; i--) {
     let digit = parseInt(sanitized.charAt(i), 10);
     if (shouldDouble) {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/checkout.store.ts:48:16
   let sum = 0;
   let shouldDouble = false;
 
-  for (let i = sanitized.length - 1; i >= 0; i--) {
+  for (let i = sanitized.length + 1; i >= 0; i--) {
     let digit = parseInt(sanitized.charAt(i), 10);
     if (shouldDouble) {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/store/checkout.store.ts:49:26
   let shouldDouble = false;
 
   for (let i = sanitized.length - 1; i >= 0; i--) {
-    let digit = parseInt(sanitized.charAt(i), 10);
+    let digit = parseInt(sanitized, 10);
     if (shouldDouble) {
       digit *= 2;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:50:9
 
   for (let i = sanitized.length - 1; i >= 0; i--) {
     let digit = parseInt(sanitized.charAt(i), 10);
-    if (shouldDouble) {
+    if (true) {
       digit *= 2;
       if (digit > 9) digit -= 9;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/lib/store/checkout.store.ts:50:9
 
   for (let i = sanitized.length - 1; i >= 0; i--) {
     let digit = parseInt(sanitized.charAt(i), 10);
-    if (shouldDouble) {
+    if (false) {
       digit *= 2;
       if (digit > 9) digit -= 9;

[Killed] AssignmentOperator
src/lib/store/checkout.store.ts:51:7
   for (let i = sanitized.length - 1; i >= 0; i--) {
     let digit = parseInt(sanitized.charAt(i), 10);
     if (shouldDouble) {
-      digit *= 2;
+      digit /= 2;
       if (digit > 9) digit -= 9;
     }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:52:11
     let digit = parseInt(sanitized.charAt(i), 10);
     if (shouldDouble) {
       digit *= 2;
-      if (digit > 9) digit -= 9;
+      if (false) digit -= 9;
     }
     sum += digit;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] AssignmentOperator
src/lib/store/checkout.store.ts:52:22
     let digit = parseInt(sanitized.charAt(i), 10);
     if (shouldDouble) {
       digit *= 2;
-      if (digit > 9) digit -= 9;
+      if (digit > 9) digit += 9;
     }
     sum += digit;
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Survived] AssignmentOperator
src/lib/store/checkout.store.ts:54:5
       digit *= 2;
       if (digit > 9) digit -= 9;
     }
-    sum += digit;
+    sum -= digit;
     shouldDouble = !shouldDouble;
   }

[Survived] BooleanLiteral
src/lib/store/checkout.store.ts:55:20
       if (digit > 9) digit -= 9;
     }
     sum += digit;
-    shouldDouble = !shouldDouble;
+    shouldDouble = shouldDouble;
   }
   return sum % 10 === 0;

[Killed] ArithmeticOperator
src/lib/store/checkout.store.ts:57:10
     sum += digit;
     shouldDouble = !shouldDouble;
   }
-  return sum % 10 === 0;
+  return sum * 10 === 0;
 }
 
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:57:10
     sum += digit;
     shouldDouble = !shouldDouble;
   }
-  return sum % 10 === 0;
+  return true;
 }
 
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected true to be false // Object.is equality

[Survived] ObjectLiteral
src/lib/store/checkout.store.ts:61:3
 }
 
 export const CheckoutStore = signalStore(
-  { providedIn: 'root' },
+  {},
   withState(initialState),
   withComputed((store) => {

[Survived] StringLiteral
src/lib/store/checkout.store.ts:61:17
 }
 
 export const CheckoutStore = signalStore(
-  { providedIn: 'root' },
+  { providedIn: "" },
   withState(initialState),
   withComputed((store) => {

[Killed] BlockStatement
src/lib/store/checkout.store.ts:64:39
   { providedIn: 'root' },
   withState(initialState),
   withComputed((store) => {
-    const isCustomerInfoValid = () => {
-      const info = store.customerInfo();
-      return (
-        info.firstName.trim().length > 0 &&
-        info.lastName.trim().length > 0 &&
-        info.email.includes('@') &&
-        info.email.includes('.') &&
-        info.phone.trim().length >= 7
-      );
-    };
+    const isCustomerInfoValid = () => {};
 
     const isShippingAddressValid = () => {
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:67:9
     const isCustomerInfoValid = () => {
       const info = store.customerInfo();
       return (
-        info.firstName.trim().length > 0 &&
-        info.lastName.trim().length > 0 &&
-        info.email.includes('@') &&
-        info.email.includes('.') &&
-        info.phone.trim().length >= 7
+        false
       );
     };
killedBy: CheckoutStore should validate customer info fields
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:67:9
     const isCustomerInfoValid = () => {
       const info = store.customerInfo();
       return (
-        info.firstName.trim().length > 0 &&
-        info.lastName.trim().length > 0 &&
-        info.email.includes('@') &&
-        info.email.includes('.') &&
-        info.phone.trim().length >= 7
+        true
       );
     };
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:68:9
       const info = store.customerInfo();
       return (
         info.firstName.trim().length > 0 &&
-        info.lastName.trim().length > 0 &&
+        info.lastName.trim().length <= 0 &&
         info.email.includes('@') &&
         info.email.includes('.') &&
killedBy: CheckoutStore should validate customer info fields
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/lib/store/checkout.store.ts:68:9
       const info = store.customerInfo();
       return (
         info.firstName.trim().length > 0 &&
-        info.lastName.trim().length > 0 &&
+        info.lastName.trim().length >= 0 &&
         info.email.includes('@') &&
         info.email.includes('.') &&

[Survived] StringLiteral
src/lib/store/checkout.store.ts:69:29
       return (
         info.firstName.trim().length > 0 &&
         info.lastName.trim().length > 0 &&
-        info.email.includes('@') &&
+        info.email.includes("") &&
         info.email.includes('.') &&
         info.phone.trim().length >= 7

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:71:9
         info.lastName.trim().length > 0 &&
         info.email.includes('@') &&
         info.email.includes('.') &&
-        info.phone.trim().length >= 7
+        info.phone.trim().length < 7
       );
     };
killedBy: CheckoutStore should validate customer info fields
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/store/checkout.store.ts:71:9
         info.lastName.trim().length > 0 &&
         info.email.includes('@') &&
         info.email.includes('.') &&
-        info.phone.trim().length >= 7
+        true
       );
     };

[Killed] BlockStatement
src/lib/store/checkout.store.ts:75:42
       );
     };
 
-    const isShippingAddressValid = () => {
-      const addr = store.shippingAddress();
-      return (
-        addr.street.trim().length > 0 &&
-        addr.city.trim().length > 0 &&
-        addr.state.trim().length > 0 &&
-        addr.zipCode.trim().length > 0 &&
-        addr.country.trim().length > 0
-      );
-    };
+    const isShippingAddressValid = () => {};
 
     const isPaymentInfoValid = () => {
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/lib/store/checkout.store.ts:78:9
     const isShippingAddressValid = () => {
       const addr = store.shippingAddress();
       return (
-        addr.street.trim().length > 0 &&
-        addr.city.trim().length > 0 &&
+        addr.street.trim().length > 0 || addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
         addr.zipCode.trim().length > 0 &&
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:78:9
     const isShippingAddressValid = () => {
       const addr = store.shippingAddress();
       return (
-        addr.street.trim().length > 0 &&
-        addr.city.trim().length > 0 &&
-        addr.state.trim().length > 0 &&
-        addr.zipCode.trim().length > 0 &&
-        addr.country.trim().length > 0
+        true
       );
     };
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:79:9
       const addr = store.shippingAddress();
       return (
         addr.street.trim().length > 0 &&
-        addr.city.trim().length > 0 &&
+        addr.city.trim().length <= 0 &&
         addr.state.trim().length > 0 &&
         addr.zipCode.trim().length > 0 &&
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/lib/store/checkout.store.ts:79:9
       const addr = store.shippingAddress();
       return (
         addr.street.trim().length > 0 &&
-        addr.city.trim().length > 0 &&
+        addr.city.trim().length >= 0 &&
         addr.state.trim().length > 0 &&
         addr.zipCode.trim().length > 0 &&

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:80:9
       return (
         addr.street.trim().length > 0 &&
         addr.city.trim().length > 0 &&
-        addr.state.trim().length > 0 &&
+        addr.state.trim().length <= 0 &&
         addr.zipCode.trim().length > 0 &&
         addr.country.trim().length > 0
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/lib/store/checkout.store.ts:80:9
       return (
         addr.street.trim().length > 0 &&
         addr.city.trim().length > 0 &&
-        addr.state.trim().length > 0 &&
+        addr.state.trim().length >= 0 &&
         addr.zipCode.trim().length > 0 &&
         addr.country.trim().length > 0

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:81:9
         addr.street.trim().length > 0 &&
         addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
-        addr.zipCode.trim().length > 0 &&
+        addr.zipCode.trim().length <= 0 &&
         addr.country.trim().length > 0
       );
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/store/checkout.store.ts:81:9
         addr.street.trim().length > 0 &&
         addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
-        addr.zipCode.trim().length > 0 &&
+        addr.zipCode.length > 0 &&
         addr.country.trim().length > 0
       );

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:82:9
         addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
         addr.zipCode.trim().length > 0 &&
-        addr.country.trim().length > 0
+        addr.country.trim().length <= 0
       );
     };
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/store/checkout.store.ts:82:9
         addr.city.trim().length > 0 &&
         addr.state.trim().length > 0 &&
         addr.zipCode.trim().length > 0 &&
-        addr.country.trim().length > 0
+        addr.country.length > 0
       );
     };

[Killed] BlockStatement
src/lib/store/checkout.store.ts:86:38
       );
     };
 
-    const isPaymentInfoValid = () => {
-      const pay = store.paymentInfo();
-      if (pay.method === 'PAYPAL') {
-        return !!pay.paypalEmail && pay.paypalEmail.includes('@');
-      }
-      if (pay.method === 'INVOICE') {
-        return true;
-      }
-      // CREDIT_CARD
-      if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
-        return false;
-      }
-      if (!pay.cvv.match(/^\d{3,4}$/)) return false;
-      return isLuhnValid(pay.cardNumber);
-    };
+    const isPaymentInfoValid = () => {};
 
     return {
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:88:11
 
     const isPaymentInfoValid = () => {
       const pay = store.paymentInfo();
-      if (pay.method === 'PAYPAL') {
+      if (pay.method !== 'PAYPAL') {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:88:11
 
     const isPaymentInfoValid = () => {
       const pay = store.paymentInfo();
-      if (pay.method === 'PAYPAL') {
+      if (false) {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:89:17
     const isPaymentInfoValid = () => {
       const pay = store.paymentInfo();
       if (pay.method === 'PAYPAL') {
-        return !!pay.paypalEmail && pay.paypalEmail.includes('@');
+        return !pay.paypalEmail && pay.paypalEmail.includes('@');
       }
       if (pay.method === 'INVOICE') {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:89:16
     const isPaymentInfoValid = () => {
       const pay = store.paymentInfo();
       if (pay.method === 'PAYPAL') {
-        return !!pay.paypalEmail && pay.paypalEmail.includes('@');
+        return true;
       }
       if (pay.method === 'INVOICE') {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:91:37
       if (pay.method === 'PAYPAL') {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
-      if (pay.method === 'INVOICE') {
-        return true;
-      }
+      if (pay.method === 'INVOICE') {}
       // CREDIT_CARD
       if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:91:11
       if (pay.method === 'PAYPAL') {
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
-      if (pay.method === 'INVOICE') {
+      if (false) {
         return true;
       }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:92:16
         return !!pay.paypalEmail && pay.paypalEmail.includes('@');
       }
       if (pay.method === 'INVOICE') {
-        return true;
+        return false;
       }
       // CREDIT_CARD
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:95:11
         return true;
       }
       // CREDIT_CARD
-      if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
+      if (false) {
         return false;
       }
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:95:11
         return true;
       }
       // CREDIT_CARD
-      if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
+      if (pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
         return false;
       }
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:96:16
       }
       // CREDIT_CARD
       if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
-        return false;
+        return true;
       }
       if (!pay.cvv.match(/^\d{3,4}$/)) return false;
killedBy: CheckoutStore should initialize at step 1 (Customer Info)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:98:11
       if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
         return false;
       }
-      if (!pay.cvv.match(/^\d{3,4}$/)) return false;
+      if (true) return false;
       return isLuhnValid(pay.cardNumber);
     };
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:98:11
       if (!pay.cardNumber || !pay.cardHolder || !pay.expiryDate || !pay.cvv) {
         return false;
       }
-      if (!pay.cvv.match(/^\d{3,4}$/)) return false;
+      if (pay.cvv.match(/^\d{3,4}$/)) return false;
       return isLuhnValid(pay.cardNumber);
     };
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:109:40
     };
   }),
   withMethods((store) => ({
-    isStepValid(step: number): boolean {
-      if (step === 1) return store.isCustomerInfoValid();
-      if (step === 2) return store.isShippingAddressValid();
-      if (step === 3) return store.isPaymentInfoValid();
-      return true;
-    },
+    isStepValid(step: number): boolean {},
 
     updateCustomerInfo(info: CustomerInfo) {
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:110:11
   }),
   withMethods((store) => ({
     isStepValid(step: number): boolean {
-      if (step === 1) return store.isCustomerInfoValid();
+      if (step !== 1) return store.isCustomerInfoValid();
       if (step === 2) return store.isShippingAddressValid();
       if (step === 3) return store.isPaymentInfoValid();
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:110:11
   }),
   withMethods((store) => ({
     isStepValid(step: number): boolean {
-      if (step === 1) return store.isCustomerInfoValid();
+      if (false) return store.isCustomerInfoValid();
       if (step === 2) return store.isShippingAddressValid();
       if (step === 3) return store.isPaymentInfoValid();
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected true to be false // Object.is equality

[NoCoverage] ConditionalExpression
src/lib/store/checkout.store.ts:111:11
   withMethods((store) => ({
     isStepValid(step: number): boolean {
       if (step === 1) return store.isCustomerInfoValid();
-      if (step === 2) return store.isShippingAddressValid();
+      if (true) return store.isShippingAddressValid();
       if (step === 3) return store.isPaymentInfoValid();
       return true;

[NoCoverage] EqualityOperator
src/lib/store/checkout.store.ts:111:11
   withMethods((store) => ({
     isStepValid(step: number): boolean {
       if (step === 1) return store.isCustomerInfoValid();
-      if (step === 2) return store.isShippingAddressValid();
+      if (step !== 2) return store.isShippingAddressValid();
       if (step === 3) return store.isPaymentInfoValid();
       return true;

[NoCoverage] EqualityOperator
src/lib/store/checkout.store.ts:112:11
     isStepValid(step: number): boolean {
       if (step === 1) return store.isCustomerInfoValid();
       if (step === 2) return store.isShippingAddressValid();
-      if (step === 3) return store.isPaymentInfoValid();
+      if (step !== 3) return store.isPaymentInfoValid();
       return true;
     },

[NoCoverage] ConditionalExpression
src/lib/store/checkout.store.ts:112:11
     isStepValid(step: number): boolean {
       if (step === 1) return store.isCustomerInfoValid();
       if (step === 2) return store.isShippingAddressValid();
-      if (step === 3) return store.isPaymentInfoValid();
+      if (true) return store.isPaymentInfoValid();
       return true;
     },

[NoCoverage] BooleanLiteral
src/lib/store/checkout.store.ts:113:14
       if (step === 1) return store.isCustomerInfoValid();
       if (step === 2) return store.isShippingAddressValid();
       if (step === 3) return store.isPaymentInfoValid();
-      return true;
+      return false;
     },
 

[Killed] BlockStatement
src/lib/store/checkout.store.ts:116:44
       return true;
     },
 
-    updateCustomerInfo(info: CustomerInfo) {
-      patchState(store, { customerInfo: info });
-    },
+    updateCustomerInfo(info: CustomerInfo) {},
 
     updateShippingAddress(address: ShippingAddress) {
killedBy: CheckoutStore should validate customer info fields
statusReason: expected false to be true // Object.is equality
