[Killed] ObjectLiteral
src/lib/store/checkout.store.ts:117:25
     },
 
     updateCustomerInfo(info: CustomerInfo) {
-      patchState(store, { customerInfo: info });
+      patchState(store, {});
     },
 
killedBy: CheckoutStore should validate customer info fields
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:120:53
       patchState(store, { customerInfo: info });
     },
 
-    updateShippingAddress(address: ShippingAddress) {
-      patchState(store, { shippingAddress: address });
-    },
+    updateShippingAddress(address: ShippingAddress) {},
 
     selectShippingMethod(methodId: 'standard' | 'express' | 'overnight') {
killedBy: CheckoutStore should validate shipping address fields including whitespace checks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:124:74
       patchState(store, { shippingAddress: address });
     },
 
-    selectShippingMethod(methodId: 'standard' | 'express' | 'overnight') {
-      const method = SHIPPING_METHODS[methodId];
-      if (method) {
-        patchState(store, { selectedShippingMethod: method });
-      }
-    },
+    selectShippingMethod(methodId: 'standard' | 'express' | 'overnight') {},
 
     updatePaymentInfo(payment: PaymentDetails) {
killedBy: CheckoutStore should allow selecting shipping method
statusReason: expected 'standard' to be 'express' // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:126:19
 
     selectShippingMethod(methodId: 'standard' | 'express' | 'overnight') {
       const method = SHIPPING_METHODS[methodId];
-      if (method) {
-        patchState(store, { selectedShippingMethod: method });
-      }
+      if (method) {}
     },
 
killedBy: CheckoutStore should allow selecting shipping method
statusReason: expected 'standard' to be 'express' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:126:11
 
     selectShippingMethod(methodId: 'standard' | 'express' | 'overnight') {
       const method = SHIPPING_METHODS[methodId];
-      if (method) {
+      if (false) {
         patchState(store, { selectedShippingMethod: method });
       }
killedBy: CheckoutStore should allow selecting shipping method
statusReason: expected 'standard' to be 'express' // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:131:48
       }
     },
 
-    updatePaymentInfo(payment: PaymentDetails) {
-      patchState(store, { paymentInfo: payment });
-    },
+    updatePaymentInfo(payment: PaymentDetails) {},
 
     nextStep(): boolean {
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/store/checkout.store.ts:132:25
     },
 
     updatePaymentInfo(payment: PaymentDetails) {
-      patchState(store, { paymentInfo: payment });
+      patchState(store, {});
     },
 
killedBy: CheckoutStore should validate payment details with Luhn algorithm for credit card, PayPal, and Invoice
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:135:25
       patchState(store, { paymentInfo: payment });
     },
 
-    nextStep(): boolean {
-      const step = store.currentStep();
-      if (!this.isStepValid(step)) {
-        return false;
-      }
-      if (step < 4) {
-        patchState(store, { currentStep: (step + 1) as 1 | 2 | 3 | 4 });
-        return true;
-      }
-      return false;
-    },
+    nextStep(): boolean {},
 
     prevStep() {
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:137:36
 
     nextStep(): boolean {
       const step = store.currentStep();
-      if (!this.isStepValid(step)) {
-        return false;
-      }
+      if (!this.isStepValid(step)) {}
       if (step < 4) {
         patchState(store, { currentStep: (step + 1) as 1 | 2 | 3 | 4 });
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:137:11
 
     nextStep(): boolean {
       const step = store.currentStep();
-      if (!this.isStepValid(step)) {
+      if (this.isStepValid(step)) {
         return false;
       }
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:138:16
     nextStep(): boolean {
       const step = store.currentStep();
       if (!this.isStepValid(step)) {
-        return false;
+        return true;
       }
       if (step < 4) {
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:140:11
       if (!this.isStepValid(step)) {
         return false;
       }
-      if (step < 4) {
+      if (step >= 4) {
         patchState(store, { currentStep: (step + 1) as 1 | 2 | 3 | 4 });
         return true;
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:140:21
       if (!this.isStepValid(step)) {
         return false;
       }
-      if (step < 4) {
-        patchState(store, { currentStep: (step + 1) as 1 | 2 | 3 | 4 });
-        return true;
-      }
+      if (step < 4) {}
       return false;
     },
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:142:16
       }
       if (step < 4) {
         patchState(store, { currentStep: (step + 1) as 1 | 2 | 3 | 4 });
-        return true;
+        return false;
       }
       return false;
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:147:16
       return false;
     },
 
-    prevStep() {
-      const step = store.currentStep();
-      if (step > 1) {
-        patchState(store, { currentStep: (step - 1) as 1 | 2 | 3 | 4 });
-      }
-    },
+    prevStep() {},
 
     calculateGrandTotal(itemSubtotal: number): number {
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:149:11
 
     prevStep() {
       const step = store.currentStep();
-      if (step > 1) {
+      if (step <= 1) {
         patchState(store, { currentStep: (step - 1) as 1 | 2 | 3 | 4 });
       }
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/store/checkout.store.ts:149:11
 
     prevStep() {
       const step = store.currentStep();
-      if (step > 1) {
+      if (step >= 1) {
         patchState(store, { currentStep: (step - 1) as 1 | 2 | 3 | 4 });
       }
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/checkout.store.ts:150:27
     prevStep() {
       const step = store.currentStep();
       if (step > 1) {
-        patchState(store, { currentStep: (step - 1) as 1 | 2 | 3 | 4 });
+        patchState(store, {});
       }
     },
killedBy: CheckoutStore should prevent advancing step if current step is invalid and allow step navigation
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:154:55
       }
     },
 
-    calculateGrandTotal(itemSubtotal: number): number {
-      const tax = +(itemSubtotal * 0.19).toFixed(2);
-      const shipping = store.selectedShippingMethod().cost;
-      return +(itemSubtotal + tax + shipping).toFixed(2);
-    },
+    calculateGrandTotal(itemSubtotal: number): number {},
 
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
killedBy: CheckoutStore should calculate grand total for order summary
statusReason: expected undefined to be 252.99 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/checkout.store.ts:155:21
     },
 
     calculateGrandTotal(itemSubtotal: number): number {
-      const tax = +(itemSubtotal * 0.19).toFixed(2);
+      const tax = +(itemSubtotal / 0.19).toFixed(2);
       const shipping = store.selectedShippingMethod().cost;
       return +(itemSubtotal + tax + shipping).toFixed(2);
killedBy: CheckoutStore should calculate grand total for order summary
statusReason: expected 1267.62 to be 252.99 // Object.is equality

[Killed] UnaryOperator
src/lib/store/checkout.store.ts:155:19
     },
 
     calculateGrandTotal(itemSubtotal: number): number {
-      const tax = +(itemSubtotal * 0.19).toFixed(2);
+      const tax = -(itemSubtotal * 0.19).toFixed(2);
       const shipping = store.selectedShippingMethod().cost;
       return +(itemSubtotal + tax + shipping).toFixed(2);
killedBy: CheckoutStore should calculate grand total for order summary
statusReason: expected 176.99 to be 252.99 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/checkout.store.ts:157:16
     calculateGrandTotal(itemSubtotal: number): number {
       const tax = +(itemSubtotal * 0.19).toFixed(2);
       const shipping = store.selectedShippingMethod().cost;
-      return +(itemSubtotal + tax + shipping).toFixed(2);
+      return +(itemSubtotal + tax - shipping).toFixed(2);
     },
 
killedBy: CheckoutStore should calculate grand total for order summary
statusReason: expected 223.01 to be 252.99 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/checkout.store.ts:157:16
     calculateGrandTotal(itemSubtotal: number): number {
       const tax = +(itemSubtotal * 0.19).toFixed(2);
       const shipping = store.selectedShippingMethod().cost;
-      return +(itemSubtotal + tax + shipping).toFixed(2);
+      return +(itemSubtotal - tax + shipping).toFixed(2);
     },
 
killedBy: CheckoutStore should calculate grand total for order summary
statusReason: expected 176.99 to be 252.99 // Object.is equality

[Killed] BlockStatement
src/lib/store/checkout.store.ts:160:102
       return +(itemSubtotal + tax + shipping).toFixed(2);
     },
 
-    submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
-      if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
-        patchState(store, { orderStatus: 'FAILED' });
-        return { success: false, message: 'Invalid checkout information' };
-      }
-
-      const confirmation: OrderConfirmation = {
-        orderId: `ORD-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        timestamp: new Date().toISOString(),
-        items: cartItems,
-        shippingAddress: store.shippingAddress(),
-        shippingMethod: store.selectedShippingMethod(),
-        paymentMethod: store.paymentInfo().method,
-        totalAmount: this.calculateGrandTotal(itemSubtotal),
-        status: 'CONFIRMED',
-      };
-
-      patchState(store, {
-        orderStatus: 'CONFIRMED',
-        orderConfirmation: confirmation,
-      });
-
-      return { success: true };
-    },
+    submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {},
   }))
 );
killedBy: CheckoutStore should handle order submission failure when data is incomplete
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:161:11
     },
 
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
-      if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
+      if (store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
         patchState(store, { orderStatus: 'FAILED' });
         return { success: false, message: 'Invalid checkout information' };
killedBy: CheckoutStore should submit order successfully and produce order confirmation
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/checkout.store.ts:161:11
     },
 
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
-      if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
+      if (false) {
         patchState(store, { orderStatus: 'FAILED' });
         return { success: false, message: 'Invalid checkout information' };
killedBy: CheckoutStore should handle order submission failure when data is incomplete
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/store/checkout.store.ts:162:27
 
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
       if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
-        patchState(store, { orderStatus: 'FAILED' });
+        patchState(store, {});
         return { success: false, message: 'Invalid checkout information' };
       }
killedBy: CheckoutStore should handle order submission failure when data is incomplete
statusReason: expected 'IDLE' to be 'FAILED' // Object.is equality

[Killed] BooleanLiteral
src/lib/store/checkout.store.ts:163:27
     submitOrder(cartItems: CartItem[], itemSubtotal: number): { success: boolean; message?: string } {
       if (!store.isCustomerInfoValid() || !store.isShippingAddressValid() || !store.isPaymentInfoValid()) {
         patchState(store, { orderStatus: 'FAILED' });
-        return { success: false, message: 'Invalid checkout information' };
+        return { success: true, message: 'Invalid checkout information' };
       }
 
killedBy: CheckoutStore should handle order submission failure when data is incomplete
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/lib/store/checkout.store.ts:167:50
       }
 
       const confirmation: OrderConfirmation = {
-        orderId: `ORD-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
+        orderId: `ORD-${Date.now()}-${Math.floor(Math.random() / 1000)}`,
         timestamp: new Date().toISOString(),
         items: cartItems,

[Killed] ObjectLiteral
src/lib/store/checkout.store.ts:177:25
         status: 'CONFIRMED',
       };
 
-      patchState(store, {
-        orderStatus: 'CONFIRMED',
-        orderConfirmation: confirmation,
-      });
+      patchState(store, {});
 
       return { success: true };
killedBy: CheckoutStore should submit order successfully and produce order confirmation
statusReason: expected 'IDLE' to be 'CONFIRMED' // Object.is equality
