[NoCoverage] StringLiteral
packages/shop/data/eslint.config.mjs:7:17
 export default [
   ...baseConfig,
   ...nx.configs['flat/angular'],
-  ...nx.configs['flat/angular-template'],
+  ...nx.configs[""],
   {
     files: ['**/*.ts'],

[NoCoverage] ObjectLiteral
packages/shop/data/eslint.config.mjs:8:3
   ...baseConfig,
   ...nx.configs['flat/angular'],
   ...nx.configs['flat/angular-template'],
-  {
-    files: ['**/*.ts'],
-    rules: {
-      '@angular-eslint/directive-selector': [
-        'error',
-        {
-          type: 'attribute',
-          prefix: 'lib',
-          style: 'camelCase',
-        },
-      ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'lib',
-          style: 'kebab-case',
-        },
-      ],
-    },
-  },
+  {},
   {
     files: ['**/*.html'],

[NoCoverage] ObjectLiteral
packages/shop/data/eslint.config.mjs:10:12
   ...nx.configs['flat/angular-template'],
   {
     files: ['**/*.ts'],
-    rules: {
-      '@angular-eslint/directive-selector': [
-        'error',
-        {
-          type: 'attribute',
-          prefix: 'lib',
-          style: 'camelCase',
-        },
-      ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'lib',
-          style: 'kebab-case',
-        },
-      ],
-    },
+    rules: {},
   },
   {

[NoCoverage] ObjectLiteral
packages/shop/data/eslint.config.mjs:13:9
     rules: {
       '@angular-eslint/directive-selector': [
         'error',
-        {
-          type: 'attribute',
-          prefix: 'lib',
-          style: 'camelCase',
-        },
+        {},
       ],
       '@angular-eslint/component-selector': [

[NoCoverage] StringLiteral
packages/shop/data/eslint.config.mjs:15:19
         'error',
         {
           type: 'attribute',
-          prefix: 'lib',
+          prefix: "",
           style: 'camelCase',
         },

[NoCoverage] ArrayDeclaration
packages/shop/data/eslint.config.mjs:19:45
           style: 'camelCase',
         },
       ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'lib',
-          style: 'kebab-case',
-        },
-      ],
+      '@angular-eslint/component-selector': [],
     },
   },

[NoCoverage] ObjectLiteral
packages/shop/data/eslint.config.mjs:29:3
       ],
     },
   },
-  {
-    files: ['**/*.html'],
-    // Override or add rules here
-    rules: {},
-  },
+  {},
 ];
 
