[Killed] BooleanLiteral
src/lib/services/products.service.ts:14:43
   private readonly apiUrl = 'http://localhost:3333/api';
 
   // Signals for state management
-  private readonly loadingSignal = signal(false);
+  private readonly loadingSignal = signal(true);
   private readonly errorSignal = signal<string | null>(null);
 
killedBy: ProductsService loading and error signals should set loading to true when fetching products
statusReason: expected true to be falsy

[Killed] BooleanLiteral
src/lib/services/products.service.ts:25:28
     page = 1,
     pageSize = 12
   ): Observable<PaginatedResponse<Product>> {
-    this.loadingSignal.set(true);
+    this.loadingSignal.set(false);
     this.errorSignal.set(null);
 
killedBy: ProductsService loading and error signals should set loading to true when fetching products
statusReason: expected false to be truthy

[Killed] StringLiteral
src/lib/services/products.service.ts:29:12
     this.errorSignal.set(null);
 
     let params = new HttpParams()
-      .set('page', page.toString())
+      .set("", page.toString())
       .set('pageSize', pageSize.toString());
 
killedBy: ProductsService getProducts should return products with default pagination
statusReason: Expected one matching request for criteria "Match URL: http://localhost:3333/api/products?page=1&pageSize=12", found none. Requests received are: GET http://localhost:3333/api/products?=1&pageSize=12.

[Killed] StringLiteral
src/lib/services/products.service.ts:30:12
 
     let params = new HttpParams()
       .set('page', page.toString())
-      .set('pageSize', pageSize.toString());
+      .set("", pageSize.toString());
 
     if (filter) {
killedBy: ProductsService getProducts should return products with default pagination
statusReason: Expected one matching request for criteria "Match URL: http://localhost:3333/api/products?page=1&pageSize=12", found none. Requests received are: GET http://localhost:3333/api/products?page=1&=12.

[Killed] BlockStatement
src/lib/services/products.service.ts:32:17
       .set('page', page.toString())
       .set('pageSize', pageSize.toString());
 
-    if (filter) {
-      if (filter.category) {
-        params = params.set('category', filter.category);
-      }
-      if (filter.minPrice !== undefined) {
-        params = params.set('minPrice', filter.minPrice.toString());
-      }
-      if (filter.maxPrice !== undefined) {
-        params = params.set('maxPrice', filter.maxPrice.toString());
-      }
-      if (filter.inStock !== undefined) {
-        params = params.set('inStock', filter.inStock.toString());
-      }
-      if (filter.searchTerm) {
-        params = params.set('searchTerm', filter.searchTerm);
-      }
-    }
+    if (filter) {}
 
     return this.http
killedBy: ProductsService getProducts should apply filters when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:3333/api/products?page=2&pageSize=20&category=Electronics&minPrice=50&maxPrice=150&inStock=true&searchTerm=test", found none. Requests received are: GET http://localhost:3333/api/products?page=2&pageSize=20.

[Killed] BlockStatement
src/lib/services/products.service.ts:33:28
       .set('pageSize', pageSize.toString());
 
     if (filter) {
-      if (filter.category) {
-        params = params.set('category', filter.category);
-      }
+      if (filter.category) {}
       if (filter.minPrice !== undefined) {
         params = params.set('minPrice', filter.minPrice.toString());
killedBy: ProductsService getProducts should apply filters when provided

[Killed] StringLiteral
src/lib/services/products.service.ts:34:29
 
     if (filter) {
       if (filter.category) {
-        params = params.set('category', filter.category);
+        params = params.set("", filter.category);
       }
       if (filter.minPrice !== undefined) {
killedBy: ProductsService getProducts should apply filters when provided

[Killed] BlockStatement
src/lib/services/products.service.ts:36:42
       if (filter.category) {
         params = params.set('category', filter.category);
       }
-      if (filter.minPrice !== undefined) {
-        params = params.set('minPrice', filter.minPrice.toString());
-      }
+      if (filter.minPrice !== undefined) {}
       if (filter.maxPrice !== undefined) {
         params = params.set('maxPrice', filter.maxPrice.toString());
killedBy: ProductsService getProducts should apply filters when provided

[Killed] ConditionalExpression
src/lib/services/products.service.ts:36:11
       if (filter.category) {
         params = params.set('category', filter.category);
       }
-      if (filter.minPrice !== undefined) {
+      if (false) {
         params = params.set('minPrice', filter.minPrice.toString());
       }
killedBy: ProductsService getProducts should apply filters when provided

[Killed] StringLiteral
src/lib/services/products.service.ts:37:29
         params = params.set('category', filter.category);
       }
       if (filter.minPrice !== undefined) {
-        params = params.set('minPrice', filter.minPrice.toString());
+        params = params.set("", filter.minPrice.toString());
       }
       if (filter.maxPrice !== undefined) {
killedBy: ProductsService getProducts should apply filters when provided

[Killed] BlockStatement
src/lib/services/products.service.ts:39:42
       if (filter.minPrice !== undefined) {
         params = params.set('minPrice', filter.minPrice.toString());
       }
-      if (filter.maxPrice !== undefined) {
-        params = params.set('maxPrice', filter.maxPrice.toString());
-      }
+      if (filter.maxPrice !== undefined) {}
       if (filter.inStock !== undefined) {
         params = params.set('inStock', filter.inStock.toString());
killedBy: ProductsService getProducts should apply filters when provided

[Killed] ConditionalExpression
src/lib/services/products.service.ts:39:11
       if (filter.minPrice !== undefined) {
         params = params.set('minPrice', filter.minPrice.toString());
       }
-      if (filter.maxPrice !== undefined) {
+      if (false) {
         params = params.set('maxPrice', filter.maxPrice.toString());
       }
killedBy: ProductsService getProducts should apply filters when provided

[Killed] StringLiteral
src/lib/services/products.service.ts:40:29
         params = params.set('minPrice', filter.minPrice.toString());
       }
       if (filter.maxPrice !== undefined) {
-        params = params.set('maxPrice', filter.maxPrice.toString());
+        params = params.set("", filter.maxPrice.toString());
       }
       if (filter.inStock !== undefined) {
killedBy: ProductsService getProducts should apply filters when provided

[Killed] EqualityOperator
src/lib/services/products.service.ts:42:11
       if (filter.maxPrice !== undefined) {
         params = params.set('maxPrice', filter.maxPrice.toString());
       }
-      if (filter.inStock !== undefined) {
+      if (filter.inStock === undefined) {
         params = params.set('inStock', filter.inStock.toString());
       }
killedBy: ProductsService getProducts should apply filters when provided

[Killed] ConditionalExpression
src/lib/services/products.service.ts:42:11
       if (filter.maxPrice !== undefined) {
         params = params.set('maxPrice', filter.maxPrice.toString());
       }
-      if (filter.inStock !== undefined) {
+      if (false) {
         params = params.set('inStock', filter.inStock.toString());
       }
killedBy: ProductsService getProducts should apply filters when provided

[Killed] BlockStatement
src/lib/services/products.service.ts:45:30
       if (filter.inStock !== undefined) {
         params = params.set('inStock', filter.inStock.toString());
       }
-      if (filter.searchTerm) {
-        params = params.set('searchTerm', filter.searchTerm);
-      }
+      if (filter.searchTerm) {}
     }
 
killedBy: ProductsService getProducts should apply filters when provided

[Killed] BlockStatement
src/lib/services/products.service.ts:55:27
         params,
       })
       .pipe(
-        map((response) => {
-          this.loadingSignal.set(false);
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load products');
-          }
-          return response.data;
-        }),
+        map((response) => {}),
         catchError((error) => {
           this.loadingSignal.set(false);
killedBy: ProductsService loading and error signals should set loading to true when fetching products
statusReason: expected true to be falsy

[Killed] BooleanLiteral
src/lib/services/products.service.ts:56:34
       })
       .pipe(
         map((response) => {
-          this.loadingSignal.set(false);
+          this.loadingSignal.set(true);
           if (!response.success) {
             throw new Error(response.error || 'Failed to load products');
killedBy: ProductsService loading and error signals should set loading to true when fetching products
statusReason: expected true to be falsy

[Survived] BooleanLiteral
src/lib/services/products.service.ts:63:34
           return response.data;
         }),
         catchError((error) => {
-          this.loadingSignal.set(false);
+          this.loadingSignal.set(true);
           this.errorSignal.set(
             error.message || 'An error occurred while loading products'

[NoCoverage] StringLiteral
src/lib/services/products.service.ts:65:30
         catchError((error) => {
           this.loadingSignal.set(false);
           this.errorSignal.set(
-            error.message || 'An error occurred while loading products'
+            error.message || ""
           );
           console.error('Error loading products:', error);

[Killed] BlockStatement
src/lib/services/products.service.ts:79:58
       );
   }
 
-  getProductById(id: string): Observable<Product | null> {
-    this.loadingSignal.set(true);
-    this.errorSignal.set(null);
-
-    return this.http
-      .get<ApiResponse<Product>>(`${this.apiUrl}/products/${id}`)
-      .pipe(
-        map((response) => {
-          this.loadingSignal.set(false);
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load product');
-          }
-          return response.data;
-        }),
-        catchError((error) => {
-          this.loadingSignal.set(false);
-          this.errorSignal.set(
-            error.message || 'An error occurred while loading the product'
-          );
-          console.error('Error loading product:', error);
-          return of(null);
-        })
-      );
-  }
+  getProductById(id: string): Observable<Product | null> {}
 
   getCategories(): Observable<string[]> {
killedBy: ProductsService getProductById should return a product by id
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Survived] BooleanLiteral
src/lib/services/products.service.ts:80:28
   }
 
   getProductById(id: string): Observable<Product | null> {
-    this.loadingSignal.set(true);
+    this.loadingSignal.set(false);
     this.errorSignal.set(null);
 

[Survived] ConditionalExpression
src/lib/services/products.service.ts:88:15
       .pipe(
         map((response) => {
           this.loadingSignal.set(false);
-          if (!response.success) {
+          if (false) {
             throw new Error(response.error || 'Failed to load product');
           }

[NoCoverage] BlockStatement
src/lib/services/products.service.ts:88:34
       .pipe(
         map((response) => {
           this.loadingSignal.set(false);
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load product');
-          }
+          if (!response.success) {}
           return response.data;
         }),

[NoCoverage] ConditionalExpression
src/lib/services/products.service.ts:89:29
         map((response) => {
           this.loadingSignal.set(false);
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load product');
+            throw new Error(true);
           }
           return response.data;

[NoCoverage] ConditionalExpression
src/lib/services/products.service.ts:89:29
         map((response) => {
           this.loadingSignal.set(false);
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load product');
+            throw new Error(false);
           }
           return response.data;

[Survived] ConditionalExpression
src/lib/services/products.service.ts:96:13
         catchError((error) => {
           this.loadingSignal.set(false);
           this.errorSignal.set(
-            error.message || 'An error occurred while loading the product'
+            true
           );
           console.error('Error loading product:', error);

[Survived] LogicalOperator
src/lib/services/products.service.ts:96:13
         catchError((error) => {
           this.loadingSignal.set(false);
           this.errorSignal.set(
-            error.message || 'An error occurred while loading the product'
+            error.message && 'An error occurred while loading the product'
           );
           console.error('Error loading product:', error);

[Killed] BlockStatement
src/lib/services/products.service.ts:104:41
       );
   }
 
-  getCategories(): Observable<string[]> {
-    return this.http
-      .get<ApiResponse<string[]>>(`${this.apiUrl}/products-metadata/categories`)
-      .pipe(
-        map((response) => {
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load categories');
-          }
-          return response.data;
-        }),
-        catchError((error) => {
-          console.error('Error loading categories:', error);
-          return of([]);
-        })
-      );
-  }
+  getCategories(): Observable<string[]> {}
 
   getPriceRange(): Observable<{ min: number; max: number }> {
killedBy: ProductsService getCategories should return categories list
statusReason: Cannot read properties of undefined (reading 'subscribe')

[NoCoverage] BlockStatement
src/lib/services/products.service.ts:109:34
       .get<ApiResponse<string[]>>(`${this.apiUrl}/products-metadata/categories`)
       .pipe(
         map((response) => {
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load categories');
-          }
+          if (!response.success) {}
           return response.data;
         }),

[Survived] ConditionalExpression
src/lib/services/products.service.ts:109:15
       .get<ApiResponse<string[]>>(`${this.apiUrl}/products-metadata/categories`)
       .pipe(
         map((response) => {
-          if (!response.success) {
+          if (false) {
             throw new Error(response.error || 'Failed to load categories');
           }

[NoCoverage] LogicalOperator
src/lib/services/products.service.ts:110:29
       .pipe(
         map((response) => {
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load categories');
+            throw new Error(response.error && 'Failed to load categories');
           }
           return response.data;

[NoCoverage] ConditionalExpression
src/lib/services/products.service.ts:110:29
       .pipe(
         map((response) => {
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load categories');
+            throw new Error(false);
           }
           return response.data;

[Killed] BlockStatement
src/lib/services/products.service.ts:121:61
       );
   }
 
-  getPriceRange(): Observable<{ min: number; max: number }> {
-    return this.http
-      .get<ApiResponse<{ min: number; max: number }>>(
-        `${this.apiUrl}/products-metadata/price-range`
-      )
-      .pipe(
-        map((response) => {
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load price range');
-          }
-          return response.data;
-        }),
-        catchError((error) => {
-          console.error('Error loading price range:', error);
-          return of({ min: 0, max: 1000 });
-        })
-      );
-  }
+  getPriceRange(): Observable<{ min: number; max: number }> {}
 }
killedBy: ProductsService getPriceRange should return price range
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/lib/services/products.service.ts:124:9
   getPriceRange(): Observable<{ min: number; max: number }> {
     return this.http
       .get<ApiResponse<{ min: number; max: number }>>(
-        `${this.apiUrl}/products-metadata/price-range`
+        ``
       )
       .pipe(
killedBy: ProductsService getPriceRange should return price range
statusReason: Expected one matching request for criteria "Match URL: http://localhost:3333/api/products-metadata/price-range", found none. Requests received are: GET .

[NoCoverage] BlockStatement
src/lib/services/products.service.ts:128:34
       )
       .pipe(
         map((response) => {
-          if (!response.success) {
-            throw new Error(response.error || 'Failed to load price range');
-          }
+          if (!response.success) {}
           return response.data;
         }),

[NoCoverage] ConditionalExpression
src/lib/services/products.service.ts:129:29
       .pipe(
         map((response) => {
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load price range');
+            throw new Error(false);
           }
           return response.data;

[NoCoverage] LogicalOperator
src/lib/services/products.service.ts:129:29
       .pipe(
         map((response) => {
           if (!response.success) {
-            throw new Error(response.error || 'Failed to load price range');
+            throw new Error(response.error && 'Failed to load price range');
           }
           return response.data;
