[NoCoverage] ObjectLiteral
feature-product-detail/src/lib/feature-product-detail.routes.ts:5:3
 import { ProductDetailComponent } from './product-detail/product-detail.component';
 
 export const featureProductDetailRoutes: Routes = [
-  {
-    path: ':id',
-    component: ProductDetailComponent,
-  },
+  {},
 ];
