[Survived] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:332:29
 
   // State signals
   readonly product = signal<Product | null>(null);
-  readonly loading = signal(false);
+  readonly loading = signal(true);
   readonly error = signal<string | null>(null);
 

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:335:14
   readonly loading = signal(false);
   readonly error = signal<string | null>(null);
 
-  ngOnInit() {
-    this.loadProduct();
-  }
+  ngOnInit() {}
 
   loadProduct() {
killedBy: ProductDetailComponent should load product on init
statusReason: expected "vi.fn()" to be called with arguments: [ '1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/product-detail/product-detail.component.ts:342:9
   loadProduct() {
     const productId = this.route.snapshot.paramMap.get('id');
 
-    if (!productId) {
+    if (true) {
       this.error.set('Product ID not provided');
       return;
killedBy: ProductDetailComponent should load product on init
statusReason: expected "vi.fn()" to be called with arguments: [ '1' ]

Number of calls: 0

[Killed] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:342:9
   loadProduct() {
     const productId = this.route.snapshot.paramMap.get('id');
 
-    if (!productId) {
+    if (productId) {
       this.error.set('Product ID not provided');
       return;
killedBy: ProductDetailComponent should load product on init
statusReason: expected "vi.fn()" to be called with arguments: [ '1' ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/product-detail/product-detail.component.ts:350:62
     this.loading.set(true);
     this.error.set(null);
 
-    this.productsService.getProductById(productId).subscribe({
-      next: (product) => {
-        if (product) {
-          this.product.set(product);
-        } else {
-          this.error.set('Product not found');
-        }
-        this.loading.set(false);
-      },
-      error: (err) => {
-        this.error.set('Failed to load product details');
-        this.loading.set(false);
-        console.error('Error loading product:', err);
-      },
-    });
+    this.productsService.getProductById(productId).subscribe({});
   }
 
killedBy: ProductDetailComponent should load product on init
statusReason: expected null to deeply equal { id: '1', name: 'Test Product', …(7) }

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:351:26
     this.error.set(null);
 
     this.productsService.getProductById(productId).subscribe({
-      next: (product) => {
-        if (product) {
-          this.product.set(product);
-        } else {
-          this.error.set('Product not found');
-        }
-        this.loading.set(false);
-      },
+      next: (product) => {},
       error: (err) => {
         this.error.set('Failed to load product details');
killedBy: ProductDetailComponent should load product on init
statusReason: expected null to deeply equal { id: '1', name: 'Test Product', …(7) }

[Killed] ConditionalExpression
src/lib/product-detail/product-detail.component.ts:352:13
 
     this.productsService.getProductById(productId).subscribe({
       next: (product) => {
-        if (product) {
+        if (true) {
           this.product.set(product);
         } else {
killedBy: ProductDetailComponent should handle error when product not found
statusReason: expected null to be 'Product not found' // Object.is equality

[Killed] ConditionalExpression
src/lib/product-detail/product-detail.component.ts:352:13
 
     this.productsService.getProductById(productId).subscribe({
       next: (product) => {
-        if (product) {
+        if (false) {
           this.product.set(product);
         } else {
killedBy: ProductDetailComponent should load product on init
statusReason: expected null to deeply equal { id: '1', name: 'Test Product', …(7) }

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:354:16
       next: (product) => {
         if (product) {
           this.product.set(product);
-        } else {
-          this.error.set('Product not found');
-        }
+        } else {}
         this.loading.set(false);
       },
killedBy: ProductDetailComponent should handle error when product not found
statusReason: expected null to be 'Product not found' // Object.is equality

[Killed] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:357:26
         } else {
           this.error.set('Product not found');
         }
-        this.loading.set(false);
+        this.loading.set(true);
       },
       error: (err) => {
killedBy: ProductDetailComponent should load product on init
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:359:23
         }
         this.loading.set(false);
       },
-      error: (err) => {
-        this.error.set('Failed to load product details');
-        this.loading.set(false);
-        console.error('Error loading product:', err);
-      },
+      error: (err) => {},
     });
   }
killedBy: ProductDetailComponent should handle error when loading fails
statusReason: expected null to be 'Failed to load product details' // Object.is equality

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:367:25
     });
   }
 
-  getStars(): boolean[] {
-    const product = this.product();
-    if (!product) return [];
-
-    const rating = product.rating;
-    const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
-
-    return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
-      return false;
-    });
-  }
+  getStars(): boolean[] {}
 
   addToCart() {
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected undefined to deeply equal [ true, true, true, true, true ]

[Killed] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:369:9
 
   getStars(): boolean[] {
     const product = this.product();
-    if (!product) return [];
+    if (product) return [];
 
     const rating = product.rating;
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [] to deeply equal [ true, true, true, true, true ]

[Killed] ConditionalExpression
src/lib/product-detail/product-detail.component.ts:369:9
 
   getStars(): boolean[] {
     const product = this.product();
-    if (!product) return [];
+    if (true) return [];
 
     const rating = product.rating;
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [] to deeply equal [ true, true, true, true, true ]

[Killed] EqualityOperator
src/lib/product-detail/product-detail.component.ts:373:25
 
     const rating = product.rating;
     const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
+    const hasHalfStar = rating % 1 > 0.5;
 
     return Array(5).fill(false).map((_, index) => {
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ true, true, true, true, false ] to deeply equal [ true, true, true, true, true ]

[Killed] EqualityOperator
src/lib/product-detail/product-detail.component.ts:373:25
 
     const rating = product.rating;
     const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
+    const hasHalfStar = rating % 1 < 0.5;
 
     return Array(5).fill(false).map((_, index) => {
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ true, true, true, true, false ] to deeply equal [ true, true, true, true, true ]

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:375:51
     const fullStars = Math.floor(rating);
     const hasHalfStar = rating % 1 >= 0.5;
 
-    return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
-      return false;
-    });
+    return Array(5).fill(false).map((_, index) => {});
   }
 
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ true, true, true, true, true ]

[Survived] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:375:26
     const fullStars = Math.floor(rating);
     const hasHalfStar = rating % 1 >= 0.5;
 
-    return Array(5).fill(false).map((_, index) => {
+    return Array(5).fill(true).map((_, index) => {
       if (index < fullStars) return true;
       if (index === fullStars && hasHalfStar) return true;

[Killed] ConditionalExpression
src/lib/product-detail/product-detail.component.ts:376:11
     const hasHalfStar = rating % 1 >= 0.5;
 
     return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
+      if (false) return true;
       if (index === fullStars && hasHalfStar) return true;
       return false;
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ false, false, false, false, true ] to deeply equal [ true, true, true, true, true ]

[Killed] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:376:37
     const hasHalfStar = rating % 1 >= 0.5;
 
     return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
+      if (index < fullStars) return false;
       if (index === fullStars && hasHalfStar) return true;
       return false;
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ false, false, false, false, true ] to deeply equal [ true, true, true, true, true ]

[Killed] EqualityOperator
src/lib/product-detail/product-detail.component.ts:377:11
 
     return Array(5).fill(false).map((_, index) => {
       if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
+      if (index !== fullStars && hasHalfStar) return true;
       return false;
     });
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ true, true, true, true, false ] to deeply equal [ true, true, true, true, true ]

[Killed] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:377:54
 
     return Array(5).fill(false).map((_, index) => {
       if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
+      if (index === fullStars && hasHalfStar) return false;
       return false;
     });
killedBy: ProductDetailComponent should calculate star ratings correctly
statusReason: expected [ true, true, true, true, false ] to deeply equal [ true, true, true, true, true ]

[NoCoverage] BooleanLiteral
src/lib/product-detail/product-detail.component.ts:378:14
     return Array(5).fill(false).map((_, index) => {
       if (index < fullStars) return true;
       if (index === fullStars && hasHalfStar) return true;
-      return false;
+      return true;
     });
   }

[Killed] BlockStatement
src/lib/product-detail/product-detail.component.ts:382:15
     });
   }
 
-  addToCart() {
-    // This would typically call a cart service
-    console.log('Adding to cart:', this.product()?.id);
-    alert('Product added to cart!');
-  }
+  addToCart() {}
 
   addToWishlist() {
killedBy: ProductDetailComponent should handle add to cart action
statusReason: expected "log" to be called with arguments: [ 'Adding to cart:', '1' ]

Number of calls: 0

[Survived] OptionalChaining
src/lib/product-detail/product-detail.component.ts:384:36
 
   addToCart() {
     // This would typically call a cart service
-    console.log('Adding to cart:', this.product()?.id);
+    console.log('Adding to cart:', this.product().id);
     alert('Product added to cart!');
   }

[NoCoverage] BlockStatement
src/lib/product-detail/product-detail.component.ts:388:19
     alert('Product added to cart!');
   }
 
-  addToWishlist() {
-    // This would typically call a wishlist service
-    console.log('Adding to wishlist:', this.product()?.id);
-    alert('Product added to wishlist!');
-  }
+  addToWishlist() {}
 }

[NoCoverage] OptionalChaining
src/lib/product-detail/product-detail.component.ts:390:40
 
   addToWishlist() {
     // This would typically call a wishlist service
-    console.log('Adding to wishlist:', this.product()?.id);
+    console.log('Adding to wishlist:', this.product().id);
     alert('Product added to wishlist!');
   }
