[NoCoverage] ArrayDeclaration
feature-products/src/lib/feature-products.routes.ts:4:46
 import { Routes } from '@angular/router';
 import { ProductListComponent } from './product-list/product-list.component';
 
-export const featureProductsRoutes: Routes = [
-  {
-    path: '',
-    component: ProductListComponent,
-  },
-];
+export const featureProductsRoutes: Routes = [];

[NoCoverage] ObjectLiteral
feature-products/src/lib/feature-products.routes.ts:5:3
 import { ProductListComponent } from './product-list/product-list.component';
 
 export const featureProductsRoutes: Routes = [
-  {
-    path: '',
-    component: ProductListComponent,
-  },
+  {},
 ];
