[Survived] ArrayDeclaration
src/lib/product-list/product-list.component.ts:245:41
   private readonly router = inject(Router);
 
   // State signals
-  readonly products = signal<Product[]>([]);
+  readonly products = signal<Product[]>(["Stryker was here"]);
   readonly totalProducts = signal(0);
   readonly currentPage = signal(1);

[Survived] BooleanLiteral
src/lib/product-list/product-list.component.ts:250:29
   readonly currentPage = signal(1);
   readonly totalPages = signal(0);
   readonly categories = signal<string[]>([]);
-  readonly loading = signal(false);
+  readonly loading = signal(true);
   readonly error = signal<string | null>(null);
 

[Survived] BooleanLiteral
src/lib/product-list/product-list.component.ts:256:17
   // Filter state
   searchTerm = '';
   selectedCategory = '';
-  inStockOnly = false;
+  inStockOnly = true;
 
   // Computed values

[Survived] ArrowFunction
src/lib/product-list/product-list.component.ts:259:36
   inStockOnly = false;
 
   // Computed values
-  readonly hasMorePages = computed(() => this.totalPages() > 1);
+  readonly hasMorePages = computed(() => undefined);
 
   ngOnInit() {

[NoCoverage] ConditionalExpression
src/lib/product-list/product-list.component.ts:259:42
   inStockOnly = false;
 
   // Computed values
-  readonly hasMorePages = computed(() => this.totalPages() > 1);
+  readonly hasMorePages = computed(() => true);
 
   ngOnInit() {

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:261:14
   // Computed values
   readonly hasMorePages = computed(() => this.totalPages() > 1);
 
-  ngOnInit() {
-    this.loadCategories();
-    this.loadProducts();
-  }
+  ngOnInit() {}
 
   loadCategories() {
killedBy: ProductListComponent should load products and categories on init
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:266:20
     this.loadProducts();
   }
 
-  loadCategories() {
-    this.productsService.getCategories().subscribe({
-      next: (categories) => this.categories.set(categories),
-      error: (err) => console.error('Error loading categories:', err),
-    });
-  }
+  loadCategories() {}
 
   loadProducts() {
killedBy: ProductListComponent should load products and categories on init
statusReason: expected "vi.fn()" to be called at least once

[Survived] ArrowFunction
src/lib/product-list/product-list.component.ts:268:13
 
   loadCategories() {
     this.productsService.getCategories().subscribe({
-      next: (categories) => this.categories.set(categories),
+      next: () => undefined,
       error: (err) => console.error('Error loading categories:', err),
     });

[Survived] ArrowFunction
src/lib/product-list/product-list.component.ts:269:14
   loadCategories() {
     this.productsService.getCategories().subscribe({
       next: (categories) => this.categories.set(categories),
-      error: (err) => console.error('Error loading categories:', err),
+      error: () => undefined,
     });
   }

[NoCoverage] StringLiteral
src/lib/product-list/product-list.component.ts:269:37
   loadCategories() {
     this.productsService.getCategories().subscribe({
       next: (categories) => this.categories.set(categories),
-      error: (err) => console.error('Error loading categories:', err),
+      error: (err) => console.error("", err),
     });
   }

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:279:26
 
     const filter: ProductFilter = {};
 
-    if (this.searchTerm) {
-      filter.searchTerm = this.searchTerm;
-    }
+    if (this.searchTerm) {}
     if (this.selectedCategory) {
       filter.category = this.selectedCategory;
killedBy: ProductListComponent should apply filters when search term changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/product-list/product-list.component.ts:279:9
 
     const filter: ProductFilter = {};
 
-    if (this.searchTerm) {
+    if (false) {
       filter.searchTerm = this.searchTerm;
     }
killedBy: ProductListComponent should apply filters when search term changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/product-list/product-list.component.ts:282:9
     if (this.searchTerm) {
       filter.searchTerm = this.searchTerm;
     }
-    if (this.selectedCategory) {
+    if (false) {
       filter.category = this.selectedCategory;
     }
killedBy: ProductListComponent should apply filters when category changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:282:32
     if (this.searchTerm) {
       filter.searchTerm = this.searchTerm;
     }
-    if (this.selectedCategory) {
-      filter.category = this.selectedCategory;
-    }
+    if (this.selectedCategory) {}
     if (this.inStockOnly) {
       filter.inStock = true;
killedBy: ProductListComponent should apply filters when category changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[NoCoverage] BlockStatement
src/lib/product-list/product-list.component.ts:285:27
     if (this.selectedCategory) {
       filter.category = this.selectedCategory;
     }
-    if (this.inStockOnly) {
-      filter.inStock = true;
-    }
+    if (this.inStockOnly) {}
 
     this.productsService.getProducts(filter, this.currentPage(), 12).subscribe({

[Survived] ConditionalExpression
src/lib/product-list/product-list.component.ts:285:9
     if (this.selectedCategory) {
       filter.category = this.selectedCategory;
     }
-    if (this.inStockOnly) {
+    if (true) {
       filter.inStock = true;
     }

[NoCoverage] BooleanLiteral
src/lib/product-list/product-list.component.ts:286:24
       filter.category = this.selectedCategory;
     }
     if (this.inStockOnly) {
-      filter.inStock = true;
+      filter.inStock = false;
     }
 

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:290:27
     }
 
     this.productsService.getProducts(filter, this.currentPage(), 12).subscribe({
-      next: (response) => {
-        this.products.set(response.items);
-        this.totalProducts.set(response.total);
-        this.totalPages.set(response.totalPages);
-        this.loading.set(false);
-      },
+      next: (response) => {},
       error: (err) => {
         this.error.set('Failed to load products. Please try again.');
killedBy: ProductListComponent should load products and categories on init
statusReason: expected [] to deeply equal [ Array(2) ]

[Survived] BooleanLiteral
src/lib/product-list/product-list.component.ts:294:26
         this.products.set(response.items);
         this.totalProducts.set(response.total);
         this.totalPages.set(response.totalPages);
-        this.loading.set(false);
+        this.loading.set(true);
       },
       error: (err) => {

[NoCoverage] BlockStatement
src/lib/product-list/product-list.component.ts:296:23
         this.totalPages.set(response.totalPages);
         this.loading.set(false);
       },
-      error: (err) => {
-        this.error.set('Failed to load products. Please try again.');
-        this.loading.set(false);
-        console.error('Error loading products:', err);
-      },
+      error: (err) => {},
     });
   }

[NoCoverage] BooleanLiteral
src/lib/product-list/product-list.component.ts:298:26
       },
       error: (err) => {
         this.error.set('Failed to load products. Please try again.');
-        this.loading.set(false);
+        this.loading.set(true);
         console.error('Error loading products:', err);
       },

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:304:20
     });
   }
 
-  onSearchChange() {
-    this.currentPage.set(1);
-    this.loadProducts();
-  }
+  onSearchChange() {}
 
   onFilterChange() {
killedBy: ProductListComponent should apply filters when search term changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Number of calls: 0

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:309:20
     this.loadProducts();
   }
 
-  onFilterChange() {
-    this.currentPage.set(1);
-    this.loadProducts();
-  }
+  onFilterChange() {}
 
   onProductSelect(product: Product) {
killedBy: ProductListComponent should apply filters when category changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, 1, 12 ]

Number of calls: 0

[Killed] BlockStatement
src/lib/product-list/product-list.component.ts:314:37
     this.loadProducts();
   }
 
-  onProductSelect(product: Product) {
-    this.router.navigate(['/products', product.id]);
-  }
+  onProductSelect(product: Product) {}
 
   nextPage() {
killedBy: ProductListComponent should navigate to product detail when product is selected
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/products', '1' ] ]

Number of calls: 0

[NoCoverage] BlockStatement
src/lib/product-list/product-list.component.ts:318:14
     this.router.navigate(['/products', product.id]);
   }
 
-  nextPage() {
-    if (this.currentPage() < this.totalPages()) {
-      this.currentPage.update(page => page + 1);
-      this.loadProducts();
-    }
-  }
+  nextPage() {}
 
   previousPage() {

[NoCoverage] EqualityOperator
src/lib/product-list/product-list.component.ts:319:9
   }
 
   nextPage() {
-    if (this.currentPage() < this.totalPages()) {
+    if (this.currentPage() <= this.totalPages()) {
       this.currentPage.update(page => page + 1);
       this.loadProducts();

[NoCoverage] ConditionalExpression
src/lib/product-list/product-list.component.ts:319:9
   }
 
   nextPage() {
-    if (this.currentPage() < this.totalPages()) {
+    if (false) {
       this.currentPage.update(page => page + 1);
       this.loadProducts();

[NoCoverage] ArithmeticOperator
src/lib/product-list/product-list.component.ts:320:39
 
   nextPage() {
     if (this.currentPage() < this.totalPages()) {
-      this.currentPage.update(page => page + 1);
+      this.currentPage.update(page => page - 1);
       this.loadProducts();
     }

[NoCoverage] ArrowFunction
src/lib/product-list/product-list.component.ts:320:31
 
   nextPage() {
     if (this.currentPage() < this.totalPages()) {
-      this.currentPage.update(page => page + 1);
+      this.currentPage.update(() => undefined);
       this.loadProducts();
     }

[NoCoverage] BlockStatement
src/lib/product-list/product-list.component.ts:325:18
     }
   }
 
-  previousPage() {
-    if (this.currentPage() > 1) {
-      this.currentPage.update(page => page - 1);
-      this.loadProducts();
-    }
-  }
+  previousPage() {}
 }

[NoCoverage] ConditionalExpression
src/lib/product-list/product-list.component.ts:326:9
   }
 
   previousPage() {
-    if (this.currentPage() > 1) {
+    if (true) {
       this.currentPage.update(page => page - 1);
       this.loadProducts();

[NoCoverage] EqualityOperator
src/lib/product-list/product-list.component.ts:326:9
   }
 
   previousPage() {
-    if (this.currentPage() > 1) {
+    if (this.currentPage() >= 1) {
       this.currentPage.update(page => page - 1);
       this.loadProducts();

[NoCoverage] ArrowFunction
src/lib/product-list/product-list.component.ts:327:31
 
   previousPage() {
     if (this.currentPage() > 1) {
-      this.currentPage.update(page => page - 1);
+      this.currentPage.update(() => undefined);
       this.loadProducts();
     }

[NoCoverage] ArithmeticOperator
src/lib/product-list/product-list.component.ts:327:39
 
   previousPage() {
     if (this.currentPage() > 1) {
-      this.currentPage.update(page => page - 1);
+      this.currentPage.update(page => page + 1);
       this.loadProducts();
     }
