[Survived] ArrayDeclaration
src/lib/store/loyalty.store.ts:14:17
 const initialState: LoyaltyState = {
   pointsBalance: 0,
   lifetimePoints: 0,
-  transactions: [],
+  transactions: ["Stryker was here"],
   claimedVouchers: [],
 };

[Survived] ArrayDeclaration
src/lib/store/loyalty.store.ts:15:20
   pointsBalance: 0,
   lifetimePoints: 0,
   transactions: [],
-  claimedVouchers: [],
+  claimedVouchers: ["Stryker was here"],
 };
 

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:20:9
 
 const VOUCHER_CATALOG: LoyaltyVoucher[] = [
   {
-    id: 'v-3usd',
+    id: "",
     code: 'LOYAL3',
     title: '$3 Off Voucher',

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:21:11
 const VOUCHER_CATALOG: LoyaltyVoucher[] = [
   {
     id: 'v-3usd',
-    code: 'LOYAL3',
+    code: "",
     title: '$3 Off Voucher',
     pointsCost: 300,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:22:12
   {
     id: 'v-3usd',
     code: 'LOYAL3',
-    title: '$3 Off Voucher',
+    title: "",
     pointsCost: 300,
     discountValue: 3,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:25:19
     title: '$3 Off Voucher',
     pointsCost: 300,
     discountValue: 3,
-    discountType: 'FIXED',
+    discountType: "",
     minOrderAmount: 25,
   },

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:38:9
     minOrderAmount: 40,
   },
   {
-    id: 'v-10usd',
+    id: "",
     code: 'LOYAL10',
     title: '$10 Off Voucher',

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:39:11
   },
   {
     id: 'v-10usd',
-    code: 'LOYAL10',
+    code: "",
     title: '$10 Off Voucher',
     pointsCost: 1000,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:40:12
   {
     id: 'v-10usd',
     code: 'LOYAL10',
-    title: '$10 Off Voucher',
+    title: "",
     pointsCost: 1000,
     discountValue: 10,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:43:19
     title: '$10 Off Voucher',
     pointsCost: 1000,
     discountValue: 10,
-    discountType: 'FIXED',
+    discountType: "",
     minOrderAmount: 75,
   },

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:48:11
   },
   {
     id: 'v-15pct',
-    code: 'VIP15',
+    code: "",
     title: '15% Off VIP Voucher',
     pointsCost: 1500,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:52:19
     title: '15% Off VIP Voucher',
     pointsCost: 1500,
     discountValue: 15,
-    discountType: 'PERCENTAGE',
+    discountType: "",
     minOrderAmount: 100,
   },

[Survived] ObjectLiteral
src/lib/store/loyalty.store.ts:58:3
 ];
 
 export const LoyaltyStore = signalStore(
-  { providedIn: 'root' },
+  {},
   withState(initialState),
   withComputed((store) => {

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:58:17
 ];
 
 export const LoyaltyStore = signalStore(
-  { providedIn: 'root' },
+  { providedIn: "" },
   withState(initialState),
   withComputed((store) => {

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:61:44
   { providedIn: 'root' },
   withState(initialState),
   withComputed((store) => {
-    const currentTier = (): LoyaltyTier => {
-      const pts = store.lifetimePoints();
-      if (pts >= 7000) return 'PLATINUM';
-      if (pts >= 3000) return 'GOLD';
-      if (pts >= 1000) return 'SILVER';
-      return 'BRONZE';
-    };
+    const currentTier = (): LoyaltyTier => {};
 
     const tierMultiplier = () => {
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected undefined to be 'BRONZE' // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:63:11
   withComputed((store) => {
     const currentTier = (): LoyaltyTier => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 'PLATINUM';
+      if (pts > 7000) return 'PLATINUM';
       if (pts >= 3000) return 'GOLD';
       if (pts >= 1000) return 'SILVER';
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 'GOLD' to be 'PLATINUM' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:63:11
   withComputed((store) => {
     const currentTier = (): LoyaltyTier => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 'PLATINUM';
+      if (false) return 'PLATINUM';
       if (pts >= 3000) return 'GOLD';
       if (pts >= 1000) return 'SILVER';
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 'GOLD' to be 'PLATINUM' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:64:11
     const currentTier = (): LoyaltyTier => {
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 'PLATINUM';
-      if (pts >= 3000) return 'GOLD';
+      if (true) return 'GOLD';
       if (pts >= 1000) return 'SILVER';
       return 'BRONZE';
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 'GOLD' to be 'BRONZE' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:64:11
     const currentTier = (): LoyaltyTier => {
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 'PLATINUM';
-      if (pts >= 3000) return 'GOLD';
+      if (false) return 'GOLD';
       if (pts >= 1000) return 'SILVER';
       return 'BRONZE';
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 'SILVER' to be 'GOLD' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:65:11
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 'PLATINUM';
       if (pts >= 3000) return 'GOLD';
-      if (pts >= 1000) return 'SILVER';
+      if (true) return 'SILVER';
       return 'BRONZE';
     };
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 'SILVER' to be 'BRONZE' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:65:11
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 'PLATINUM';
       if (pts >= 3000) return 'GOLD';
-      if (pts >= 1000) return 'SILVER';
+      if (false) return 'SILVER';
       return 'BRONZE';
     };
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 'BRONZE' to be 'SILVER' // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:69:34
       return 'BRONZE';
     };
 
-    const tierMultiplier = () => {
-      const tier = currentTier();
-      switch (tier) {
-        case 'PLATINUM':
-          return 2.0;
-        case 'GOLD':
-          return 1.5;
-        case 'SILVER':
-          return 1.25;
-        case 'BRONZE':
-        default:
-          return 1.0;
-      }
-    };
+    const tierMultiplier = () => {};
 
     const pointsToNextTier = () => {
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:72:9
     const tierMultiplier = () => {
       const tier = currentTier();
       switch (tier) {
-        case 'PLATINUM':
-          return 2.0;
+        case 'PLATINUM':
         case 'GOLD':
           return 1.5;
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 1.5 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:74:9
       switch (tier) {
         case 'PLATINUM':
           return 2.0;
-        case 'GOLD':
-          return 1.5;
+        case 'GOLD':
         case 'SILVER':
           return 1.25;
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 1.25 to be 1.5 // Object.is equality

[Killed] StringLiteral
src/lib/store/loyalty.store.ts:74:14
       switch (tier) {
         case 'PLATINUM':
           return 2.0;
-        case 'GOLD':
+        case "":
           return 1.5;
         case 'SILVER':
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 1 to be 1.5 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:76:9
           return 2.0;
         case 'GOLD':
           return 1.5;
-        case 'SILVER':
-          return 1.25;
+        case 'SILVER':
         case 'BRONZE':
         default:
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 1 to be 1.25 // Object.is equality

[Killed] StringLiteral
src/lib/store/loyalty.store.ts:76:14
           return 2.0;
         case 'GOLD':
           return 1.5;
-        case 'SILVER':
+        case "":
           return 1.25;
         case 'BRONZE':
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 1 to be 1.25 // Object.is equality

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:78:14
           return 1.5;
         case 'SILVER':
           return 1.25;
-        case 'BRONZE':
+        case "":
         default:
           return 1.0;

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:79:9
         case 'SILVER':
           return 1.25;
         case 'BRONZE':
-        default:
-          return 1.0;
+        default:
       }
     };
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:84:36
       }
     };
 
-    const pointsToNextTier = () => {
-      const pts = store.lifetimePoints();
-      if (pts >= 7000) return 0;
-      if (pts >= 3000) return 7000 - pts;
-      if (pts >= 1000) return 3000 - pts;
-      return 1000 - pts;
-    };
+    const pointsToNextTier = () => {};
 
     const tierProgressPercentage = () => {
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected undefined to be 1000 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:86:11
 
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 0;
+      if (true) return 0;
       if (pts >= 3000) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:86:11
 
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 0;
+      if (pts < 7000) return 0;
       if (pts >= 3000) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:87:31
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 0;
-      if (pts >= 3000) return 7000 - pts;
+      if (pts >= 3000) return 7000 + pts;
       if (pts >= 1000) return 3000 - pts;
       return 1000 - pts;
killedBy: LoyaltyStore should upgrade through GOLD (3000 pts) and PLATINUM (7000 pts) tiers with exact boundaries
statusReason: expected 10000 to be 4000 // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:87:11
     const pointsToNextTier = () => {
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 0;
-      if (pts >= 3000) return 7000 - pts;
+      if (pts < 3000) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
       return 1000 - pts;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 7000 to be 1000 // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:88:11
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 0;
       if (pts >= 3000) return 7000 - pts;
-      if (pts >= 1000) return 3000 - pts;
+      if (pts > 1000) return 3000 - pts;
       return 1000 - pts;
     };
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected +0 to be 2000 // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:88:11
       const pts = store.lifetimePoints();
       if (pts >= 7000) return 0;
       if (pts >= 3000) return 7000 - pts;
-      if (pts >= 1000) return 3000 - pts;
+      if (pts < 1000) return 3000 - pts;
       return 1000 - pts;
     };
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 3000 to be 1000 // Object.is equality

[Survived] ArithmeticOperator
src/lib/store/loyalty.store.ts:89:14
       if (pts >= 7000) return 0;
       if (pts >= 3000) return 7000 - pts;
       if (pts >= 1000) return 3000 - pts;
-      return 1000 - pts;
+      return 1000 + pts;
     };
 

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:92:42
       return 1000 - pts;
     };
 
-    const tierProgressPercentage = () => {
-      const pts = store.lifetimePoints();
-      if (pts >= 7000) return 100;
-      let prevThreshold = 0;
-      let nextThreshold = 1000;
-
-      if (pts >= 3000) {
-        prevThreshold = 3000;
-        nextThreshold = 7000;
-      } else if (pts >= 1000) {
-        prevThreshold = 1000;
-        nextThreshold = 3000;
-      }
-
-      const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;
-      return +Math.min(100, Math.max(0, progress)).toFixed(1);
-    };
+    const tierProgressPercentage = () => {};
 
     const redeemableVouchers = () =>
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:94:11
 
     const tierProgressPercentage = () => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 100;
+      if (true) return 100;
       let prevThreshold = 0;
       let nextThreshold = 1000;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 100 to be +0 // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:94:11
 
     const tierProgressPercentage = () => {
       const pts = store.lifetimePoints();
-      if (pts >= 7000) return 100;
+      if (pts < 7000) return 100;
       let prevThreshold = 0;
       let nextThreshold = 1000;
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 100 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/lib/store/loyalty.store.ts:98:11
       let prevThreshold = 0;
       let nextThreshold = 1000;
 
-      if (pts >= 3000) {
+      if (true) {
         prevThreshold = 3000;
         nextThreshold = 7000;

[Survived] ConditionalExpression
src/lib/store/loyalty.store.ts:98:11
       let prevThreshold = 0;
       let nextThreshold = 1000;
 
-      if (pts >= 3000) {
+      if (false) {
         prevThreshold = 3000;
         nextThreshold = 7000;

[NoCoverage] BlockStatement
src/lib/store/loyalty.store.ts:101:31
       if (pts >= 3000) {
         prevThreshold = 3000;
         nextThreshold = 7000;
-      } else if (pts >= 1000) {
-        prevThreshold = 1000;
-        nextThreshold = 3000;
-      }
+      } else if (pts >= 1000) {}
 
       const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;

[Survived] ConditionalExpression
src/lib/store/loyalty.store.ts:101:18
       if (pts >= 3000) {
         prevThreshold = 3000;
         nextThreshold = 7000;
-      } else if (pts >= 1000) {
+      } else if (true) {
         prevThreshold = 1000;
         nextThreshold = 3000;

[Survived] ArithmeticOperator
src/lib/store/loyalty.store.ts:106:26
         nextThreshold = 3000;
       }
 
-      const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;
+      const progress = ((pts + prevThreshold) / (nextThreshold - prevThreshold)) * 100;
       return +Math.min(100, Math.max(0, progress)).toFixed(1);
     };

[Survived] ArithmeticOperator
src/lib/store/loyalty.store.ts:106:50
         nextThreshold = 3000;
       }
 
-      const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;
+      const progress = ((pts - prevThreshold) / (nextThreshold + prevThreshold)) * 100;
       return +Math.min(100, Math.max(0, progress)).toFixed(1);
     };

[Killed] MethodExpression
src/lib/store/loyalty.store.ts:107:15
       }
 
       const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;
-      return +Math.min(100, Math.max(0, progress)).toFixed(1);
+      return +Math.max(100, Math.max(0, progress)).toFixed(1);
     };
 
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected 100 to be +0 // Object.is equality

[Killed] UnaryOperator
src/lib/store/loyalty.store.ts:107:14
       }
 
       const progress = ((pts - prevThreshold) / (nextThreshold - prevThreshold)) * 100;
-      return +Math.min(100, Math.max(0, progress)).toFixed(1);
+      return -Math.min(100, Math.max(0, progress)).toFixed(1);
     };
 
killedBy: LoyaltyStore should initialize with default BRONZE tier and 0 points balance
statusReason: expected -0 to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/store/loyalty.store.ts:110:32
       return +Math.min(100, Math.max(0, progress)).toFixed(1);
     };
 
-    const redeemableVouchers = () =>
-      VOUCHER_CATALOG.filter((v) => v.pointsCost <= store.pointsBalance());
+    const redeemableVouchers = () => undefined;
 
     return {
killedBy: LoyaltyStore should list redeemable vouchers user has enough balance to redeem
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/lib/store/loyalty.store.ts:111:7
     };
 
     const redeemableVouchers = () =>
-      VOUCHER_CATALOG.filter((v) => v.pointsCost <= store.pointsBalance());
+      VOUCHER_CATALOG;
 
     return {
killedBy: LoyaltyStore should list redeemable vouchers user has enough balance to redeem
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/store/loyalty.store.ts:111:30
     };
 
     const redeemableVouchers = () =>
-      VOUCHER_CATALOG.filter((v) => v.pointsCost <= store.pointsBalance());
+      VOUCHER_CATALOG.filter(() => undefined);
 
     return {
killedBy: LoyaltyStore should list redeemable vouchers user has enough balance to redeem
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:122:48
     };
   }),
   withMethods((store) => ({
-    earnPointsForPurchase(amountSpent: number) {
-      const multiplier = store.tierMultiplier();
-      const earned = Math.floor(amountSpent * multiplier);
-      const newTx: LoyaltyTransaction = {
-        id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        type: 'EARNED',
-        points: earned,
-        description: `Earned ${earned} points for $${amountSpent} purchase`,
-        date: new Date().toISOString(),
-      };
-
-      patchState(store, {
-        pointsBalance: store.pointsBalance() + earned,
-        lifetimePoints: store.lifetimePoints() + earned,
-        transactions: [newTx, ...store.transactions()],
-      });
-    },
+    earnPointsForPurchase(amountSpent: number) {},
 
     addBonusPoints(points: number, reason: string) {
killedBy: LoyaltyStore should earn points for purchase using Bronze tier 1.0x multiplier
statusReason: expected +0 to be 150 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:124:33
   withMethods((store) => ({
     earnPointsForPurchase(amountSpent: number) {
       const multiplier = store.tierMultiplier();
-      const earned = Math.floor(amountSpent * multiplier);
+      const earned = Math.floor(amountSpent / multiplier);
       const newTx: LoyaltyTransaction = {
         id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 1160 to be 1250 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/loyalty.store.ts:125:41
     earnPointsForPurchase(amountSpent: number) {
       const multiplier = store.tierMultiplier();
       const earned = Math.floor(amountSpent * multiplier);
-      const newTx: LoyaltyTransaction = {
-        id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        type: 'EARNED',
-        points: earned,
-        description: `Earned ${earned} points for $${amountSpent} purchase`,
-        date: new Date().toISOString(),
-      };
+      const newTx: LoyaltyTransaction = {};
 
       patchState(store, {
killedBy: LoyaltyStore should earn points for purchase using Bronze tier 1.0x multiplier
statusReason: expected undefined to be 'EARNED' // Object.is equality

[Survived] ArithmeticOperator
src/lib/store/loyalty.store.ts:126:44
       const multiplier = store.tierMultiplier();
       const earned = Math.floor(amountSpent * multiplier);
       const newTx: LoyaltyTransaction = {
-        id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
+        id: `tx-${Date.now()}-${Math.floor(Math.random() / 1000)}`,
         type: 'EARNED',
         points: earned,

[Killed] StringLiteral
src/lib/store/loyalty.store.ts:127:15
       const earned = Math.floor(amountSpent * multiplier);
       const newTx: LoyaltyTransaction = {
         id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        type: 'EARNED',
+        type: "",
         points: earned,
         description: `Earned ${earned} points for $${amountSpent} purchase`,
killedBy: LoyaltyStore should earn points for purchase using Bronze tier 1.0x multiplier
statusReason: expected '' to be 'EARNED' // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:134:24
       };
 
       patchState(store, {
-        pointsBalance: store.pointsBalance() + earned,
+        pointsBalance: store.pointsBalance() - earned,
         lifetimePoints: store.lifetimePoints() + earned,
         transactions: [newTx, ...store.transactions()],
killedBy: LoyaltyStore should earn points for purchase using Bronze tier 1.0x multiplier
statusReason: expected -150 to be 150 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:135:25
 
       patchState(store, {
         pointsBalance: store.pointsBalance() + earned,
-        lifetimePoints: store.lifetimePoints() + earned,
+        lifetimePoints: store.lifetimePoints() - earned,
         transactions: [newTx, ...store.transactions()],
       });
killedBy: LoyaltyStore should earn points for purchase using Bronze tier 1.0x multiplier
statusReason: expected -150 to be 150 // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:140:52
       });
     },
 
-    addBonusPoints(points: number, reason: string) {
-      const newTx: LoyaltyTransaction = {
-        id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        type: 'BONUS',
-        points,
-        description: reason,
-        date: new Date().toISOString(),
-      };
-
-      patchState(store, {
-        pointsBalance: store.pointsBalance() + points,
-        lifetimePoints: store.lifetimePoints() + points,
-        transactions: [newTx, ...store.transactions()],
-      });
-    },
+    addBonusPoints(points: number, reason: string) {},
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 'BRONZE' to be 'SILVER' // Object.is equality

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:142:13
 
     addBonusPoints(points: number, reason: string) {
       const newTx: LoyaltyTransaction = {
-        id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
+        id: ``,
         type: 'BONUS',
         points,

[Survived] StringLiteral
src/lib/store/loyalty.store.ts:143:15
     addBonusPoints(points: number, reason: string) {
       const newTx: LoyaltyTransaction = {
         id: `tx-${Date.now()}-${Math.floor(Math.random() * 1000)}`,
-        type: 'BONUS',
+        type: "",
         points,
         description: reason,

[Killed] ObjectLiteral
src/lib/store/loyalty.store.ts:149:25
         date: new Date().toISOString(),
       };
 
-      patchState(store, {
-        pointsBalance: store.pointsBalance() + points,
-        lifetimePoints: store.lifetimePoints() + points,
-        transactions: [newTx, ...store.transactions()],
-      });
+      patchState(store, {});
     },
 
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 'BRONZE' to be 'SILVER' // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:150:24
       };
 
       patchState(store, {
-        pointsBalance: store.pointsBalance() + points,
+        pointsBalance: store.pointsBalance() - points,
         lifetimePoints: store.lifetimePoints() + points,
         transactions: [newTx, ...store.transactions()],
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected -750 to be 1250 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:151:25
 
       patchState(store, {
         pointsBalance: store.pointsBalance() + points,
-        lifetimePoints: store.lifetimePoints() + points,
+        lifetimePoints: store.lifetimePoints() - points,
         transactions: [newTx, ...store.transactions()],
       });
killedBy: LoyaltyStore should automatically upgrade to SILVER tier at 1000 lifetime points and apply 1.25x multiplier
statusReason: expected 'BRONZE' to be 'SILVER' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:157:51
     },
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
-      const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
+      const voucher = VOUCHER_CATALOG.find((v) => true);
       if (!voucher) {
         return { success: false, message: 'Voucher not found' };
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected 300 to be 100 // Object.is equality

[Killed] ArrowFunction
src/lib/store/loyalty.store.ts:157:44
     },
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
-      const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
+      const voucher = VOUCHER_CATALOG.find(() => undefined);
       if (!voucher) {
         return { success: false, message: 'Voucher not found' };
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:158:21
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
       const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
-      if (!voucher) {
-        return { success: false, message: 'Voucher not found' };
-      }
+      if (!voucher) {}
       if (store.pointsBalance() < voucher.pointsCost) {
         return { success: false, message: 'Insufficient points balance' };
killedBy: LoyaltyStore should return error when attempting to redeem invalid voucherId
statusReason: Cannot read properties of undefined (reading 'pointsCost')

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:158:11
 
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
       const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
-      if (!voucher) {
+      if (false) {
         return { success: false, message: 'Voucher not found' };
       }
killedBy: LoyaltyStore should return error when attempting to redeem invalid voucherId
statusReason: Cannot read properties of undefined (reading 'pointsCost')

[Killed] BooleanLiteral
src/lib/store/loyalty.store.ts:159:27
     redeemVoucher(voucherId: string): { success: boolean; message?: string; voucher?: LoyaltyVoucher } {
       const voucher = VOUCHER_CATALOG.find((v) => v.id === voucherId);
       if (!voucher) {
-        return { success: false, message: 'Voucher not found' };
+        return { success: true, message: 'Voucher not found' };
       }
       if (store.pointsBalance() < voucher.pointsCost) {
killedBy: LoyaltyStore should return error when attempting to redeem invalid voucherId
statusReason: expected true to be false // Object.is equality
