[Killed] BlockStatement
src/lib/store/loyalty.store.ts:161:55
       if (!voucher) {
         return { success: false, message: 'Voucher not found' };
       }
-      if (store.pointsBalance() < voucher.pointsCost) {
-        return { success: false, message: 'Insufficient points balance' };
-      }
+      if (store.pointsBalance() < voucher.pointsCost) {}
 
       const uniqueCode = `${voucher.code}-${Math.floor(Math.random() * 10000)}`;
killedBy: LoyaltyStore should fail voucher redemption if points balance is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:161:11
       if (!voucher) {
         return { success: false, message: 'Voucher not found' };
       }
-      if (store.pointsBalance() < voucher.pointsCost) {
+      if (true) {
         return { success: false, message: 'Insufficient points balance' };
       }
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/loyalty.store.ts:162:27
         return { success: false, message: 'Voucher not found' };
       }
       if (store.pointsBalance() < voucher.pointsCost) {
-        return { success: false, message: 'Insufficient points balance' };
+        return { success: true, message: 'Insufficient points balance' };
       }
 
killedBy: LoyaltyStore should fail voucher redemption if points balance is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/store/loyalty.store.ts:162:16
         return { success: false, message: 'Voucher not found' };
       }
       if (store.pointsBalance() < voucher.pointsCost) {
-        return { success: false, message: 'Insufficient points balance' };
+        return {};
       }
 
killedBy: LoyaltyStore should fail voucher redemption if points balance is insufficient
statusReason: expected undefined to be false // Object.is equality

[Survived] ArithmeticOperator
src/lib/store/loyalty.store.ts:165:56
         return { success: false, message: 'Insufficient points balance' };
       }
 
-      const uniqueCode = `${voucher.code}-${Math.floor(Math.random() * 10000)}`;
+      const uniqueCode = `${voucher.code}-${Math.floor(Math.random() / 10000)}`;
       const claimed: LoyaltyVoucher = {
         ...voucher,

[Survived] BooleanLiteral
src/lib/store/loyalty.store.ts:169:21
       const claimed: LoyaltyVoucher = {
         ...voucher,
         code: uniqueCode,
-        isRedeemed: false,
+        isRedeemed: true,
       };
 

[Killed] ArithmeticOperator
src/lib/store/loyalty.store.ts:181:24
       };
 
       patchState(store, {
-        pointsBalance: store.pointsBalance() - voucher.pointsCost,
+        pointsBalance: store.pointsBalance() + voucher.pointsCost,
         claimedVouchers: [...store.claimedVouchers(), claimed],
         transactions: [newTx, ...store.transactions()],
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected 1100 to be 100 // Object.is equality

[Killed] ArrayDeclaration
src/lib/store/loyalty.store.ts:182:26
 
       patchState(store, {
         pointsBalance: store.pointsBalance() - voucher.pointsCost,
-        claimedVouchers: [...store.claimedVouchers(), claimed],
+        claimedVouchers: [],
         transactions: [newTx, ...store.transactions()],
       });
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/loyalty.store.ts:186:25
         transactions: [newTx, ...store.transactions()],
       });
 
-      return { success: true, voucher: claimed };
+      return { success: false, voucher: claimed };
     },
 
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/store/loyalty.store.ts:186:14
         transactions: [newTx, ...store.transactions()],
       });
 
-      return { success: true, voucher: claimed };
+      return {};
     },
 
killedBy: LoyaltyStore should redeem voucher, deduct points, record REDEEMED transaction, and return coupon voucher
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:189:37
       return { success: true, voucher: claimed };
     },
 
-    markVoucherAsUsed(code: string) {
-      const updated = store.claimedVouchers().map((v) => {
-        if (v.code === code) {
-          return { ...v, isRedeemed: true };
-        }
-        return v;
-      });
-      patchState(store, { claimedVouchers: updated });
-    },
+    markVoucherAsUsed(code: string) {},
   }))
 );
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/loyalty.store.ts:190:58
     },
 
     markVoucherAsUsed(code: string) {
-      const updated = store.claimedVouchers().map((v) => {
-        if (v.code === code) {
-          return { ...v, isRedeemed: true };
-        }
-        return v;
-      });
+      const updated = store.claimedVouchers().map((v) => {});
       patchState(store, { claimedVouchers: updated });
     },
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: Cannot read properties of undefined (reading 'isRedeemed')

[Killed] ConditionalExpression
src/lib/store/loyalty.store.ts:191:13
 
     markVoucherAsUsed(code: string) {
       const updated = store.claimedVouchers().map((v) => {
-        if (v.code === code) {
+        if (false) {
           return { ...v, isRedeemed: true };
         }
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/store/loyalty.store.ts:191:13
 
     markVoucherAsUsed(code: string) {
       const updated = store.claimedVouchers().map((v) => {
-        if (v.code === code) {
+        if (v.code !== code) {
           return { ...v, isRedeemed: true };
         }
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/store/loyalty.store.ts:192:38
     markVoucherAsUsed(code: string) {
       const updated = store.claimedVouchers().map((v) => {
         if (v.code === code) {
-          return { ...v, isRedeemed: true };
+          return { ...v, isRedeemed: false };
         }
         return v;
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/store/loyalty.store.ts:196:25
         }
         return v;
       });
-      patchState(store, { claimedVouchers: updated });
+      patchState(store, {});
     },
   }))
killedBy: LoyaltyStore should mark voucher as used when markVoucherAsUsed is called
statusReason: expected false to be true // Object.is equality
