[NoCoverage] ArrowFunction
packages/shop/loyalty/vite.config.mts:6:29
 import angular from '@analogjs/vite-plugin-angular';
 import tsconfigPaths from 'vite-tsconfig-paths';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/loyalty',
-  plugins: [angular(), tsconfigPaths()],
-  test: {
-    name: 'loyalty',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/loyalty',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] StringLiteral
packages/shop/loyalty/vite.config.mts:8:13
 
 export default defineConfig(() => ({
   root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/loyalty',
+  cacheDir: "",
   plugins: [angular(), tsconfigPaths()],
   test: {

[NoCoverage] StringLiteral
packages/shop/loyalty/vite.config.mts:11:11
   cacheDir: '../../../node_modules/.vite/packages/shop/loyalty',
   plugins: [angular(), tsconfigPaths()],
   test: {
-    name: 'loyalty',
+    name: "",
     watch: false,
     globals: true,

[NoCoverage] BooleanLiteral
packages/shop/loyalty/vite.config.mts:12:12
   plugins: [angular(), tsconfigPaths()],
   test: {
     name: 'loyalty',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'jsdom',

[NoCoverage] StringLiteral
packages/shop/loyalty/vite.config.mts:19:25
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],
     coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/loyalty',
+      reportsDirectory: "",
       provider: 'v8' as const,
     },
