[NoCoverage] ArrowFunction
packages/shop/search-filter/vite.config.mts:6:29
 import angular from '@analogjs/vite-plugin-angular';
 import tsconfigPaths from 'vite-tsconfig-paths';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/search-filter',
-  plugins: [angular(), tsconfigPaths()],
-  test: {
-    name: 'search-filter',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/search-filter',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] ObjectLiteral
packages/shop/search-filter/vite.config.mts:6:36
 import angular from '@analogjs/vite-plugin-angular';
 import tsconfigPaths from 'vite-tsconfig-paths';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/search-filter',
-  plugins: [angular(), tsconfigPaths()],
-  test: {
-    name: 'search-filter',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/search-filter',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => ({}));
 

[NoCoverage] BooleanLiteral
packages/shop/search-filter/vite.config.mts:12:12
   plugins: [angular(), tsconfigPaths()],
   test: {
     name: 'search-filter',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'jsdom',
