[NoCoverage] ObjectLiteral
packages/shop/shared-ui/eslint.config.mjs:10:12
   ...nx.configs['flat/angular-template'],
   {
     files: ['**/*.ts'],
-    rules: {
-      '@angular-eslint/directive-selector': [
-        'error',
-        {
-          type: 'attribute',
-          prefix: 'shop',
-          style: 'camelCase',
-        },
-      ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'shop',
-          style: 'kebab-case',
-        },
-      ],
-    },
+    rules: {},
   },
   {

[NoCoverage] ArrayDeclaration
packages/shop/shared-ui/eslint.config.mjs:19:45
           style: 'camelCase',
         },
       ],
-      '@angular-eslint/component-selector': [
-        'error',
-        {
-          type: 'element',
-          prefix: 'shop',
-          style: 'kebab-case',
-        },
-      ],
+      '@angular-eslint/component-selector': [],
     },
   },

[NoCoverage] StringLiteral
packages/shop/shared-ui/eslint.config.mjs:22:17
       '@angular-eslint/component-selector': [
         'error',
         {
-          type: 'element',
+          type: "",
           prefix: 'shop',
           style: 'kebab-case',

[NoCoverage] StringLiteral
packages/shop/shared-ui/eslint.config.mjs:23:19
         'error',
         {
           type: 'element',
-          prefix: 'shop',
+          prefix: "",
           style: 'kebab-case',
         },
