[NoCoverage] BooleanLiteral
src/lib/error-message/error-message.component.ts:70:30
 export class ErrorMessageComponent {
   readonly title = input<string>();
   readonly message = input<string>();
-  readonly showRetry = input(true);
+  readonly showRetry = input(false);
   readonly retry = output<void>();
 }
