[NoCoverage] ArrowFunction
packages/shop/shared-ui/vite.config.mts:7:29
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/shared-ui',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  // Uncomment this if you are using workers.
-  // worker: {
-  //  plugins: [ nxViteTsPaths() ],
-  // },
-  test: {
-    name: 'shared-ui',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/shared-ui',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => undefined);
 

[NoCoverage] ObjectLiteral
packages/shop/shared-ui/vite.config.mts:7:36
 import tsconfigPaths from 'vite-tsconfig-paths';
 import { nxCopyAssetsPlugin } from '@nx/vite/plugins/nx-copy-assets.plugin';
 
-export default defineConfig(() => ({
-  root: __dirname,
-  cacheDir: '../../../node_modules/.vite/packages/shop/shared-ui',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
-  // Uncomment this if you are using workers.
-  // worker: {
-  //  plugins: [ nxViteTsPaths() ],
-  // },
-  test: {
-    name: 'shared-ui',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/shared-ui',
-      provider: 'v8' as const,
-    },
-  },
-}));
+export default defineConfig(() => ({}));
 

[NoCoverage] ArrayDeclaration
packages/shop/shared-ui/vite.config.mts:10:12
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/shop/shared-ui',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [],
   // Uncomment this if you are using workers.
   // worker: {

[NoCoverage] ArrayDeclaration
packages/shop/shared-ui/vite.config.mts:10:60
 export default defineConfig(() => ({
   root: __dirname,
   cacheDir: '../../../node_modules/.vite/packages/shop/shared-ui',
-  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin(['*.md'])],
+  plugins: [angular(), tsconfigPaths(), nxCopyAssetsPlugin([])],
   // Uncomment this if you are using workers.
   // worker: {

[NoCoverage] ObjectLiteral
packages/shop/shared-ui/vite.config.mts:15:9
   // worker: {
   //  plugins: [ nxViteTsPaths() ],
   // },
-  test: {
-    name: 'shared-ui',
-    watch: false,
-    globals: true,
-    environment: 'jsdom',
-    include: ['{src,tests}/**/*.{test,spec}.{js,mjs,cjs,ts,mts,cts,jsx,tsx}'],
-    setupFiles: [`${__dirname}/src/test-setup.ts`],
-    reporters: ['default'],
-    coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/shared-ui',
-      provider: 'v8' as const,
-    },
-  },
+  test: {},
 }));
 

[NoCoverage] BooleanLiteral
packages/shop/shared-ui/vite.config.mts:17:12
   // },
   test: {
     name: 'shared-ui',
-    watch: false,
+    watch: true,
     globals: true,
     environment: 'jsdom',

[NoCoverage] StringLiteral
packages/shop/shared-ui/vite.config.mts:24:25
     setupFiles: [`${__dirname}/src/test-setup.ts`],
     reporters: ['default'],
     coverage: {
-      reportsDirectory: '../../../coverage/packages/shop/shared-ui',
+      reportsDirectory: "",
       provider: 'v8' as const,
     },
