[Killed] BlockStatement
src/lib/search-filter-bar/search-filter-bar.component.ts:39:31
 export class SearchFilterBarComponent {
   readonly store = inject(SearchFilterStore);
 
-  onSearchInput(event: Event) {
-    const val = (event.target as HTMLInputElement).value;
-    this.store.updateSearchTerm(val);
-  }
+  onSearchInput(event: Event) {}
 }
 
killedBy: SearchFilterBarComponent should update search term when input value changes
statusReason: expected '' to be 'Headphones' // Object.is equality
