[Survived] ArrayDeclaration
src/lib/store/search-filter.store.ts:14:15
 
 const initialFilterState: FilterState = {
   searchTerm: '',
-  categories: [],
+  categories: ["Stryker was here"],
   minPrice: 0,
   maxPrice: 10000,

[Survived] BooleanLiteral
src/lib/store/search-filter.store.ts:18:16
   minPrice: 0,
   maxPrice: 10000,
   minRating: 0,
-  inStockOnly: false,
+  inStockOnly: true,
   selectedTags: [],
 };

[Survived] ObjectLiteral
src/lib/store/search-filter.store.ts:22:41
   selectedTags: [],
 };
 
-const initialState: SearchFilterState = {
-  allProducts: [],
-  filterState: initialFilterState,
-  sortOption: 'name_asc',
-  currentPage: 1,
-  pageSize: 10,
-};
+const initialState: SearchFilterState = {};
 
 export const SearchFilterStore = signalStore(

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:39:25
         store.filterState();
 
       return store.allProducts().filter((p) => {
-        if (searchTerm) {
-          const term = searchTerm.toLowerCase();
-          const matchName = p.name.toLowerCase().includes(term);
-          const matchDesc = p.description.toLowerCase().includes(term);
-          if (!matchName && !matchDesc) return false;
-        }
+        if (searchTerm) {}
 
         if (categories.length > 0 && !categories.includes(p.category)) {
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:39:13
         store.filterState();
 
       return store.allProducts().filter((p) => {
-        if (searchTerm) {
+        if (false) {
           const term = searchTerm.toLowerCase();
           const matchName = p.name.toLowerCase().includes(term);
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:40:24
 
       return store.allProducts().filter((p) => {
         if (searchTerm) {
-          const term = searchTerm.toLowerCase();
+          const term = searchTerm.toUpperCase();
           const matchName = p.name.toLowerCase().includes(term);
           const matchDesc = p.description.toLowerCase().includes(term);
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
src/lib/store/search-filter.store.ts:41:29
       return store.allProducts().filter((p) => {
         if (searchTerm) {
           const term = searchTerm.toLowerCase();
-          const matchName = p.name.toLowerCase().includes(term);
+          const matchName = p.name.toUpperCase().includes(term);
           const matchDesc = p.description.toLowerCase().includes(term);
           if (!matchName && !matchDesc) return false;

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:42:29
         if (searchTerm) {
           const term = searchTerm.toLowerCase();
           const matchName = p.name.toLowerCase().includes(term);
-          const matchDesc = p.description.toLowerCase().includes(term);
+          const matchDesc = p.description.toUpperCase().includes(term);
           if (!matchName && !matchDesc) return false;
         }
killedBy: SearchFilterStore should filter products by search term matching description when name does not match
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:43:48
           const term = searchTerm.toLowerCase();
           const matchName = p.name.toLowerCase().includes(term);
           const matchDesc = p.description.toLowerCase().includes(term);
-          if (!matchName && !matchDesc) return false;
+          if (!matchName && !matchDesc) return true;
         }
 
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:43:15
           const term = searchTerm.toLowerCase();
           const matchName = p.name.toLowerCase().includes(term);
           const matchDesc = p.description.toLowerCase().includes(term);
-          if (!matchName && !matchDesc) return false;
+          if (false) return false;
         }
 
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:46:38
           if (!matchName && !matchDesc) return false;
         }
 
-        if (categories.length > 0 && !categories.includes(p.category)) {
+        if (categories.length > 0 && categories.includes(p.category)) {
           return false;
         }
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected 4 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/store/search-filter.store.ts:46:13
           if (!matchName && !matchDesc) return false;
         }
 
-        if (categories.length > 0 && !categories.includes(p.category)) {
+        if (categories.length > 0 || !categories.includes(p.category)) {
           return false;
         }
killedBy: SearchFilterStore should initialize with all products
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:47:18
         }
 
         if (categories.length > 0 && !categories.includes(p.category)) {
-          return false;
+          return true;
         }
 
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected 5 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/store/search-filter.store.ts:50:13
           return false;
         }
 
-        if (p.price < minPrice || p.price > maxPrice) {
+        if (p.price < minPrice && p.price > maxPrice) {
           return false;
         }
killedBy: SearchFilterStore should filter products by exact price boundaries
statusReason: expected 5 to be 2 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:50:13
           return false;
         }
 
-        if (p.price < minPrice || p.price > maxPrice) {
+        if (p.price <= minPrice || p.price > maxPrice) {
           return false;
         }
killedBy: SearchFilterStore should filter products by exact price boundaries
statusReason: expected 4 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:51:18
         }
 
         if (p.price < minPrice || p.price > maxPrice) {
-          return false;
+          return true;
         }
 
killedBy: SearchFilterStore should filter products by exact price boundaries
statusReason: expected 5 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:54:13
           return false;
         }
 
-        if (p.rating < minRating) {
+        if (true) {
           return false;
         }
killedBy: SearchFilterStore should initialize with all products
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:54:35
           return false;
         }
 
-        if (p.rating < minRating) {
-          return false;
-        }
+        if (p.rating < minRating) {}
 
         if (inStockOnly && !p.inStock) {
killedBy: SearchFilterStore should filter products by minimum rating
statusReason: expected 5 to be 3 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:55:18
         }
 
         if (p.rating < minRating) {
-          return false;
+          return true;
         }
 
killedBy: SearchFilterStore should filter products by minimum rating
statusReason: expected 5 to be 3 // Object.is equality

[Killed] LogicalOperator
src/lib/store/search-filter.store.ts:58:13
           return false;
         }
 
-        if (inStockOnly && !p.inStock) {
+        if (inStockOnly || !p.inStock) {
           return false;
         }
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:58:13
           return false;
         }
 
-        if (inStockOnly && !p.inStock) {
+        if (false) {
           return false;
         }
killedBy: SearchFilterStore should filter in-stock products only
statusReason: expected 5 to be 4 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:59:18
         }
 
         if (inStockOnly && !p.inStock) {
-          return false;
+          return true;
         }
 
killedBy: SearchFilterStore should filter in-stock products only
statusReason: expected 5 to be 4 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:66:34
       });
     };
 
-    const sortedProducts = () => {
-      const list = [...filteredProducts()];
-      const opt = store.sortOption();
-
-      switch (opt) {
-        case 'price_asc':
-          return list.sort((a, b) => a.price - b.price);
-        case 'price_desc':
-          return list.sort((a, b) => b.price - a.price);
-        case 'rating_desc':
-          return list.sort((a, b) => b.rating - a.rating);
-        case 'name_asc':
-        default:
-          return list.sort((a, b) => a.name.localeCompare(b.name));
-      }
-    };
+    const sortedProducts = () => {};
 
     const totalPages = () =>
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:71:9
       const opt = store.sortOption();
 
       switch (opt) {
-        case 'price_asc':
-          return list.sort((a, b) => a.price - b.price);
+        case 'price_asc':
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:72:18
 
       switch (opt) {
         case 'price_asc':
-          return list.sort((a, b) => a.price - b.price);
+          return list;
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:72:28
 
       switch (opt) {
         case 'price_asc':
-          return list.sort((a, b) => a.price - b.price);
+          return list.sort(() => undefined);
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:73:9
       switch (opt) {
         case 'price_asc':
           return list.sort((a, b) => a.price - b.price);
-        case 'price_desc':
-          return list.sort((a, b) => b.price - a.price);
+        case 'price_desc':
         case 'rating_desc':
           return list.sort((a, b) => b.rating - a.rating);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:74:18
         case 'price_asc':
           return list.sort((a, b) => a.price - b.price);
         case 'price_desc':
-          return list.sort((a, b) => b.price - a.price);
+          return list;
         case 'rating_desc':
           return list.sort((a, b) => b.rating - a.rating);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:74:28
         case 'price_asc':
           return list.sort((a, b) => a.price - b.price);
         case 'price_desc':
-          return list.sort((a, b) => b.price - a.price);
+          return list.sort(() => undefined);
         case 'rating_desc':
           return list.sort((a, b) => b.rating - a.rating);
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:75:9
           return list.sort((a, b) => a.price - b.price);
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
-        case 'rating_desc':
-          return list.sort((a, b) => b.rating - a.rating);
+        case 'rating_desc':
         case 'name_asc':
         default:
killedBy: SearchFilterStore should sort products by rating descending
statusReason: expected [ 4.9, 4.6, 4.7, 4.2, 4.8 ] to deeply equal [ 4.9, 4.8, 4.7, 4.6, 4.2 ]

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:76:18
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
         case 'rating_desc':
-          return list.sort((a, b) => b.rating - a.rating);
+          return list;
         case 'name_asc':
         default:
killedBy: SearchFilterStore should sort products by rating descending
statusReason: expected [ 4.8, 4.6, 4.9, 4.2, 4.7 ] to deeply equal [ 4.9, 4.8, 4.7, 4.6, 4.2 ]

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:76:28
         case 'price_desc':
           return list.sort((a, b) => b.price - a.price);
         case 'rating_desc':
-          return list.sort((a, b) => b.rating - a.rating);
+          return list.sort(() => undefined);
         case 'name_asc':
         default:
killedBy: SearchFilterStore should sort products by rating descending
statusReason: expected [ 4.8, 4.6, 4.9, 4.2, 4.7 ] to deeply equal [ 4.9, 4.8, 4.7, 4.6, 4.2 ]

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:78:9
         case 'rating_desc':
           return list.sort((a, b) => b.rating - a.rating);
         case 'name_asc':
-        default:
-          return list.sort((a, b) => a.name.localeCompare(b.name));
+        default:
       }
     };
killedBy: SearchFilterStore should paginate results properly
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:79:28
           return list.sort((a, b) => b.rating - a.rating);
         case 'name_asc':
         default:
-          return list.sort((a, b) => a.name.localeCompare(b.name));
+          return list.sort(() => undefined);
       }
     };
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 'p1' to be 'p3' // Object.is equality

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:79:18
           return list.sort((a, b) => b.rating - a.rating);
         case 'name_asc':
         default:
-          return list.sort((a, b) => a.name.localeCompare(b.name));
+          return list;
       }
     };
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 'p1' to be 'p3' // Object.is equality

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:83:24
       }
     };
 
-    const totalPages = () =>
-      Math.ceil(sortedProducts().length / store.pageSize()) || 1;
+    const totalPages = () => undefined;
 
     const paginatedProducts = () => {
killedBy: SearchFilterStore should paginate results properly
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:84:7
     };
 
     const totalPages = () =>
-      Math.ceil(sortedProducts().length / store.pageSize()) || 1;
+      true;
 
     const paginatedProducts = () => {
killedBy: SearchFilterStore should paginate results properly
statusReason: expected true to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/search-filter.store.ts:84:17
     };
 
     const totalPages = () =>
-      Math.ceil(sortedProducts().length / store.pageSize()) || 1;
+      Math.ceil(sortedProducts().length * store.pageSize()) || 1;
 
     const paginatedProducts = () => {
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 10 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:86:37
     const totalPages = () =>
       Math.ceil(sortedProducts().length / store.pageSize()) || 1;
 
-    const paginatedProducts = () => {
-      const page = store.currentPage();
-      const size = store.pageSize();
-      const start = (page - 1) * size;
-      return sortedProducts().slice(start, start + size);
-    };
+    const paginatedProducts = () => {};
 
     const facets = (): ProductFacets => {
killedBy: SearchFilterStore should paginate results properly
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
src/lib/store/search-filter.store.ts:89:21
     const paginatedProducts = () => {
       const page = store.currentPage();
       const size = store.pageSize();
-      const start = (page - 1) * size;
+      const start = (page - 1) / size;
       return sortedProducts().slice(start, start + size);
     };
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 'p3' to be 'p5' // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/search-filter.store.ts:89:22
     const paginatedProducts = () => {
       const page = store.currentPage();
       const size = store.pageSize();
-      const start = (page - 1) * size;
+      const start = (page + 1) * size;
       return sortedProducts().slice(start, start + size);
     };
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
src/lib/store/search-filter.store.ts:90:14
       const page = store.currentPage();
       const size = store.pageSize();
       const start = (page - 1) * size;
-      return sortedProducts().slice(start, start + size);
+      return sortedProducts();
     };
 
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 5 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/search-filter.store.ts:90:44
       const page = store.currentPage();
       const size = store.pageSize();
       const start = (page - 1) * size;
-      return sortedProducts().slice(start, start + size);
+      return sortedProducts().slice(start, start - size);
     };
 
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 3 to be 2 // Object.is equality

[Killed] UnaryOperator
src/lib/store/search-filter.store.ts:98:17
       const categoryCounts: Record<string, number> = {};
       const ratingCounts: Record<number, number> = {};
       let min = Infinity;
-      let max = -Infinity;
+      let max = +Infinity;
       let inStock = 0;
       let outOfStock = 0;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected { min: +0, max: Infinity } to deeply equal { min: +0, max: +0 }

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:102:33
       let inStock = 0;
       let outOfStock = 0;
 
-      for (const p of products) {
-        categoryCounts[p.category] = (categoryCounts[p.category] || 0) + 1;
-        const roundRating = Math.floor(p.rating);
-        ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
-
-        if (p.price < min) min = p.price;
-        if (p.price > max) max = p.price;
-
-        if (p.inStock) inStock++;
-        else outOfStock++;
-      }
+      for (const p of products) {}
 
       return {
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:103:39
       let outOfStock = 0;
 
       for (const p of products) {
-        categoryCounts[p.category] = (categoryCounts[p.category] || 0) + 1;
+        categoryCounts[p.category] = (false) + 1;
         const roundRating = Math.floor(p.rating);
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:103:39
       let outOfStock = 0;
 
       for (const p of products) {
-        categoryCounts[p.category] = (categoryCounts[p.category] || 0) + 1;
+        categoryCounts[p.category] = (true) + 1;
         const roundRating = Math.floor(p.rating);
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/search-filter.store.ts:105:37
       for (const p of products) {
         categoryCounts[p.category] = (categoryCounts[p.category] || 0) + 1;
         const roundRating = Math.floor(p.rating);
-        ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
+        ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) - 1;
 
         if (p.price < min) min = p.price;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected -5 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:105:38
       for (const p of products) {
         categoryCounts[p.category] = (categoryCounts[p.category] || 0) + 1;
         const roundRating = Math.floor(p.rating);
-        ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
+        ratingCounts[roundRating] = (true) + 1;
 
         if (p.price < min) min = p.price;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 2 to be 5 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:107:13
         const roundRating = Math.floor(p.rating);
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
 
-        if (p.price < min) min = p.price;
+        if (p.price >= min) min = p.price;
         if (p.price > max) max = p.price;
 
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected +0 to be 49.99 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:107:13
         const roundRating = Math.floor(p.rating);
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
 
-        if (p.price < min) min = p.price;
+        if (true) min = p.price;
         if (p.price > max) max = p.price;
 
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 249.99 to be 49.99 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:108:13
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
 
         if (p.price < min) min = p.price;
-        if (p.price > max) max = p.price;
+        if (p.price <= max) max = p.price;
 
         if (p.inStock) inStock++;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected +0 to be 499.99 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:108:13
         ratingCounts[roundRating] = (ratingCounts[roundRating] || 0) + 1;
 
         if (p.price < min) min = p.price;
-        if (p.price > max) max = p.price;
+        if (true) max = p.price;
 
         if (p.inStock) inStock++;
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 249.99 to be 499.99 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:110:13
         if (p.price < min) min = p.price;
         if (p.price > max) max = p.price;
 
-        if (p.inStock) inStock++;
+        if (true) inStock++;
         else outOfStock++;
       }
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:110:13
         if (p.price < min) min = p.price;
         if (p.price > max) max = p.price;
 
-        if (p.inStock) inStock++;
+        if (false) inStock++;
         else outOfStock++;
       }
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected +0 to be 4 // Object.is equality

[Killed] UpdateOperator
src/lib/store/search-filter.store.ts:111:14
         if (p.price > max) max = p.price;
 
         if (p.inStock) inStock++;
-        else outOfStock++;
+        else outOfStock--;
       }
 
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:114:14
         else outOfStock++;
       }
 
-      return {
-        categoryCounts,
-        priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
-        stockCount: { inStock, outOfStock },
-        ratingCounts,
-      };
+      return {};
     };
 
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected undefined to deeply equal { min: +0, max: +0 }

[Killed] UnaryOperator
src/lib/store/search-filter.store.ts:116:69
 
       return {
         categoryCounts,
-        priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
+        priceRange: { min: min === Infinity ? 0 : min, max: max === +Infinity ? 0 : max },
         stockCount: { inStock, outOfStock },
         ratingCounts,
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected { min: +0, max: -Infinity } to deeply equal { min: +0, max: +0 }

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:116:61
 
       return {
         categoryCounts,
-        priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
+        priceRange: { min: min === Infinity ? 0 : min, max: false ? 0 : max },
         stockCount: { inStock, outOfStock },
         ratingCounts,
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected { min: +0, max: -Infinity } to deeply equal { min: +0, max: +0 }

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:117:21
       return {
         categoryCounts,
         priceRange: { min: min === Infinity ? 0 : min, max: max === -Infinity ? 0 : max },
-        stockCount: { inStock, outOfStock },
+        stockCount: {},
         ratingCounts,
       };
killedBy: SearchFilterStore should compute product facets correctly including empty state
statusReason: expected {} to deeply equal { inStock: +0, outOfStock: +0 }

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:122:37
       };
     };
 
-    const activeFilterCount = () => {
-      const f = store.filterState();
-      let count = 0;
-      if (f.searchTerm.trim().length > 0) count++;
-      if (f.categories.length > 0) count++;
-      if (f.minPrice > 0 || f.maxPrice < 10000) count++;
-      if (f.minRating > 0) count++;
-      if (f.inStockOnly) count++;
-      return count;
-    };
+    const activeFilterCount = () => {};
 
     const hasActiveFilters = () => activeFilterCount() > 0;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected undefined to be +0 // Object.is equality

[Killed] UpdateOperator
src/lib/store/search-filter.store.ts:125:43
     const activeFilterCount = () => {
       const f = store.filterState();
       let count = 0;
-      if (f.searchTerm.trim().length > 0) count++;
+      if (f.searchTerm.trim().length > 0) count--;
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected -1 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:125:11
     const activeFilterCount = () => {
       const f = store.filterState();
       let count = 0;
-      if (f.searchTerm.trim().length > 0) count++;
+      if (f.searchTerm.trim().length >= 0) count++;
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UpdateOperator
src/lib/store/search-filter.store.ts:126:36
       const f = store.filterState();
       let count = 0;
       if (f.searchTerm.trim().length > 0) count++;
-      if (f.categories.length > 0) count++;
+      if (f.categories.length > 0) count--;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
       if (f.minRating > 0) count++;
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected -1 to be 1 // Object.is equality
