[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:126:11
       const f = store.filterState();
       let count = 0;
       if (f.searchTerm.trim().length > 0) count++;
-      if (f.categories.length > 0) count++;
+      if (f.categories.length <= 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
       if (f.minRating > 0) count++;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:127:11
       let count = 0;
       if (f.searchTerm.trim().length > 0) count++;
       if (f.categories.length > 0) count++;
-      if (f.minPrice > 0 || f.maxPrice < 10000) count++;
+      if (true) count++;
       if (f.minRating > 0) count++;
       if (f.inStockOnly) count++;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:127:29
       let count = 0;
       if (f.searchTerm.trim().length > 0) count++;
       if (f.categories.length > 0) count++;
-      if (f.minPrice > 0 || f.maxPrice < 10000) count++;
+      if (f.minPrice > 0 || f.maxPrice >= 10000) count++;
       if (f.minRating > 0) count++;
       if (f.inStockOnly) count++;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:128:11
       if (f.searchTerm.trim().length > 0) count++;
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
-      if (f.minRating > 0) count++;
+      if (true) count++;
       if (f.inStockOnly) count++;
       return count;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:128:11
       if (f.searchTerm.trim().length > 0) count++;
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
-      if (f.minRating > 0) count++;
+      if (f.minRating >= 0) count++;
       if (f.inStockOnly) count++;
       return count;
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:129:11
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
       if (f.minRating > 0) count++;
-      if (f.inStockOnly) count++;
+      if (true) count++;
       return count;
     };
killedBy: SearchFilterStore should initialize with all products
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UpdateOperator
src/lib/store/search-filter.store.ts:129:26
       if (f.categories.length > 0) count++;
       if (f.minPrice > 0 || f.maxPrice < 10000) count++;
       if (f.minRating > 0) count++;
-      if (f.inStockOnly) count++;
+      if (f.inStockOnly) count--;
       return count;
     };
killedBy: SearchFilterStore should filter in-stock products only
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/search-filter.store.ts:133:36
       return count;
     };
 
-    const hasActiveFilters = () => activeFilterCount() > 0;
+    const hasActiveFilters = () => false;
 
     return {
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:133:36
       return count;
     };
 
-    const hasActiveFilters = () => activeFilterCount() > 0;
+    const hasActiveFilters = () => activeFilterCount() >= 0;
 
     return {
killedBy: SearchFilterStore should initialize with all products
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:135:12
 
     const hasActiveFilters = () => activeFilterCount() > 0;
 
-    return {
-      filteredProducts,
-      sortedProducts,
-      paginatedProducts,
-      totalPages,
-      facets,
-      activeFilterCount,
-      hasActiveFilters,
-    };
+    return {};
   }),
   withMethods((store) => ({
killedBy: SearchFilterStore should initialize with all products
statusReason: store.filteredProducts is not a function

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:146:38
     };
   }),
   withMethods((store) => ({
-    setProducts(products: Product[]) {
-      patchState(store, { allProducts: products, currentPage: 1 });
-    },
+    setProducts(products: Product[]) {},
 
     updateSearchTerm(term: string) {
killedBy: SearchFilterStore should initialize with all products
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:150:36
       patchState(store, { allProducts: products, currentPage: 1 });
     },
 
-    updateSearchTerm(term: string) {
-      patchState(store, {
-        filterState: { ...store.filterState(), searchTerm: term },
-        currentPage: 1,
-      });
-    },
+    updateSearchTerm(term: string) {},
 
     toggleCategory(category: string) {
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:151:25
     },
 
     updateSearchTerm(term: string) {
-      patchState(store, {
-        filterState: { ...store.filterState(), searchTerm: term },
-        currentPage: 1,
-      });
+      patchState(store, {});
     },
 
killedBy: SearchFilterStore should filter products by search term matching name
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:157:38
       });
     },
 
-    toggleCategory(category: string) {
-      const current = store.filterState().categories;
-      const updated = current.includes(category)
-        ? current.filter((c) => c !== category)
-        : [...current, category];
-      patchState(store, {
-        filterState: { ...store.filterState(), categories: updated },
-        currentPage: 1,
-      });
-    },
+    toggleCategory(category: string) {},
 
     setPriceRange(min: number, max: number) {
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected 5 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/store/search-filter.store.ts:160:26
     toggleCategory(category: string) {
       const current = store.filterState().categories;
       const updated = current.includes(category)
-        ? current.filter((c) => c !== category)
+        ? current.filter(() => undefined)
         : [...current, category];
       patchState(store, {
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected 5 to be 2 // Object.is equality

[Killed] EqualityOperator
src/lib/store/search-filter.store.ts:160:33
     toggleCategory(category: string) {
       const current = store.filterState().categories;
       const updated = current.includes(category)
-        ? current.filter((c) => c !== category)
+        ? current.filter((c) => c === category)
         : [...current, category];
       patchState(store, {
killedBy: SearchFilterStore should filter products by category toggle (selection and unselection)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:168:45
       });
     },
 
-    setPriceRange(min: number, max: number) {
-      patchState(store, {
-        filterState: { ...store.filterState(), minPrice: min, maxPrice: max },
-        currentPage: 1,
-      });
-    },
+    setPriceRange(min: number, max: number) {},
 
     setMinRating(rating: number) {
killedBy: SearchFilterStore should filter products by exact price boundaries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:175:34
       });
     },
 
-    setMinRating(rating: number) {
-      patchState(store, {
-        filterState: { ...store.filterState(), minRating: rating },
-        currentPage: 1,
-      });
-    },
+    setMinRating(rating: number) {},
 
     toggleInStockOnly() {
killedBy: SearchFilterStore should filter products by minimum rating
statusReason: expected 5 to be 3 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:176:25
     },
 
     setMinRating(rating: number) {
-      patchState(store, {
-        filterState: { ...store.filterState(), minRating: rating },
-        currentPage: 1,
-      });
+      patchState(store, {});
     },
 
killedBy: SearchFilterStore should filter products by minimum rating
statusReason: expected 5 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:182:25
       });
     },
 
-    toggleInStockOnly() {
-      patchState(store, {
-        filterState: {
-          ...store.filterState(),
-          inStockOnly: !store.filterState().inStockOnly,
-        },
-        currentPage: 1,
-      });
-    },
+    toggleInStockOnly() {},
 
     setSortOption(option: SortOption) {
killedBy: SearchFilterStore should filter in-stock products only
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/search-filter.store.ts:184:22
 
     toggleInStockOnly() {
       patchState(store, {
-        filterState: {
-          ...store.filterState(),
-          inStockOnly: !store.filterState().inStockOnly,
-        },
+        filterState: {},
         currentPage: 1,
       });
killedBy: SearchFilterStore should filter in-stock products only
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/lib/store/search-filter.store.ts:186:24
       patchState(store, {
         filterState: {
           ...store.filterState(),
-          inStockOnly: !store.filterState().inStockOnly,
+          inStockOnly: store.filterState().inStockOnly,
         },
         currentPage: 1,
killedBy: SearchFilterStore should filter in-stock products only
statusReason: expected 5 to be 4 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:192:39
       });
     },
 
-    setSortOption(option: SortOption) {
-      patchState(store, { sortOption: option });
-    },
+    setSortOption(option: SortOption) {},
 
     setPage(page: number) {
killedBy: SearchFilterStore should sort products by price ascending and descending
statusReason: expected [ Array(5) ] to deeply equal [ Array(5) ]

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:196:27
       patchState(store, { sortOption: option });
     },
 
-    setPage(page: number) {
-      patchState(store, { currentPage: page });
-    },
+    setPage(page: number) {},
 
     setPageSize(size: number) {
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 'p3' to be 'p5' // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:200:31
       patchState(store, { currentPage: page });
     },
 
-    setPageSize(size: number) {
-      patchState(store, { pageSize: size, currentPage: 1 });
-    },
+    setPageSize(size: number) {},
 
     resetFilters() {
killedBy: SearchFilterStore should paginate results properly
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/store/search-filter.store.ts:204:20
       patchState(store, { pageSize: size, currentPage: 1 });
     },
 
-    resetFilters() {
-      patchState(store, {
-        filterState: initialFilterState,
-        currentPage: 1,
-      });
-    },
+    resetFilters() {},
   }))
 );
killedBy: SearchFilterStore should reset all filters
statusReason: expected true to be false // Object.is equality
