[Killed] BlockStatement
src/lib/product-card/product-card.component.ts:151:25
   readonly product = input.required<Product>();
   readonly productClick = output<Product>();
 
-  getStars(): boolean[] {
-    const rating = this.product().rating;
-    const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
-
-    return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
-      return false;
-    });
-  }
+  getStars(): boolean[] {}
 }
killedBy: ProductCardComponent should calculate star ratings correctly
statusReason: expected undefined to deeply equal [ true, true, true, true, true ]

[Killed] ConditionalExpression
src/lib/product-card/product-card.component.ts:154:25
   getStars(): boolean[] {
     const rating = this.product().rating;
     const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
+    const hasHalfStar = false;
 
     return Array(5).fill(false).map((_, index) => {
killedBy: ProductCardComponent should calculate star ratings correctly
statusReason: expected [ true, true, true, true, false ] to deeply equal [ true, true, true, true, true ]

[Killed] ArithmeticOperator
src/lib/product-card/product-card.component.ts:154:25
   getStars(): boolean[] {
     const rating = this.product().rating;
     const fullStars = Math.floor(rating);
-    const hasHalfStar = rating % 1 >= 0.5;
+    const hasHalfStar = rating * 1 >= 0.5;
 
     return Array(5).fill(false).map((_, index) => {
killedBy: ProductCardComponent should handle product with low rating
statusReason: expected [ true, true, true, false, false ] to deeply equal [ true, true, false, false, false ]

[Killed] ConditionalExpression
src/lib/product-card/product-card.component.ts:157:11
     const hasHalfStar = rating % 1 >= 0.5;
 
     return Array(5).fill(false).map((_, index) => {
-      if (index < fullStars) return true;
+      if (true) return true;
       if (index === fullStars && hasHalfStar) return true;
       return false;
killedBy: ProductCardComponent should handle product with low rating
statusReason: expected [ true, true, true, true, true ] to deeply equal [ true, true, false, false, false ]

[Killed] ConditionalExpression
src/lib/product-card/product-card.component.ts:158:11
 
     return Array(5).fill(false).map((_, index) => {
       if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
+      if (true) return true;
       return false;
     });
killedBy: ProductCardComponent should handle product with low rating
statusReason: expected [ true, true, true, true, true ] to deeply equal [ true, true, false, false, false ]

[Killed] LogicalOperator
src/lib/product-card/product-card.component.ts:158:11
 
     return Array(5).fill(false).map((_, index) => {
       if (index < fullStars) return true;
-      if (index === fullStars && hasHalfStar) return true;
+      if (index === fullStars || hasHalfStar) return true;
       return false;
     });
killedBy: ProductCardComponent should handle product with low rating
statusReason: expected [ true, true, true, false, false ] to deeply equal [ true, true, false, false, false ]
