[Survived] ArrayDeclaration
src/lib/store/wishlist.store.ts:11:13
 }
 
 const initialState: WishlistCompareState = {
-  wishlist: [],
+  wishlist: ["Stryker was here"],
   compareList: [],
   maxCompareLimit: 4,

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:20:27
   { providedIn: 'root' },
   withState(initialState),
   withComputed((store) => {
-    const wishlistCount = () => store.wishlist().length;
+    const wishlistCount = () => undefined;
     const compareCount = () => store.compareList().length;
 
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:21:26
   withState(initialState),
   withComputed((store) => {
     const wishlistCount = () => store.wishlist().length;
-    const compareCount = () => store.compareList().length;
+    const compareCount = () => undefined;
 
     const canAddToCompare = () =>
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:23:29
     const wishlistCount = () => store.wishlist().length;
     const compareCount = () => store.compareList().length;
 
-    const canAddToCompare = () =>
-      store.compareList().length < store.maxCompareLimit();
+    const canAddToCompare = () => undefined;
 
     const wishlistTotalValue = () =>
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:24:7
     const compareCount = () => store.compareList().length;
 
     const canAddToCompare = () =>
-      store.compareList().length < store.maxCompareLimit();
+      false;
 
     const wishlistTotalValue = () =>
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:24:7
     const compareCount = () => store.compareList().length;
 
     const canAddToCompare = () =>
-      store.compareList().length < store.maxCompareLimit();
+      store.compareList().length >= store.maxCompareLimit();
 
     const wishlistTotalValue = () =>
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:26:32
     const canAddToCompare = () =>
       store.compareList().length < store.maxCompareLimit();
 
-    const wishlistTotalValue = () =>
-      store.wishlist().reduce((sum, p) => sum + p.price, 0);
+    const wishlistTotalValue = () => undefined;
 
     const comparisonMatrix = () => {
killedBy: WishlistCompareStore should compute wishlist total price
statusReason: expected undefined to be 1698 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:27:31
       store.compareList().length < store.maxCompareLimit();
 
     const wishlistTotalValue = () =>
-      store.wishlist().reduce((sum, p) => sum + p.price, 0);
+      store.wishlist().reduce(() => undefined, 0);
 
     const comparisonMatrix = () => {
killedBy: WishlistCompareStore should compute wishlist total price
statusReason: expected undefined to be 1698 // Object.is equality

[Killed] ArithmeticOperator
src/lib/store/wishlist.store.ts:27:43
       store.compareList().length < store.maxCompareLimit();
 
     const wishlistTotalValue = () =>
-      store.wishlist().reduce((sum, p) => sum + p.price, 0);
+      store.wishlist().reduce((sum, p) => sum - p.price, 0);
 
     const comparisonMatrix = () => {
killedBy: WishlistCompareStore should compute wishlist total price
statusReason: expected -1698 to be 1698 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:31:11
 
     const comparisonMatrix = () => {
       const list = store.compareList();
-      if (list.length === 0) {
+      if (false) {
         return {
           cheapestProduct: null,
killedBy: WishlistCompareStore should return empty stats matrix when compareList is empty
statusReason: Reduce of empty array with no initial value

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:31:11
 
     const comparisonMatrix = () => {
       const list = store.compareList();
-      if (list.length === 0) {
+      if (true) {
         return {
           cheapestProduct: null,
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected undefined to be 'p3' // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:40:43
         };
       }
 
-      const cheapestProduct = list.reduce((prev, curr) =>
-        curr.price < prev.price ? curr : prev
+      const cheapestProduct = list.reduce(() => undefined
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected undefined to be 'p3' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:41:9
       }
 
       const cheapestProduct = list.reduce((prev, curr) =>
-        curr.price < prev.price ? curr : prev
+        false ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected 'p1' to be 'p3' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:41:9
       }
 
       const cheapestProduct = list.reduce((prev, curr) =>
-        curr.price < prev.price ? curr : prev
+        true ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
killedBy: WishlistCompareStore should handle equal prices and ratings in comparison matrix consistently
statusReason: expected 'pe2' to be 'pe1' // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:43:47
       const cheapestProduct = list.reduce((prev, curr) =>
         curr.price < prev.price ? curr : prev
       );
-      const highestRatedProduct = list.reduce((prev, curr) =>
-        curr.rating > prev.rating ? curr : prev
+      const highestRatedProduct = list.reduce(() => undefined
       );
       const inStockCount = list.filter((p) => p.inStock).length;
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected undefined to be 'p1' // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:44:9
         curr.price < prev.price ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
-        curr.rating > prev.rating ? curr : prev
+        true ? curr : prev
       );
       const inStockCount = list.filter((p) => p.inStock).length;
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected 'p3' to be 'p1' // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:44:9
         curr.price < prev.price ? curr : prev
       );
       const highestRatedProduct = list.reduce((prev, curr) =>
-        curr.rating > prev.rating ? curr : prev
+        curr.rating >= prev.rating ? curr : prev
       );
       const inStockCount = list.filter((p) => p.inStock).length;
killedBy: WishlistCompareStore should handle equal prices and ratings in comparison matrix consistently
statusReason: expected 'pe2' to be 'pe1' // Object.is equality

[Killed] MethodExpression
src/lib/store/wishlist.store.ts:46:28
       const highestRatedProduct = list.reduce((prev, curr) =>
         curr.rating > prev.rating ? curr : prev
       );
-      const inStockCount = list.filter((p) => p.inStock).length;
+      const inStockCount = list.length;
       const categories = Array.from(new Set(list.map((p) => p.category)));
 
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:46:40
       const highestRatedProduct = list.reduce((prev, curr) =>
         curr.rating > prev.rating ? curr : prev
       );
-      const inStockCount = list.filter((p) => p.inStock).length;
+      const inStockCount = list.filter(() => undefined).length;
       const categories = Array.from(new Set(list.map((p) => p.category)));
 
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:47:54
         curr.rating > prev.rating ? curr : prev
       );
       const inStockCount = list.filter((p) => p.inStock).length;
-      const categories = Array.from(new Set(list.map((p) => p.category)));
+      const categories = Array.from(new Set(list.map(() => undefined)));
 
       return {
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected [ undefined ] to deeply equal [ 'Electronics' ]

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:49:14
       const inStockCount = list.filter((p) => p.inStock).length;
       const categories = Array.from(new Set(list.map((p) => p.category)));
 
-      return {
-        cheapestProduct,
-        highestRatedProduct,
-        inStockCount,
-        categories,
-      };
+      return {};
     };
 
killedBy: WishlistCompareStore should calculate comparison matrix statistics with strict price and rating tie-breakers
statusReason: expected undefined to be 'p3' // Object.is equality

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:57:12
       };
     };
 
-    return {
-      wishlistCount,
-      compareCount,
-      canAddToCompare,
-      wishlistTotalValue,
-      comparisonMatrix,
-    };
+    return {};
   }),
   withMethods((store) => ({
killedBy: WishlistCompareStore should initialize with empty wishlist and compare state
statusReason: store.wishlistCount is not a function

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:66:46
     };
   }),
   withMethods((store) => ({
-    isWishlisted(productId: string): boolean {
-      return store.wishlist().some((p) => p.id === productId);
-    },
+    isWishlisted(productId: string): boolean {},
 
     isCompared(productId: string): boolean {
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:67:36
   }),
   withMethods((store) => ({
     isWishlisted(productId: string): boolean {
-      return store.wishlist().some((p) => p.id === productId);
+      return store.wishlist().some(() => undefined);
     },
 
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/store/wishlist.store.ts:67:14
   }),
   withMethods((store) => ({
     isWishlisted(productId: string): boolean {
-      return store.wishlist().some((p) => p.id === productId);
+      return store.wishlist().every(p => p.id === productId);
     },
 
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:70:44
       return store.wishlist().some((p) => p.id === productId);
     },
 
-    isCompared(productId: string): boolean {
-      return store.compareList().some((p) => p.id === productId);
-    },
+    isCompared(productId: string): boolean {},
 
     toggleWishlist(product: Product) {
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/lib/store/wishlist.store.ts:71:14
     },
 
     isCompared(productId: string): boolean {
-      return store.compareList().some((p) => p.id === productId);
+      return store.compareList().every(p => p.id === productId);
     },
 
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/store/wishlist.store.ts:71:39
     },
 
     isCompared(productId: string): boolean {
-      return store.compareList().some((p) => p.id === productId);
+      return store.compareList().some(() => undefined);
     },
 
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:74:38
       return store.compareList().some((p) => p.id === productId);
     },
 
-    toggleWishlist(product: Product) {
-      const exists = this.isWishlisted(product.id);
-      if (exists) {
-        patchState(store, {
-          wishlist: store.wishlist().filter((p) => p.id !== product.id),
-        });
-      } else {
-        patchState(store, { wishlist: [...store.wishlist(), product] });
-      }
-    },
+    toggleWishlist(product: Product) {},
 
     addToCompare(product: Product): { success: boolean; message?: string } {
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:76:11
 
     toggleWishlist(product: Product) {
       const exists = this.isWishlisted(product.id);
-      if (exists) {
+      if (false) {
         patchState(store, {
           wishlist: store.wishlist().filter((p) => p.id !== product.id),
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:76:11
 
     toggleWishlist(product: Product) {
       const exists = this.isWishlisted(product.id);
-      if (exists) {
+      if (true) {
         patchState(store, {
           wishlist: store.wishlist().filter((p) => p.id !== product.id),
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:78:52
       const exists = this.isWishlisted(product.id);
       if (exists) {
         patchState(store, {
-          wishlist: store.wishlist().filter((p) => p.id !== product.id),
+          wishlist: store.wishlist().filter((p) => p.id === product.id),
         });
       } else {
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected 1 to be +0 // Object.is equality

[Killed] MethodExpression
src/lib/store/wishlist.store.ts:78:21
       const exists = this.isWishlisted(product.id);
       if (exists) {
         patchState(store, {
-          wishlist: store.wishlist().filter((p) => p.id !== product.id),
+          wishlist: store.wishlist(),
         });
       } else {
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:80:14
         patchState(store, {
           wishlist: store.wishlist().filter((p) => p.id !== product.id),
         });
-      } else {
-        patchState(store, { wishlist: [...store.wishlist(), product] });
-      }
+      } else {}
     },
 
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:81:27
           wishlist: store.wishlist().filter((p) => p.id !== product.id),
         });
       } else {
-        patchState(store, { wishlist: [...store.wishlist(), product] });
+        patchState(store, {});
       }
     },
killedBy: WishlistCompareStore should toggle items in wishlist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:85:76
       }
     },
 
-    addToCompare(product: Product): { success: boolean; message?: string } {
-      if (this.isCompared(product.id)) {
-        return { success: true };
-      }
-      if (store.compareList().length >= store.maxCompareLimit()) {
-        return {
-          success: false,
-          message: `Maximum ${store.maxCompareLimit()} items allowed in comparison`,
-        };
-      }
-      patchState(store, { compareList: [...store.compareList(), product] });
-      return { success: true };
-    },
+    addToCompare(product: Product): { success: boolean; message?: string } {},
 
     removeFromCompare(productId: string) {
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:86:11
     },
 
     addToCompare(product: Product): { success: boolean; message?: string } {
-      if (this.isCompared(product.id)) {
+      if (true) {
         return { success: true };
       }
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/store/wishlist.store.ts:86:11
     },
 
     addToCompare(product: Product): { success: boolean; message?: string } {
-      if (this.isCompared(product.id)) {
+      if (false) {
         return { success: true };
       }
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/wishlist.store.ts:87:27
 
     addToCompare(product: Product): { success: boolean; message?: string } {
       if (this.isCompared(product.id)) {
-        return { success: true };
+        return { success: false };
       }
       if (store.compareList().length >= store.maxCompareLimit()) {
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:87:16
 
     addToCompare(product: Product): { success: boolean; message?: string } {
       if (this.isCompared(product.id)) {
-        return { success: true };
+        return {};
       }
       if (store.compareList().length >= store.maxCompareLimit()) {
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:89:66
       if (this.isCompared(product.id)) {
         return { success: true };
       }
-      if (store.compareList().length >= store.maxCompareLimit()) {
-        return {
-          success: false,
-          message: `Maximum ${store.maxCompareLimit()} items allowed in comparison`,
-        };
-      }
+      if (store.compareList().length >= store.maxCompareLimit()) {}
       patchState(store, { compareList: [...store.compareList(), product] });
       return { success: true };
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:89:11
       if (this.isCompared(product.id)) {
         return { success: true };
       }
-      if (store.compareList().length >= store.maxCompareLimit()) {
+      if (store.compareList().length < store.maxCompareLimit()) {
         return {
           success: false,
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/store/wishlist.store.ts:95:40
           message: `Maximum ${store.maxCompareLimit()} items allowed in comparison`,
         };
       }
-      patchState(store, { compareList: [...store.compareList(), product] });
+      patchState(store, { compareList: [] });
       return { success: true };
     },
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/store/wishlist.store.ts:96:25
         };
       }
       patchState(store, { compareList: [...store.compareList(), product] });
-      return { success: true };
+      return { success: false };
     },
 
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:96:14
         };
       }
       patchState(store, { compareList: [...store.compareList(), product] });
-      return { success: true };
+      return {};
     },
 
killedBy: WishlistCompareStore should add products to comparison list up to limit 4 and handle duplicates
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:99:42
       return { success: true };
     },
 
-    removeFromCompare(productId: string) {
-      patchState(store, {
-        compareList: store.compareList().filter((p) => p.id !== productId),
-      });
-    },
+    removeFromCompare(productId: string) {},
 
     clearCompare() {
killedBy: WishlistCompareStore should remove items from comparison list and clear compare list
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/store/wishlist.store.ts:101:22
 
     removeFromCompare(productId: string) {
       patchState(store, {
-        compareList: store.compareList().filter((p) => p.id !== productId),
+        compareList: store.compareList(),
       });
     },
killedBy: WishlistCompareStore should remove items from comparison list and clear compare list
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/store/wishlist.store.ts:101:56
 
     removeFromCompare(productId: string) {
       patchState(store, {
-        compareList: store.compareList().filter((p) => p.id !== productId),
+        compareList: store.compareList().filter((p) => p.id === productId),
       });
     },
killedBy: WishlistCompareStore should remove items from comparison list and clear compare list
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:105:20
       });
     },
 
-    clearCompare() {
-      patchState(store, { compareList: [] });
-    },
+    clearCompare() {},
 
     clearWishlist() {
killedBy: WishlistCompareStore should remove items from comparison list and clear compare list
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/store/wishlist.store.ts:109:21
       patchState(store, { compareList: [] });
     },
 
-    clearWishlist() {
-      patchState(store, { wishlist: [] });
-    },
+    clearWishlist() {},
   }))
 );
killedBy: WishlistCompareStore should clear wishlist when clearWishlist() is called
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/lib/store/wishlist.store.ts:110:25
     },
 
     clearWishlist() {
-      patchState(store, { wishlist: [] });
+      patchState(store, {});
     },
   }))
killedBy: WishlistCompareStore should clear wishlist when clearWishlist() is called
statusReason: expected 2 to be +0 // Object.is equality
